[Survived] StringLiteral
src/api/client.ts:12:17
     public readonly fieldErrors?: FieldErrors,
   ) {
     super(message)
-    this.name = 'ApiError'
+    this.name = ""
   }
 }

[Killed] BlockStatement
src/api/client.ts:22:86
  * (z. B. 401 aus der Security-Filterkette): dann bleibt das Ergebnis leer und der
  * Aufrufer fällt auf den Roh-Body zurück.
  */
-function parseProblem(body: string): { message?: string; fieldErrors?: FieldErrors } {
-  let data: unknown
-  try {
-    data = JSON.parse(body)
-  } catch {
-    return {}
-  }
-  if (typeof data !== 'object' || data === null) return {}
-  const problem = data as Record<string, unknown>
-  return {
-    message: firstNonEmptyString(problem.detail, problem.title),
-    fieldErrors: toFieldErrors(problem.fieldErrors),
-  }
-}
+function parseProblem(body: string): { message?: string; fieldErrors?: FieldErrors } {}
 
 function firstNonEmptyString(...values: unknown[]): string | undefined {
killedBy: NightRunPage — aufbewahrte Läufe beim Öffnen meldet einen Fehler beim Laden der aufbewahrten Läufe
statusReason: Unable to find an element with the text: Nur der Owner darf die Auswertung sehen.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] BlockStatement
src/api/client.ts:24:7
  */
 function parseProblem(body: string): { message?: string; fieldErrors?: FieldErrors } {
   let data: unknown
-  try {
-    data = JSON.parse(body)
-  } catch {
+  try {} catch {
     return {}
   }
killedBy: NightRunPage — aufbewahrte Läufe beim Öffnen meldet einen Fehler beim Laden der aufbewahrten Läufe
statusReason: Unable to find an element with the text: Nur der Owner darf die Auswertung sehen.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Survived] BlockStatement
src/api/client.ts:26:11
   let data: unknown
   try {
     data = JSON.parse(body)
-  } catch {
-    return {}
-  }
+  } catch {}
   if (typeof data !== 'object' || data === null) return {}
   const problem = data as Record<string, unknown>

[Killed] ConditionalExpression
src/api/client.ts:29:7
   } catch {
     return {}
   }
-  if (typeof data !== 'object' || data === null) return {}
+  if (false) return {}
   const problem = data as Record<string, unknown>
   return {
killedBy: apiFetch – ApiError aus RFC-9457 Problem Details fällt bei JSON null auf den Roh-Body zurück
statusReason: Cannot read properties of null (reading 'detail')

[Killed] ConditionalExpression
src/api/client.ts:29:35
   } catch {
     return {}
   }
-  if (typeof data !== 'object' || data === null) return {}
+  if (typeof data !== 'object' || false) return {}
   const problem = data as Record<string, unknown>
   return {
killedBy: apiFetch – ApiError aus RFC-9457 Problem Details fällt bei JSON null auf den Roh-Body zurück
statusReason: Cannot read properties of null (reading 'detail')

[Killed] ObjectLiteral
src/api/client.ts:31:10
   }
   if (typeof data !== 'object' || data === null) return {}
   const problem = data as Record<string, unknown>
-  return {
-    message: firstNonEmptyString(problem.detail, problem.title),
-    fieldErrors: toFieldErrors(problem.fieldErrors),
-  }
+  return {}
 }
 
killedBy: apiFetch – ApiError aus RFC-9457 Problem Details nutzt detail als message
statusReason: expected '{"type":"about:blank","title":"Not Fo…' to be 'Karte nicht gefunden' // Object.is equality

[Killed] BlockStatement
src/api/client.ts:37:72
   }
 }
 
-function firstNonEmptyString(...values: unknown[]): string | undefined {
-  return values.find((value): value is string => typeof value === 'string' && value !== '')
-}
+function firstNonEmptyString(...values: unknown[]): string | undefined {}
 
 function toFieldErrors(value: unknown): FieldErrors | undefined {
killedBy: apiFetch – ApiError aus RFC-9457 Problem Details nutzt detail als message
statusReason: expected '{"type":"about:blank","title":"Not Fo…' to be 'Karte nicht gefunden' // Object.is equality

[Killed] EqualityOperator
src/api/client.ts:38:50
 }
 
 function firstNonEmptyString(...values: unknown[]): string | undefined {
-  return values.find((value): value is string => typeof value === 'string' && value !== '')
+  return values.find((value): value is string => typeof value !== 'string' && value !== '')
 }
 
killedBy: apiFetch – ApiError aus RFC-9457 Problem Details nutzt detail als message
statusReason: expected '{"type":"about:blank","title":"Not Fo…' to be 'Karte nicht gefunden' // Object.is equality

[Killed] EqualityOperator
src/api/client.ts:38:79
 }
 
 function firstNonEmptyString(...values: unknown[]): string | undefined {
-  return values.find((value): value is string => typeof value === 'string' && value !== '')
+  return values.find((value): value is string => typeof value === 'string' && value === '')
 }
 
killedBy: apiFetch – ApiError aus RFC-9457 Problem Details nutzt detail als message
statusReason: expected '{"type":"about:blank","title":"Not Fo…' to be 'Karte nicht gefunden' // Object.is equality

[Killed] BlockStatement
src/api/client.ts:41:65
   return values.find((value): value is string => typeof value === 'string' && value !== '')
 }
 
-function toFieldErrors(value: unknown): FieldErrors | undefined {
-  if (typeof value !== 'object' || value === null) return undefined
-  const entries = Object.entries(value as Record<string, unknown>).filter(
-    (entry): entry is [string, string] => typeof entry[1] === 'string',
-  )
-  return entries.length > 0 ? Object.fromEntries(entries) : undefined
-}
+function toFieldErrors(value: unknown): FieldErrors | undefined {}
 
 /**
killedBy: apiFetch – ApiError aus RFC-9457 Problem Details stellt fieldErrors typisiert bereit
statusReason: expected undefined to deeply equal { title: 'darf nicht leer sein', …(1) }

[Killed] ConditionalExpression
src/api/client.ts:42:7
 }
 
 function toFieldErrors(value: unknown): FieldErrors | undefined {
-  if (typeof value !== 'object' || value === null) return undefined
+  if (true) return undefined
   const entries = Object.entries(value as Record<string, unknown>).filter(
     (entry): entry is [string, string] => typeof entry[1] === 'string',
killedBy: apiFetch – ApiError aus RFC-9457 Problem Details stellt fieldErrors typisiert bereit
statusReason: expected undefined to deeply equal { title: 'darf nicht leer sein', …(1) }

[Killed] ConditionalExpression
src/api/client.ts:42:7
 }
 
 function toFieldErrors(value: unknown): FieldErrors | undefined {
-  if (typeof value !== 'object' || value === null) return undefined
+  if (false) return undefined
   const entries = Object.entries(value as Record<string, unknown>).filter(
     (entry): entry is [string, string] => typeof entry[1] === 'string',
killedBy: apiFetch – ApiError aus RFC-9457 Problem Details nutzt detail als message
statusReason: Cannot convert undefined or null to object

[Killed] MethodExpression
src/api/client.ts:43:19
 
 function toFieldErrors(value: unknown): FieldErrors | undefined {
   if (typeof value !== 'object' || value === null) return undefined
-  const entries = Object.entries(value as Record<string, unknown>).filter(
-    (entry): entry is [string, string] => typeof entry[1] === 'string',
-  )
+  const entries = Object.entries(value as Record<string, unknown>)
   return entries.length > 0 ? Object.fromEntries(entries) : undefined
 }
killedBy: apiFetch – ApiError aus RFC-9457 Problem Details ignoriert Nicht-String-Werte in fieldErrors
statusReason: expected { count: 3 } to be undefined

[Killed] ConditionalExpression
src/api/client.ts:44:43
 function toFieldErrors(value: unknown): FieldErrors | undefined {
   if (typeof value !== 'object' || value === null) return undefined
   const entries = Object.entries(value as Record<string, unknown>).filter(
-    (entry): entry is [string, string] => typeof entry[1] === 'string',
+    (entry): entry is [string, string] => false,
   )
   return entries.length > 0 ? Object.fromEntries(entries) : undefined
killedBy: apiFetch – ApiError aus RFC-9457 Problem Details stellt fieldErrors typisiert bereit
statusReason: expected undefined to deeply equal { title: 'darf nicht leer sein', …(1) }

[Killed] ArrowFunction
src/api/client.ts:44:5
 function toFieldErrors(value: unknown): FieldErrors | undefined {
   if (typeof value !== 'object' || value === null) return undefined
   const entries = Object.entries(value as Record<string, unknown>).filter(
-    (entry): entry is [string, string] => typeof entry[1] === 'string',
+    () => undefined,
   )
   return entries.length > 0 ? Object.fromEntries(entries) : undefined
killedBy: apiFetch – ApiError aus RFC-9457 Problem Details stellt fieldErrors typisiert bereit
statusReason: expected undefined to deeply equal { title: 'darf nicht leer sein', …(1) }

[Killed] ConditionalExpression
src/api/client.ts:46:10
   const entries = Object.entries(value as Record<string, unknown>).filter(
     (entry): entry is [string, string] => typeof entry[1] === 'string',
   )
-  return entries.length > 0 ? Object.fromEntries(entries) : undefined
+  return true ? Object.fromEntries(entries) : undefined
 }
 
killedBy: apiFetch – ApiError aus RFC-9457 Problem Details ignoriert Nicht-String-Werte in fieldErrors
statusReason: expected {} to be undefined

[Killed] ConditionalExpression
src/api/client.ts:46:10
   const entries = Object.entries(value as Record<string, unknown>).filter(
     (entry): entry is [string, string] => typeof entry[1] === 'string',
   )
-  return entries.length > 0 ? Object.fromEntries(entries) : undefined
+  return false ? Object.fromEntries(entries) : undefined
 }
 
killedBy: apiFetch – ApiError aus RFC-9457 Problem Details stellt fieldErrors typisiert bereit
statusReason: expected undefined to deeply equal { title: 'darf nicht leer sein', …(1) }

[Killed] BlockStatement
src/api/client.ts:57:15
   path: string,
   options: RequestInit = {},
   parse?: (data: unknown) => T,
-): Promise<T> {
-  const response = await fetch(path, {
-    credentials: 'include',
-    headers: { 'Content-Type': 'application/json', ...options.headers },
-    ...options,
-  })
-
-  if (!response.ok) {
-    const body = await response.text().catch(() => '')
-    const problem = parseProblem(body)
-    throw new ApiError(
-      response.status,
-      problem.message ?? (body || response.statusText),
-      problem.fieldErrors,
-    )
-  }
-
-  const text = await response.text()
-  // Extern stammende Daten sind `unknown`, bis validiert. Sicherheitsrelevante Endpoints
-  // übergeben einen `parse`-Type-Guard (z. B. authApi.me/login). Ohne `parse` bleibt der
-  // Wrapper generisch: der Cast auf T ist die bewusst dokumentierte Systemgrenze eines
-  // typisierten fetch-Wrappers — kein Cast zur Umgehung eines Modellfehlers.
-  const data: unknown = text ? JSON.parse(text) : undefined
-  return parse ? parse(data) : (data as T)
-}
+): Promise<T> {}
 
killedBy: cardsApi list ruft GET /api/boards/{id}/cards und liefert die geparste Antwort
statusReason: expected undefined to deeply equal [ { id: 1, boardId: 3, …(15) } ]

[Killed] ObjectLiteral
src/api/client.ts:58:38
   options: RequestInit = {},
   parse?: (data: unknown) => T,
 ): Promise<T> {
-  const response = await fetch(path, {
-    credentials: 'include',
-    headers: { 'Content-Type': 'application/json', ...options.headers },
-    ...options,
-  })
+  const response = await fetch(path, {})
 
   if (!response.ok) {
killedBy: authApi – restliche Endpunkte updateProfile ruft PATCH /api/me mit dem Anzeigenamen und validiert die Antwort
statusReason: expected undefined to be 'PATCH' // Object.is equality

[Survived] StringLiteral
src/api/client.ts:59:18
   parse?: (data: unknown) => T,
 ): Promise<T> {
   const response = await fetch(path, {
-    credentials: 'include',
+    credentials: "",
     headers: { 'Content-Type': 'application/json', ...options.headers },
     ...options,

[Killed] BlockStatement
src/api/client.ts:64:21
     ...options,
   })
 
-  if (!response.ok) {
-    const body = await response.text().catch(() => '')
-    const problem = parseProblem(body)
-    throw new ApiError(
-      response.status,
-      problem.message ?? (body || response.statusText),
-      problem.fieldErrors,
-    )
-  }
+  if (!response.ok) {}
 
   const text = await response.text()
killedBy: NightRunPage — aufbewahrte Läufe beim Öffnen meldet einen Fehler beim Laden der aufbewahrten Läufe
statusReason: Unable to find an element with the text: Nur der Owner darf die Auswertung sehen.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Survived] ArrowFunction
src/api/client.ts:65:46
   })
 
   if (!response.ok) {
-    const body = await response.text().catch(() => '')
+    const body = await response.text().catch(() => undefined)
     const problem = parseProblem(body)
     throw new ApiError(

[Killed] LogicalOperator
src/api/client.ts:69:7
     const problem = parseProblem(body)
     throw new ApiError(
       response.status,
-      problem.message ?? (body || response.statusText),
+      problem.message && (body || response.statusText),
       problem.fieldErrors,
     )
killedBy: NightRunPage — aufbewahrte Läufe beim Öffnen meldet einen Fehler beim Laden der aufbewahrten Läufe
statusReason: Unable to find an element with the text: Nur der Owner darf die Auswertung sehen.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] ConditionalExpression
src/api/client.ts:69:27
     const problem = parseProblem(body)
     throw new ApiError(
       response.status,
-      problem.message ?? (body || response.statusText),
+      problem.message ?? (false),
       problem.fieldErrors,
     )
killedBy: apiFetch – ApiError aus RFC-9457 Problem Details nutzt bei Nicht-JSON-Body den Roh-Body als message (z. B. Security-401)
statusReason: expected 'false' to be 'Unauthorized-Seite' // Object.is equality
