[Killed] BooleanLiteral
src/lib/roles.ts:9:63
  */
 
 /** Wer Boards anlegen/löschen darf (BOARD_CREATE/BOARD_DELETE). */
-export const canManageBoards = (role: string, platformAdmin = false): boolean =>
+export const canManageBoards = (role: string, platformAdmin = true): boolean =>
   platformAdmin || role === 'OWNER' || role === 'ADMIN'
 
killedBy: ProjectBoardsPage RBAC blendet für VIEWER die Bearbeiten-Aktionen aus
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  aria-invalid="false"
  class="MuiInputBase-input MuiOutlinedInput-input MuiInputBase-inputSizeSmall css-1pzfmz2-MuiInputBase-input-MuiOutlinedInput-input"
  id=":r4:"
  type="text"
  value=""

[Timeout] ArrowFunction
src/lib/roles.ts:9:32
  */
 
 /** Wer Boards anlegen/löschen darf (BOARD_CREATE/BOARD_DELETE). */
-export const canManageBoards = (role: string, platformAdmin = false): boolean =>
-  platformAdmin || role === 'OWNER' || role === 'ADMIN'
+export const canManageBoards = () => undefined
 
 /** Wer das Projekt umbenennen/löschen darf (nur OWNER oder Plattform-Admin). */

[Killed] ConditionalExpression
src/lib/roles.ts:10:3
 
 /** Wer Boards anlegen/löschen darf (BOARD_CREATE/BOARD_DELETE). */
 export const canManageBoards = (role: string, platformAdmin = false): boolean =>
-  platformAdmin || role === 'OWNER' || role === 'ADMIN'
+  true
 
 /** Wer das Projekt umbenennen/löschen darf (nur OWNER oder Plattform-Admin). */
killedBy: ProjectBoardsPage RBAC blendet für VIEWER die Bearbeiten-Aktionen aus
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  aria-invalid="false"
  class="MuiInputBase-input MuiOutlinedInput-input MuiInputBase-inputSizeSmall css-1pzfmz2-MuiInputBase-input-MuiOutlinedInput-input"
  id=":r4:"
  type="text"
  value=""

[Killed] EqualityOperator
src/lib/roles.ts:10:20
 
 /** Wer Boards anlegen/löschen darf (BOARD_CREATE/BOARD_DELETE). */
 export const canManageBoards = (role: string, platformAdmin = false): boolean =>
-  platformAdmin || role === 'OWNER' || role === 'ADMIN'
+  platformAdmin || role !== 'OWNER' || role === 'ADMIN'
 
 /** Wer das Projekt umbenennen/löschen darf (nur OWNER oder Plattform-Admin). */
killedBy: ProjectBoardsPage RBAC zeigt Angemeldeten mit OWNER-Rolle den Board-Anlegen-Bereich
statusReason: Unable to find a label with the text of: /Neues Board/

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] ArrowFunction
src/lib/roles.ts:13:33
   platformAdmin || role === 'OWNER' || role === 'ADMIN'
 
 /** Wer das Projekt umbenennen/löschen darf (nur OWNER oder Plattform-Admin). */
-export const canManageProject = (role: string, platformAdmin = false): boolean =>
-  platformAdmin || role === 'OWNER'
+export const canManageProject = () => undefined
 
 /** Wer Mitglieder verwalten darf (MEMBER_INVITE/MEMBER_REMOVE). */
killedBy: BoardPage Berechtigungen aus Rolle und Plattform-Admin bietet OWNER das Verschieben auf ein anderes Board an (canTransfer)
statusReason: Unable to find an accessible element with the role "menuitem" and name "Auf anderes Board verschieben…"

Here are the accessible roles:

  presentation:

  Name "":
  <div

[Killed] BooleanLiteral
src/lib/roles.ts:13:64
   platformAdmin || role === 'OWNER' || role === 'ADMIN'
 
 /** Wer das Projekt umbenennen/löschen darf (nur OWNER oder Plattform-Admin). */
-export const canManageProject = (role: string, platformAdmin = false): boolean =>
+export const canManageProject = (role: string, platformAdmin = true): boolean =>
   platformAdmin || role === 'OWNER'
 
killedBy: roles richtet sich sonst nach der Projektrolle
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/lib/roles.ts:14:3
 
 /** Wer das Projekt umbenennen/löschen darf (nur OWNER oder Plattform-Admin). */
 export const canManageProject = (role: string, platformAdmin = false): boolean =>
-  platformAdmin || role === 'OWNER'
+  platformAdmin && role === 'OWNER'
 
 /** Wer Mitglieder verwalten darf (MEMBER_INVITE/MEMBER_REMOVE). */
killedBy: roles gibt einem Plattform-Admin Vollzugriff
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/roles.ts:14:3
 
 /** Wer das Projekt umbenennen/löschen darf (nur OWNER oder Plattform-Admin). */
 export const canManageProject = (role: string, platformAdmin = false): boolean =>
-  platformAdmin || role === 'OWNER'
+  false
 
 /** Wer Mitglieder verwalten darf (MEMBER_INVITE/MEMBER_REMOVE). */
killedBy: AppShell Nachtlauf-Eintrag zeigt „Nachtlauf" auf einer Board-Route, wenn man Owner des Projekts ist
statusReason: Unable to find an element with the text: Nachtlauf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <div

[Killed] BooleanLiteral
src/lib/roles.ts:17:64
   platformAdmin || role === 'OWNER'
 
 /** Wer Mitglieder verwalten darf (MEMBER_INVITE/MEMBER_REMOVE). */
-export const canManageMembers = (role: string, platformAdmin = false): boolean =>
+export const canManageMembers = (role: string, platformAdmin = true): boolean =>
   platformAdmin || role === 'OWNER' || role === 'ADMIN'
 
killedBy: ProjectMembersPage fällt auf VIEWER zurück, wenn das Projekt nicht in der projectsApi-Liste steht
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  aria-invalid="false"
  class="MuiInputBase-input MuiOutlinedInput-input MuiInputBase-inputSizeSmall css-1pzfmz2-MuiInputBase-input-MuiOutlinedInput-input"
  id=":rj:"
  type="email"
  value=""

[Timeout] ArrowFunction
src/lib/roles.ts:17:33
   platformAdmin || role === 'OWNER'
 
 /** Wer Mitglieder verwalten darf (MEMBER_INVITE/MEMBER_REMOVE). */
-export const canManageMembers = (role: string, platformAdmin = false): boolean =>
-  platformAdmin || role === 'OWNER' || role === 'ADMIN'
+export const canManageMembers = () => undefined
 
 /** Wer Karten anlegen/verschieben darf (CARD_*). */

[Killed] LogicalOperator
src/lib/roles.ts:18:3
 
 /** Wer Mitglieder verwalten darf (MEMBER_INVITE/MEMBER_REMOVE). */
 export const canManageMembers = (role: string, platformAdmin = false): boolean =>
-  platformAdmin || role === 'OWNER' || role === 'ADMIN'
+  (platformAdmin || role === 'OWNER') && role === 'ADMIN'
 
 /** Wer Karten anlegen/verschieben darf (CARD_*). */
killedBy: ProjectMembersPage lädt Rolle und Projektname über projectsApi, wenn kein loadRole übergeben ist
statusReason: Unable to find a label with the text of: /E-Mail einladen/

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] LogicalOperator
src/lib/roles.ts:18:3
 
 /** Wer Mitglieder verwalten darf (MEMBER_INVITE/MEMBER_REMOVE). */
 export const canManageMembers = (role: string, platformAdmin = false): boolean =>
-  platformAdmin || role === 'OWNER' || role === 'ADMIN'
+  platformAdmin && role === 'OWNER' || role === 'ADMIN'
 
 /** Wer Karten anlegen/verschieben darf (CARD_*). */
killedBy: ProjectMembersPage lädt Rolle und Projektname über projectsApi, wenn kein loadRole übergeben ist
statusReason: Unable to find a label with the text of: /E-Mail einladen/

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] ArrowFunction
src/lib/roles.ts:21:29
   platformAdmin || role === 'OWNER' || role === 'ADMIN'
 
 /** Wer Karten anlegen/verschieben darf (CARD_*). */
-export const canEditCards = (role: string, platformAdmin = false): boolean =>
-  platformAdmin || role !== 'VIEWER'
+export const canEditCards = () => undefined
 
 /** Wer Kommentare moderieren (löschen) darf (COMMENT_DELETE) — ADMIN/OWNER oder Plattform-Admin. */
killedBy: BoardListPage stellt eine archivierte Karte über die Zeilen-Aktion wieder her
statusReason: Unable to find a label with the text of: Karte AlteKarte wiederherstellen

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] BooleanLiteral
src/lib/roles.ts:21:60
   platformAdmin || role === 'OWNER' || role === 'ADMIN'
 
 /** Wer Karten anlegen/verschieben darf (CARD_*). */
-export const canEditCards = (role: string, platformAdmin = false): boolean =>
+export const canEditCards = (role: string, platformAdmin = true): boolean =>
   platformAdmin || role !== 'VIEWER'
 
killedBy: IdeasPage blendet für Betrachter (VIEWER) „Idee anlegen" aus, reicht aber canEdit=false durch
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  tabindex="0"
  type="button"
>
  Idee anlegen

[Killed] ConditionalExpression
src/lib/roles.ts:22:3
 
 /** Wer Karten anlegen/verschieben darf (CARD_*). */
 export const canEditCards = (role: string, platformAdmin = false): boolean =>
-  platformAdmin || role !== 'VIEWER'
+  false
 
 /** Wer Kommentare moderieren (löschen) darf (COMMENT_DELETE) — ADMIN/OWNER oder Plattform-Admin. */
killedBy: CardNumberSearch öffnet einen Treffer im eigenen Projekt bearbeitbar
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:
  false

[Killed] ConditionalExpression
src/lib/roles.ts:22:3
 
 /** Wer Karten anlegen/verschieben darf (CARD_*). */
 export const canEditCards = (role: string, platformAdmin = false): boolean =>
-  platformAdmin || role !== 'VIEWER'
+  true
 
 /** Wer Kommentare moderieren (löschen) darf (COMMENT_DELETE) — ADMIN/OWNER oder Plattform-Admin. */
killedBy: roles richtet sich sonst nach der Projektrolle
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/lib/roles.ts:25:36
   platformAdmin || role !== 'VIEWER'
 
 /** Wer Kommentare moderieren (löschen) darf (COMMENT_DELETE) — ADMIN/OWNER oder Plattform-Admin. */
-export const canModerateComments = (role: string, platformAdmin = false): boolean =>
-  platformAdmin || role === 'OWNER' || role === 'ADMIN'
+export const canModerateComments = () => undefined
 
 /** Ob der eingeloggte Nutzer plattformweit Admin ist. */
killedBy: CardNumberSearch öffnet einen Treffer als VIEWER nur lesend
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
  undefined

[NoCoverage] BooleanLiteral
src/lib/roles.ts:25:67
   platformAdmin || role !== 'VIEWER'
 
 /** Wer Kommentare moderieren (löschen) darf (COMMENT_DELETE) — ADMIN/OWNER oder Plattform-Admin. */
-export const canModerateComments = (role: string, platformAdmin = false): boolean =>
+export const canModerateComments = (role: string, platformAdmin = true): boolean =>
   platformAdmin || role === 'OWNER' || role === 'ADMIN'
 

[Killed] LogicalOperator
src/lib/roles.ts:26:3
 
 /** Wer Kommentare moderieren (löschen) darf (COMMENT_DELETE) — ADMIN/OWNER oder Plattform-Admin. */
 export const canModerateComments = (role: string, platformAdmin = false): boolean =>
-  platformAdmin || role === 'OWNER' || role === 'ADMIN'
+  (platformAdmin || role === 'OWNER') && role === 'ADMIN'
 
 /** Ob der eingeloggte Nutzer plattformweit Admin ist. */
killedBy: CardNumberSearch gibt als ADMIN Bearbeitung frei, Moderation aber nur ab ADMIN
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:
  false

[Killed] ConditionalExpression
src/lib/roles.ts:26:3
 
 /** Wer Kommentare moderieren (löschen) darf (COMMENT_DELETE) — ADMIN/OWNER oder Plattform-Admin. */
 export const canModerateComments = (role: string, platformAdmin = false): boolean =>
-  platformAdmin || role === 'OWNER' || role === 'ADMIN'
+  false
 
 /** Ob der eingeloggte Nutzer plattformweit Admin ist. */
killedBy: CardNumberSearch gibt als ADMIN Bearbeitung frei, Moderation aber nur ab ADMIN
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:
  false

[Killed] ArrowFunction
src/lib/roles.ts:29:32
   platformAdmin || role === 'OWNER' || role === 'ADMIN'
 
 /** Ob der eingeloggte Nutzer plattformweit Admin ist. */
-export const isPlatformAdmin = (user: { platformRole?: string } | null | undefined): boolean =>
-  user?.platformRole === 'ADMIN'
+export const isPlatformAdmin = () => undefined
 
killedBy: BoardPage Berechtigungen aus Rolle und Plattform-Admin reicht den Plattform-Admin an BoardView weiter: alle Projekte als Verschiebeziel (platformAdmin)
statusReason: Unable to find a label with the text of: Menü Aufgabe

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <div

[Killed] OptionalChaining
src/lib/roles.ts:30:3
 
 /** Ob der eingeloggte Nutzer plattformweit Admin ist. */
 export const isPlatformAdmin = (user: { platformRole?: string } | null | undefined): boolean =>
-  user?.platformRole === 'ADMIN'
+  user.platformRole === 'ADMIN'
 
killedBy: roles isPlatformAdmin liest platformRole
statusReason: Cannot read properties of null (reading 'platformRole')

[Killed] ConditionalExpression
src/lib/roles.ts:30:3
 
 /** Ob der eingeloggte Nutzer plattformweit Admin ist. */
 export const isPlatformAdmin = (user: { platformRole?: string } | null | undefined): boolean =>
-  user?.platformRole === 'ADMIN'
+  true
 
killedBy: CardNumberSearch öffnet einen Treffer als VIEWER nur lesend
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
  true
