[Killed] ArrowFunction
src/api/accessTokens.ts:22:9
 }
 
 export const accessTokensApi = {
-  list: () => apiFetch<AccessToken[]>('/api/access-tokens'),
+  list: () => undefined,
   create: (name: string, projectId?: number | null, boardId?: number | null) =>
     apiFetch<CreatedAccessToken>('/api/access-tokens', {
killedBy: accessTokensApi list ruft GET /api/access-tokens und liefert die geparste Antwort
statusReason: expected undefined to deeply equal [ { id: 1, name: 'board-cli', …(5) } ]

[Killed] ArrowFunction
src/api/accessTokens.ts:23:11
 
 export const accessTokensApi = {
   list: () => apiFetch<AccessToken[]>('/api/access-tokens'),
-  create: (name: string, projectId?: number | null, boardId?: number | null) =>
-    apiFetch<CreatedAccessToken>('/api/access-tokens', {
-      method: 'POST',
-      body: JSON.stringify({ name, projectId, boardId }),
-    }),
+  create: () => undefined,
   revoke: (id: number) => apiFetch<void>(`/api/access-tokens/${id}`, { method: 'DELETE' }),
 }
killedBy: accessTokensApi create ruft POST /api/access-tokens mit Name und Board-Bindung
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ObjectLiteral
src/api/accessTokens.ts:24:56
 export const accessTokensApi = {
   list: () => apiFetch<AccessToken[]>('/api/access-tokens'),
   create: (name: string, projectId?: number | null, boardId?: number | null) =>
-    apiFetch<CreatedAccessToken>('/api/access-tokens', {
-      method: 'POST',
-      body: JSON.stringify({ name, projectId, boardId }),
-    }),
+    apiFetch<CreatedAccessToken>('/api/access-tokens', {}),
   revoke: (id: number) => apiFetch<void>(`/api/access-tokens/${id}`, { method: 'DELETE' }),
 }
killedBy: accessTokensApi create ruft POST /api/access-tokens mit Name und Board-Bindung
statusReason: expected undefined to be 'POST' // Object.is equality

[Killed] ArrowFunction
src/api/accessTokens.ts:28:11
       method: 'POST',
       body: JSON.stringify({ name, projectId, boardId }),
     }),
-  revoke: (id: number) => apiFetch<void>(`/api/access-tokens/${id}`, { method: 'DELETE' }),
+  revoke: () => undefined,
 }
 
killedBy: accessTokensApi revoke ruft DELETE /api/access-tokens/{id}
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] StringLiteral
src/api/accessTokens.ts:28:42
       method: 'POST',
       body: JSON.stringify({ name, projectId, boardId }),
     }),
-  revoke: (id: number) => apiFetch<void>(`/api/access-tokens/${id}`, { method: 'DELETE' }),
+  revoke: (id: number) => apiFetch<void>(``, { method: 'DELETE' }),
 }
 
killedBy: accessTokensApi revoke ruft DELETE /api/access-tokens/{id}
statusReason: expected '' to be '/api/access-tokens/5' // Object.is equality
