[Killed] BlockStatement
src/api/attachments.ts:12:71
   createdAt: string
 }
 
-async function listAttachments(cardId: number): Promise<Attachment[]> {
-  const res = await fetch(`/api/cards/${cardId}/attachments`, { credentials: 'include' })
-  if (!res.ok) throw new ApiError(res.status, res.statusText)
-  return res.json()
-}
+async function listAttachments(cardId: number): Promise<Attachment[]> {}
 
 async function upload(cardId: number, file: File): Promise<Attachment> {
killedBy: attachmentsApi list ruft GET /api/cards/{id}/attachments mit Cookies und liefert die geparste Antwort
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] StringLiteral
src/api/attachments.ts:13:27
 }
 
 async function listAttachments(cardId: number): Promise<Attachment[]> {
-  const res = await fetch(`/api/cards/${cardId}/attachments`, { credentials: 'include' })
+  const res = await fetch(``, { credentials: 'include' })
   if (!res.ok) throw new ApiError(res.status, res.statusText)
   return res.json()
killedBy: attachmentsApi list ruft GET /api/cards/{id}/attachments mit Cookies und liefert die geparste Antwort
statusReason: expected '' to be '/api/cards/7/attachments' // Object.is equality

[Killed] ConditionalExpression
src/api/attachments.ts:14:7
 
 async function listAttachments(cardId: number): Promise<Attachment[]> {
   const res = await fetch(`/api/cards/${cardId}/attachments`, { credentials: 'include' })
-  if (!res.ok) throw new ApiError(res.status, res.statusText)
+  if (true) throw new ApiError(res.status, res.statusText)
   return res.json()
 }
killedBy: attachmentsApi list ruft GET /api/cards/{id}/attachments mit Cookies und liefert die geparste Antwort
statusReason: OK

[Killed] ConditionalExpression
src/api/attachments.ts:14:7
 
 async function listAttachments(cardId: number): Promise<Attachment[]> {
   const res = await fetch(`/api/cards/${cardId}/attachments`, { credentials: 'include' })
-  if (!res.ok) throw new ApiError(res.status, res.statusText)
+  if (false) throw new ApiError(res.status, res.statusText)
   return res.json()
 }
killedBy: attachmentsApi list wirft ApiError bei Fehlerantwort
statusReason: promise resolved "{}" instead of rejecting

[Killed] BlockStatement
src/api/attachments.ts:18:72
   return res.json()
 }
 
-async function upload(cardId: number, file: File): Promise<Attachment> {
-  const form = new FormData()
-  form.append('file', file)
-  const res = await fetch(`/api/cards/${cardId}/attachments`, {
-    method: 'POST',
-    credentials: 'include',
-    body: form, // KEIN Content-Type setzen -> Browser setzt multipart-Boundary
-  })
-  if (!res.ok) throw new ApiError(res.status, res.statusText)
-  return res.json()
-}
+async function upload(cardId: number, file: File): Promise<Attachment> {}
 
 async function remove(id: number): Promise<void> {
killedBy: attachmentsApi upload ruft POST mit FormData-Body ohne explizites Content-Type
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] StringLiteral
src/api/attachments.ts:22:13
   const form = new FormData()
   form.append('file', file)
   const res = await fetch(`/api/cards/${cardId}/attachments`, {
-    method: 'POST',
+    method: "",
     credentials: 'include',
     body: form, // KEIN Content-Type setzen -> Browser setzt multipart-Boundary
killedBy: attachmentsApi upload ruft POST mit FormData-Body ohne explizites Content-Type
statusReason: expected '' to be 'POST' // Object.is equality

[Killed] StringLiteral
src/api/attachments.ts:23:18
   form.append('file', file)
   const res = await fetch(`/api/cards/${cardId}/attachments`, {
     method: 'POST',
-    credentials: 'include',
+    credentials: "",
     body: form, // KEIN Content-Type setzen -> Browser setzt multipart-Boundary
   })
killedBy: attachmentsApi upload ruft POST mit FormData-Body ohne explizites Content-Type
statusReason: expected '' to be 'include' // Object.is equality

[Killed] ConditionalExpression
src/api/attachments.ts:26:7
     credentials: 'include',
     body: form, // KEIN Content-Type setzen -> Browser setzt multipart-Boundary
   })
-  if (!res.ok) throw new ApiError(res.status, res.statusText)
+  if (false) throw new ApiError(res.status, res.statusText)
   return res.json()
 }
killedBy: attachmentsApi upload wirft ApiError bei Fehlerantwort (z. B. Anhangslimit)
statusReason: promise resolved "{}" instead of rejecting

[Killed] ConditionalExpression
src/api/attachments.ts:26:7
     credentials: 'include',
     body: form, // KEIN Content-Type setzen -> Browser setzt multipart-Boundary
   })
-  if (!res.ok) throw new ApiError(res.status, res.statusText)
+  if (true) throw new ApiError(res.status, res.statusText)
   return res.json()
 }
killedBy: attachmentsApi upload ruft POST mit FormData-Body ohne explizites Content-Type
statusReason: OK

[Killed] BlockStatement
src/api/attachments.ts:30:50
   return res.json()
 }
 
-async function remove(id: number): Promise<void> {
-  const res = await fetch(`/api/attachments/${id}`, { method: 'DELETE', credentials: 'include' })
-  if (!res.ok) throw new ApiError(res.status, res.statusText)
-}
+async function remove(id: number): Promise<void> {}
 
 /** Lädt den Blob (für die Inline-Vorschau; der Download-Endpunkt liefert Content-Disposition: attachment). */
killedBy: attachmentsApi remove ruft DELETE /api/attachments/{id}
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] StringLiteral
src/api/attachments.ts:31:27
 }
 
 async function remove(id: number): Promise<void> {
-  const res = await fetch(`/api/attachments/${id}`, { method: 'DELETE', credentials: 'include' })
+  const res = await fetch(``, { method: 'DELETE', credentials: 'include' })
   if (!res.ok) throw new ApiError(res.status, res.statusText)
 }
killedBy: attachmentsApi remove ruft DELETE /api/attachments/{id}
statusReason: expected '' to be '/api/attachments/1' // Object.is equality

[Killed] StringLiteral
src/api/attachments.ts:31:86
 }
 
 async function remove(id: number): Promise<void> {
-  const res = await fetch(`/api/attachments/${id}`, { method: 'DELETE', credentials: 'include' })
+  const res = await fetch(`/api/attachments/${id}`, { method: 'DELETE', credentials: "" })
   if (!res.ok) throw new ApiError(res.status, res.statusText)
 }
killedBy: attachmentsApi remove ruft DELETE /api/attachments/{id}
statusReason: expected '' to be 'include' // Object.is equality

[Killed] BooleanLiteral
src/api/attachments.ts:32:7
 
 async function remove(id: number): Promise<void> {
   const res = await fetch(`/api/attachments/${id}`, { method: 'DELETE', credentials: 'include' })
-  if (!res.ok) throw new ApiError(res.status, res.statusText)
+  if (res.ok) throw new ApiError(res.status, res.statusText)
 }
 
killedBy: attachmentsApi remove ruft DELETE /api/attachments/{id}
statusReason: OK

[Killed] ConditionalExpression
src/api/attachments.ts:32:7
 
 async function remove(id: number): Promise<void> {
   const res = await fetch(`/api/attachments/${id}`, { method: 'DELETE', credentials: 'include' })
-  if (!res.ok) throw new ApiError(res.status, res.statusText)
+  if (false) throw new ApiError(res.status, res.statusText)
 }
 
killedBy: attachmentsApi remove wirft ApiError bei Fehlerantwort
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/api/attachments.ts:36:53
 }
 
 /** Lädt den Blob (für die Inline-Vorschau; der Download-Endpunkt liefert Content-Disposition: attachment). */
-async function fetchBlob(id: number): Promise<Blob> {
-  const res = await fetch(`/api/attachments/${id}`, { credentials: 'include' })
-  if (!res.ok) throw new ApiError(res.status, res.statusText)
-  return res.blob()
-}
+async function fetchBlob(id: number): Promise<Blob> {}
 
 export const attachmentsApi = { list: listAttachments, upload, remove, fetchBlob }
killedBy: attachmentsApi fetchBlob ruft GET /api/attachments/{id} und liefert einen Blob
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ObjectLiteral
src/api/attachments.ts:37:53
 
 /** Lädt den Blob (für die Inline-Vorschau; der Download-Endpunkt liefert Content-Disposition: attachment). */
 async function fetchBlob(id: number): Promise<Blob> {
-  const res = await fetch(`/api/attachments/${id}`, { credentials: 'include' })
+  const res = await fetch(`/api/attachments/${id}`, {})
   if (!res.ok) throw new ApiError(res.status, res.statusText)
   return res.blob()
killedBy: attachmentsApi fetchBlob ruft GET /api/attachments/{id} und liefert einen Blob
statusReason: expected undefined to be 'include' // Object.is equality

[Killed] BooleanLiteral
src/api/attachments.ts:38:7
 /** Lädt den Blob (für die Inline-Vorschau; der Download-Endpunkt liefert Content-Disposition: attachment). */
 async function fetchBlob(id: number): Promise<Blob> {
   const res = await fetch(`/api/attachments/${id}`, { credentials: 'include' })
-  if (!res.ok) throw new ApiError(res.status, res.statusText)
+  if (res.ok) throw new ApiError(res.status, res.statusText)
   return res.blob()
 }
killedBy: attachmentsApi fetchBlob ruft GET /api/attachments/{id} und liefert einen Blob
statusReason: OK

[Killed] ConditionalExpression
src/api/attachments.ts:38:7
 /** Lädt den Blob (für die Inline-Vorschau; der Download-Endpunkt liefert Content-Disposition: attachment). */
 async function fetchBlob(id: number): Promise<Blob> {
   const res = await fetch(`/api/attachments/${id}`, { credentials: 'include' })
-  if (!res.ok) throw new ApiError(res.status, res.statusText)
+  if (false) throw new ApiError(res.status, res.statusText)
   return res.blob()
 }
killedBy: attachmentsApi fetchBlob wirft ApiError bei Fehlerantwort
statusReason: promise resolved "Blob{ …(1) }" instead of rejecting

[Killed] ObjectLiteral
src/api/attachments.ts:42:31
   return res.blob()
 }
 
-export const attachmentsApi = { list: listAttachments, upload, remove, fetchBlob }
+export const attachmentsApi = {}
 export type AttachmentsApi = typeof attachmentsApi
 
killedBy: attachmentsApi list ruft GET /api/cards/{id}/attachments mit Cookies und liefert die geparste Antwort
statusReason: attachmentsApi.list is not a function
