[Killed] ArrowFunction
src/api/comments.ts:14:9
 }
 
 export const commentsApi = {
-  list: (cardId: number) => apiFetch<Comment[]>(`/api/cards/${cardId}/comments`),
+  list: () => undefined,
   create: (cardId: number, body: string) =>
     apiFetch<Comment>(`/api/cards/${cardId}/comments`, { method: 'POST', body: JSON.stringify({ body }) }),
killedBy: commentsApi list ruft GET /api/cards/{id}/comments und liefert die geparste Antwort
statusReason: Target cannot be null or undefined.

[Killed] ArrowFunction
src/api/comments.ts:15:11
 
 export const commentsApi = {
   list: (cardId: number) => apiFetch<Comment[]>(`/api/cards/${cardId}/comments`),
-  create: (cardId: number, body: string) =>
-    apiFetch<Comment>(`/api/cards/${cardId}/comments`, { method: 'POST', body: JSON.stringify({ body }) }),
+  create: () => undefined,
   update: (id: number, body: string) =>
     apiFetch<Comment>(`/api/comments/${id}`, { method: 'PATCH', body: JSON.stringify({ body }) }),
killedBy: commentsApi create ruft POST /api/cards/{id}/comments mit dem Text
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] StringLiteral
src/api/comments.ts:16:66
 export const commentsApi = {
   list: (cardId: number) => apiFetch<Comment[]>(`/api/cards/${cardId}/comments`),
   create: (cardId: number, body: string) =>
-    apiFetch<Comment>(`/api/cards/${cardId}/comments`, { method: 'POST', body: JSON.stringify({ body }) }),
+    apiFetch<Comment>(`/api/cards/${cardId}/comments`, { method: "", body: JSON.stringify({ body }) }),
   update: (id: number, body: string) =>
     apiFetch<Comment>(`/api/comments/${id}`, { method: 'PATCH', body: JSON.stringify({ body }) }),
killedBy: commentsApi create ruft POST /api/cards/{id}/comments mit dem Text
statusReason: expected '' to be 'POST' // Object.is equality

[Killed] ObjectLiteral
src/api/comments.ts:16:56
 export const commentsApi = {
   list: (cardId: number) => apiFetch<Comment[]>(`/api/cards/${cardId}/comments`),
   create: (cardId: number, body: string) =>
-    apiFetch<Comment>(`/api/cards/${cardId}/comments`, { method: 'POST', body: JSON.stringify({ body }) }),
+    apiFetch<Comment>(`/api/cards/${cardId}/comments`, {}),
   update: (id: number, body: string) =>
     apiFetch<Comment>(`/api/comments/${id}`, { method: 'PATCH', body: JSON.stringify({ body }) }),
killedBy: commentsApi create ruft POST /api/cards/{id}/comments mit dem Text
statusReason: expected undefined to be 'POST' // Object.is equality

[Killed] ArrowFunction
src/api/comments.ts:17:11
   list: (cardId: number) => apiFetch<Comment[]>(`/api/cards/${cardId}/comments`),
   create: (cardId: number, body: string) =>
     apiFetch<Comment>(`/api/cards/${cardId}/comments`, { method: 'POST', body: JSON.stringify({ body }) }),
-  update: (id: number, body: string) =>
-    apiFetch<Comment>(`/api/comments/${id}`, { method: 'PATCH', body: JSON.stringify({ body }) }),
+  update: () => undefined,
   remove: (id: number) => apiFetch<void>(`/api/comments/${id}`, { method: 'DELETE' }),
 }
killedBy: commentsApi update ruft PATCH /api/comments/{id} mit dem Text
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ArrowFunction
src/api/comments.ts:19:11
     apiFetch<Comment>(`/api/cards/${cardId}/comments`, { method: 'POST', body: JSON.stringify({ body }) }),
   update: (id: number, body: string) =>
     apiFetch<Comment>(`/api/comments/${id}`, { method: 'PATCH', body: JSON.stringify({ body }) }),
-  remove: (id: number) => apiFetch<void>(`/api/comments/${id}`, { method: 'DELETE' }),
+  remove: () => undefined,
 }
 
killedBy: commentsApi remove ruft DELETE /api/comments/{id}
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))
