[Killed] ArrowFunction
src/api/dashboard.ts:47:8
 }
 
 export const dashboardApi = {
-  get: (boardId: number) => apiFetch<BoardDashboardKpis>(`/api/boards/${boardId}/dashboard`),
+  get: () => undefined,
 }
 
killedBy: dashboardApi get ruft GET /api/boards/{id}/dashboard und liefert die KPIs
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] StringLiteral
src/api/dashboard.ts:47:58
 }
 
 export const dashboardApi = {
-  get: (boardId: number) => apiFetch<BoardDashboardKpis>(`/api/boards/${boardId}/dashboard`),
+  get: (boardId: number) => apiFetch<BoardDashboardKpis>(``),
 }
 
killedBy: dashboardApi get ruft GET /api/boards/{id}/dashboard und liefert die KPIs
statusReason: expected '' to be '/api/boards/7/dashboard' // Object.is equality
