[Killed] ArrowFunction
src/api/epics.ts:30:9
 }
 
 export const epicsApi = {
-  list: (boardId: number) => apiFetch<Epic[]>(`/api/boards/${boardId}/epics`),
+  list: () => undefined,
   create: (boardId: number, title: string, description: string, shortcode: string | null) =>
     apiFetch<Card>(`/api/boards/${boardId}/cards`, {
killedBy: epicsApi list ruft GET /api/boards/{id}/epics und liefert die geparste Antwort
statusReason: expected undefined to deeply equal [ { id: 1, number: 5, …(8) } ]

[Killed] ArrowFunction
src/api/epics.ts:31:11
 
 export const epicsApi = {
   list: (boardId: number) => apiFetch<Epic[]>(`/api/boards/${boardId}/epics`),
-  create: (boardId: number, title: string, description: string, shortcode: string | null) =>
-    apiFetch<Card>(`/api/boards/${boardId}/cards`, {
-      method: 'POST',
-      body: JSON.stringify({ type: 'EPIC', title, description, shortcode }),
-    }),
+  create: () => undefined,
   /** Ordnet eine Karte einem Epic zu (parentId) oder löst die Zuordnung (null). */
   assign: (cardId: number, parentId: number | null) =>
killedBy: epicsApi create ruft POST /api/boards/{id}/cards mit type EPIC
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ArrowFunction
src/api/epics.ts:37:11
       body: JSON.stringify({ type: 'EPIC', title, description, shortcode }),
     }),
   /** Ordnet eine Karte einem Epic zu (parentId) oder löst die Zuordnung (null). */
-  assign: (cardId: number, parentId: number | null) =>
-    apiFetch<Card>(`/api/cards/${cardId}/parent`, { method: 'PATCH', body: JSON.stringify({ parentId }) }),
+  assign: () => undefined,
   remove: (id: number) => apiFetch<void>(`/api/cards/${id}`, { method: 'DELETE' }),
 }
killedBy: epicsApi assign ruft PATCH /api/cards/{id}/parent mit parentId
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] StringLiteral
src/api/epics.ts:38:20
     }),
   /** Ordnet eine Karte einem Epic zu (parentId) oder löst die Zuordnung (null). */
   assign: (cardId: number, parentId: number | null) =>
-    apiFetch<Card>(`/api/cards/${cardId}/parent`, { method: 'PATCH', body: JSON.stringify({ parentId }) }),
+    apiFetch<Card>(``, { method: 'PATCH', body: JSON.stringify({ parentId }) }),
   remove: (id: number) => apiFetch<void>(`/api/cards/${id}`, { method: 'DELETE' }),
 }
killedBy: epicsApi assign ruft PATCH /api/cards/{id}/parent mit parentId
statusReason: expected '' to be '/api/cards/7/parent' // Object.is equality

[Killed] StringLiteral
src/api/epics.ts:38:61
     }),
   /** Ordnet eine Karte einem Epic zu (parentId) oder löst die Zuordnung (null). */
   assign: (cardId: number, parentId: number | null) =>
-    apiFetch<Card>(`/api/cards/${cardId}/parent`, { method: 'PATCH', body: JSON.stringify({ parentId }) }),
+    apiFetch<Card>(`/api/cards/${cardId}/parent`, { method: "", body: JSON.stringify({ parentId }) }),
   remove: (id: number) => apiFetch<void>(`/api/cards/${id}`, { method: 'DELETE' }),
 }
killedBy: epicsApi assign ruft PATCH /api/cards/{id}/parent mit parentId
statusReason: expected '' to be 'PATCH' // Object.is equality

[Killed] ArrowFunction
src/api/epics.ts:39:11
   /** Ordnet eine Karte einem Epic zu (parentId) oder löst die Zuordnung (null). */
   assign: (cardId: number, parentId: number | null) =>
     apiFetch<Card>(`/api/cards/${cardId}/parent`, { method: 'PATCH', body: JSON.stringify({ parentId }) }),
-  remove: (id: number) => apiFetch<void>(`/api/cards/${id}`, { method: 'DELETE' }),
+  remove: () => undefined,
 }
 
killedBy: epicsApi remove ruft DELETE /api/cards/{id}
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))
