[Killed] ArrowFunction
src/api/ideas.ts:40:9
 }
 
 export const ideasApi = {
-  list: (projectId: number) => apiFetch<Idea[]>(`/api/projects/${projectId}/ideas`),
+  list: () => undefined,
   create: (
     projectId: number,
killedBy: ideasApi list ruft GET /api/projects/{id}/ideas und liefert die geparste Antwort
statusReason: expected undefined to deeply equal [ { id: 1, boardId: null, …(1) } ]

[Killed] ArrowFunction
src/api/ideas.ts:41:11
 
 export const ideasApi = {
   list: (projectId: number) => apiFetch<Idea[]>(`/api/projects/${projectId}/ideas`),
-  create: (
-    projectId: number,
-    input: { title: string; description?: string | null; targetBoardId?: number | null },
-  ) =>
-    apiFetch<Idea>(`/api/projects/${projectId}/ideas`, {
-      method: 'POST',
-      body: JSON.stringify(input),
-    }),
+  create: () => undefined,
   /**
    * Legt mehrere Pool-Ideen in einem Zug an (Batch-Endpoint aus #492) — Ziel des
killedBy: ideasApi create ruft POST /api/projects/{id}/ideas mit Titel/Beschreibung/Zielboard
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] StringLiteral
src/api/ideas.ts:45:20
     projectId: number,
     input: { title: string; description?: string | null; targetBoardId?: number | null },
   ) =>
-    apiFetch<Idea>(`/api/projects/${projectId}/ideas`, {
+    apiFetch<Idea>(``, {
       method: 'POST',
       body: JSON.stringify(input),
killedBy: ideasApi create ruft POST /api/projects/{id}/ideas mit Titel/Beschreibung/Zielboard
statusReason: expected '' to be '/api/projects/5/ideas' // Object.is equality

[Killed] ArrowFunction
src/api/ideas.ts:55:16
    * Servers (Titel > 300, Beschreibung > `MAX_TEXT_LENGTH`, mehr als 200 Elemente), entsteht keine einzige
    * Idee. Antwort: die angelegten Ideen in Eingabereihenfolge, jeweils mit `id` und `number`.
    */
-  createBatch: (
-    projectId: number,
-    input: {
-      ideas: Array<{ title: string; description?: string | null }>
-      targetBoardId?: number | null
-    },
-  ) =>
-    apiFetch<Idea[]>(`/api/projects/${projectId}/ideas/batch`, {
-      method: 'POST',
-      body: JSON.stringify(input),
-    }),
+  createBatch: () => undefined,
   // Plant eine Pool-Idee auf ein Board ein (board-gebunden, nicht mehr Idee).
   planOntoBoard: (cardId: number, targetBoardId: number) =>
killedBy: ideasApi createBatch ruft POST /api/projects/{id}/ideas/batch mit der ganzen Liste
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ArrowFunction
src/api/ideas.ts:67:18
       body: JSON.stringify(input),
     }),
   // Plant eine Pool-Idee auf ein Board ein (board-gebunden, nicht mehr Idee).
-  planOntoBoard: (cardId: number, targetBoardId: number) =>
-    apiFetch<Idea>(`/api/cards/${cardId}/plan`, {
-      method: 'PUT',
-      body: JSON.stringify({ targetBoardId }),
-    }),
+  planOntoBoard: () => undefined,
   // Holt eine eingeplante/Legacy-Karte zurück in den board-losen Ideen-Pool.
   moveBackToPool: (cardId: number) =>
killedBy: ideasApi planOntoBoard ruft PUT /api/cards/{id}/plan mit dem Zielboard
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] StringLiteral
src/api/ideas.ts:68:20
     }),
   // Plant eine Pool-Idee auf ein Board ein (board-gebunden, nicht mehr Idee).
   planOntoBoard: (cardId: number, targetBoardId: number) =>
-    apiFetch<Idea>(`/api/cards/${cardId}/plan`, {
+    apiFetch<Idea>(``, {
       method: 'PUT',
       body: JSON.stringify({ targetBoardId }),
killedBy: ideasApi planOntoBoard ruft PUT /api/cards/{id}/plan mit dem Zielboard
statusReason: expected '' to be '/api/cards/3/plan' // Object.is equality

[Killed] ArrowFunction
src/api/ideas.ts:73:19
       body: JSON.stringify({ targetBoardId }),
     }),
   // Holt eine eingeplante/Legacy-Karte zurück in den board-losen Ideen-Pool.
-  moveBackToPool: (cardId: number) =>
-    apiFetch<Idea>(`/api/cards/${cardId}/to-pool`, { method: 'PUT' }),
+  moveBackToPool: () => undefined,
 }
 
killedBy: ideasApi moveBackToPool ruft PUT /api/cards/{id}/to-pool
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] StringLiteral
src/api/ideas.ts:74:62
     }),
   // Holt eine eingeplante/Legacy-Karte zurück in den board-losen Ideen-Pool.
   moveBackToPool: (cardId: number) =>
-    apiFetch<Idea>(`/api/cards/${cardId}/to-pool`, { method: 'PUT' }),
+    apiFetch<Idea>(`/api/cards/${cardId}/to-pool`, { method: "" }),
 }
 
killedBy: ideasApi moveBackToPool ruft PUT /api/cards/{id}/to-pool
statusReason: expected '' to be 'PUT' // Object.is equality

[Killed] ObjectLiteral
src/api/ideas.ts:74:52
     }),
   // Holt eine eingeplante/Legacy-Karte zurück in den board-losen Ideen-Pool.
   moveBackToPool: (cardId: number) =>
-    apiFetch<Idea>(`/api/cards/${cardId}/to-pool`, { method: 'PUT' }),
+    apiFetch<Idea>(`/api/cards/${cardId}/to-pool`, {}),
 }
 
killedBy: ideasApi moveBackToPool ruft PUT /api/cards/{id}/to-pool
statusReason: expected undefined to be 'PUT' // Object.is equality
