[Killed] ObjectLiteral
src/api/nightRuns.ts:79:29
 /** Je Fehlerklasse die Zahl der aufbewahrten Laeufe, in denen sie vorkam; fehlende Klassen kamen nie vor. */
 export type NightRunErrorClassCounts = Partial<Record<NightRunErrorClass, number>>
 
-export const nightRunsApi = {
-  submit: (projectId: number, runs: NightRunSubmission[]) =>
-    apiFetch<NightRunResult[]>(`/api/projects/${projectId}/night-runs`, {
-      method: 'POST',
-      body: JSON.stringify({ runs }),
-    }),
-  list: (projectId: number) => apiFetch<NightRunView[]>(`/api/projects/${projectId}/night-runs`),
-  errorClassCounts: (projectId: number) =>
-    apiFetch<NightRunErrorClassCounts>(`/api/projects/${projectId}/night-runs/error-class-counts`),
-}
+export const nightRunsApi = {}
 
 export type NightRunsApi = typeof nightRunsApi
killedBy: NightRunPage — aufbewahrte Läufe beim Öffnen zeigt die aufbewahrten Läufe, neueste zuerst
statusReason: nightRunsApi.list is not a function

[Killed] ArrowFunction
src/api/nightRuns.ts:80:11
 export type NightRunErrorClassCounts = Partial<Record<NightRunErrorClass, number>>
 
 export const nightRunsApi = {
-  submit: (projectId: number, runs: NightRunSubmission[]) =>
-    apiFetch<NightRunResult[]>(`/api/projects/${projectId}/night-runs`, {
-      method: 'POST',
-      body: JSON.stringify({ runs }),
-    }),
+  submit: () => undefined,
   list: (projectId: number) => apiFetch<NightRunView[]>(`/api/projects/${projectId}/night-runs`),
   errorClassCounts: (projectId: number) =>
killedBy: NightRunPage — Protokoll hineingeben sendet die Auswertung und stellt den neuen Lauf nach oben
statusReason: Unable to find an element with the text: neu angelegt. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<div
  class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation0 MuiPaper-root MuiPaper-outlined MuiPaper-rounded MuiAcco

[Killed] StringLiteral
src/api/nightRuns.ts:81:32
 
 export const nightRunsApi = {
   submit: (projectId: number, runs: NightRunSubmission[]) =>
-    apiFetch<NightRunResult[]>(`/api/projects/${projectId}/night-runs`, {
+    apiFetch<NightRunResult[]>(``, {
       method: 'POST',
       body: JSON.stringify({ runs }),
killedBy: NightRunPage — Protokoll hineingeben sendet die Auswertung und stellt den neuen Lauf nach oben
statusReason: Unable to find an element with the text: neu angelegt. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<div
  class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation0 MuiPaper-root MuiPaper-outlined MuiPaper-rounded MuiAcco

[Killed] StringLiteral
src/api/nightRuns.ts:82:15
 export const nightRunsApi = {
   submit: (projectId: number, runs: NightRunSubmission[]) =>
     apiFetch<NightRunResult[]>(`/api/projects/${projectId}/night-runs`, {
-      method: 'POST',
+      method: "",
       body: JSON.stringify({ runs }),
     }),
killedBy: NightRunPage — Protokoll hineingeben sendet die Auswertung und stellt den neuen Lauf nach oben
statusReason: Unable to find an element with the text: neu angelegt. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<div
  class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation0 MuiPaper-root MuiPaper-outlined MuiPaper-rounded MuiAcco

[Killed] ArrowFunction
src/api/nightRuns.ts:85:9
       method: 'POST',
       body: JSON.stringify({ runs }),
     }),
-  list: (projectId: number) => apiFetch<NightRunView[]>(`/api/projects/${projectId}/night-runs`),
+  list: () => undefined,
   errorClassCounts: (projectId: number) =>
     apiFetch<NightRunErrorClassCounts>(`/api/projects/${projectId}/night-runs/error-class-counts`),
killedBy: NightRunPage — aufbewahrte Läufe beim Öffnen zeigt die aufbewahrten Läufe, neueste zuerst
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] StringLiteral
src/api/nightRuns.ts:85:57
       method: 'POST',
       body: JSON.stringify({ runs }),
     }),
-  list: (projectId: number) => apiFetch<NightRunView[]>(`/api/projects/${projectId}/night-runs`),
+  list: (projectId: number) => apiFetch<NightRunView[]>(``),
   errorClassCounts: (projectId: number) =>
     apiFetch<NightRunErrorClassCounts>(`/api/projects/${projectId}/night-runs/error-class-counts`),
killedBy: NightRunPage — aufbewahrte Läufe beim Öffnen zeigt die aufbewahrten Läufe, neueste zuerst
statusReason: Unable to find an element by: [data-testid="lauf-2026-09-01T22:30:00.000Z"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] ArrowFunction
src/api/nightRuns.ts:86:21
       body: JSON.stringify({ runs }),
     }),
   list: (projectId: number) => apiFetch<NightRunView[]>(`/api/projects/${projectId}/night-runs`),
-  errorClassCounts: (projectId: number) =>
-    apiFetch<NightRunErrorClassCounts>(`/api/projects/${projectId}/night-runs/error-class-counts`),
+  errorClassCounts: () => undefined,
 }
 
killedBy: NightRunPage — aufbewahrte Läufe beim Öffnen zeigt die aufbewahrten Läufe, neueste zuerst
statusReason: Cannot read properties of undefined (reading 'catch')

[Killed] StringLiteral
src/api/nightRuns.ts:87:40
     }),
   list: (projectId: number) => apiFetch<NightRunView[]>(`/api/projects/${projectId}/night-runs`),
   errorClassCounts: (projectId: number) =>
-    apiFetch<NightRunErrorClassCounts>(`/api/projects/${projectId}/night-runs/error-class-counts`),
+    apiFetch<NightRunErrorClassCounts>(``),
 }
 
killedBy: NightRunPage — Häufigkeit einer Fehlerklasse zeigt zu einem gelben und einem roten Befund die Häufigkeit seiner Fehlerklasse
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Prüfungen rot: 3 von 3 aufbewahrten Läufen
Received:
  Prüfungen rot: Häufigkeit nicht abrufbar
