[Killed] BlockStatement
src/lib/cardEpic.ts:25:82
  * @param epics Vorhaben des Boards
  * @returns das Vorhaben oder `undefined`, wenn die Karte in keinem steht
  */
-export function epicOfCard(card: Card, epics: readonly Epic[]): Epic | undefined {
-  const kandidaten = epics.filter((epic) => epic.memberNumbers.includes(card.number))
-  // 0 = über die Herkunft erreicht, 1 = ausdrücklich zugeordnet; kleinerer Rang gewinnt.
-  const rang = (epic: Epic) => (epic.rootNumbers.includes(card.number) ? 1 : 0)
-  return kandidaten.sort((a, b) => rang(a) - rang(b) || a.number - b.number)[0]
-}
+export function epicOfCard(card: Card, epics: readonly Epic[]): Epic | undefined {}
 
killedBy: BoardView zeigt ein Epic-Badge auf zugeordneten Karten
statusReason: Unable to find an element with the text: AUT. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <div

[Killed] MethodExpression
src/lib/cardEpic.ts:26:22
  * @returns das Vorhaben oder `undefined`, wenn die Karte in keinem steht
  */
 export function epicOfCard(card: Card, epics: readonly Epic[]): Epic | undefined {
-  const kandidaten = epics.filter((epic) => epic.memberNumbers.includes(card.number))
+  const kandidaten = epics
   // 0 = über die Herkunft erreicht, 1 = ausdrücklich zugeordnet; kleinerer Rang gewinnt.
   const rang = (epic: Epic) => (epic.rootNumbers.includes(card.number) ? 1 : 0)
killedBy: sortCards — Vorhaben sortiert nach dem Kürzel aufsteigend, Karten ohne Vorhaben ans Ende
statusReason: expected [ 1, 2, 3 ] to deeply equal [ 2, 1, 3 ]

[Killed] ArrowFunction
src/lib/cardEpic.ts:26:35
  * @returns das Vorhaben oder `undefined`, wenn die Karte in keinem steht
  */
 export function epicOfCard(card: Card, epics: readonly Epic[]): Epic | undefined {
-  const kandidaten = epics.filter((epic) => epic.memberNumbers.includes(card.number))
+  const kandidaten = epics.filter(() => undefined)
   // 0 = über die Herkunft erreicht, 1 = ausdrücklich zugeordnet; kleinerer Rang gewinnt.
   const rang = (epic: Epic) => (epic.rootNumbers.includes(card.number) ? 1 : 0)
killedBy: BoardView zeigt ein Epic-Badge auf zugeordneten Karten
statusReason: Unable to find an element with the text: AUT. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <div

[Killed] ArrowFunction
src/lib/cardEpic.ts:28:16
 export function epicOfCard(card: Card, epics: readonly Epic[]): Epic | undefined {
   const kandidaten = epics.filter((epic) => epic.memberNumbers.includes(card.number))
   // 0 = über die Herkunft erreicht, 1 = ausdrücklich zugeordnet; kleinerer Rang gewinnt.
-  const rang = (epic: Epic) => (epic.rootNumbers.includes(card.number) ? 1 : 0)
+  const rang = () => undefined
   return kandidaten.sort((a, b) => rang(a) - rang(b) || a.number - b.number)[0]
 }
killedBy: epicOfCard gibt der Herkunft den Vorrang vor der ausdrücklichen Zuordnung
statusReason: expected 70 to be 80 // Object.is equality

[Killed] ArithmeticOperator
src/lib/cardEpic.ts:29:57
   const kandidaten = epics.filter((epic) => epic.memberNumbers.includes(card.number))
   // 0 = über die Herkunft erreicht, 1 = ausdrücklich zugeordnet; kleinerer Rang gewinnt.
   const rang = (epic: Epic) => (epic.rootNumbers.includes(card.number) ? 1 : 0)
-  return kandidaten.sort((a, b) => rang(a) - rang(b) || a.number - b.number)[0]
+  return kandidaten.sort((a, b) => rang(a) - rang(b) || a.number + b.number)[0]
 }
 
killedBy: epicOfCard wählt bei zwei über die Herkunft erreichten Vorhaben die kleinere Nummer
statusReason: expected 80 to be 70 // Object.is equality

[Killed] ConditionalExpression
src/lib/cardEpic.ts:29:36
   const kandidaten = epics.filter((epic) => epic.memberNumbers.includes(card.number))
   // 0 = über die Herkunft erreicht, 1 = ausdrücklich zugeordnet; kleinerer Rang gewinnt.
   const rang = (epic: Epic) => (epic.rootNumbers.includes(card.number) ? 1 : 0)
-  return kandidaten.sort((a, b) => rang(a) - rang(b) || a.number - b.number)[0]
+  return kandidaten.sort((a, b) => true)[0]
 }
 
killedBy: epicOfCard gibt der Herkunft den Vorrang vor der ausdrücklichen Zuordnung
statusReason: expected 70 to be 80 // Object.is equality
