[Killed] BlockStatement
src/lib/cardLocation.ts:41:69
  * Ein noch nicht geladener Projektname fällt auf „Projekt" zurück, damit der Pfad nicht mit einem
  * leeren Segment beginnt (dasselbe Muster wie in den Seiten-Breadcrumbs).
  */
-export function cardLocationCrumbs(location: CardLocation): Crumb[] {
-  const project: Crumb = {
-    label: location.projectName ?? 'Projekt',
-    to: `/projects/${location.projectId}`,
-  }
-  const { board } = location
-  if (board === null) {
-    return [project, { label: 'Ideen', to: `/projects/${location.projectId}/ideas` }]
-  }
-  const boardCrumb: Crumb = board.archived
-    ? { label: `${board.name} (archiviert)` }
-    : { label: board.name, to: `/boards/${board.id}` }
-  return board.columnName == null
-    ? [project, boardCrumb]
-    : [project, boardCrumb, { label: board.columnName }]
-}
+export function cardLocationCrumbs(location: CardLocation): Crumb[] {}
 
 /**
killedBy: CardDetailModal zeigt den Ortspfad aus Projekt, Board und Spalte
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] LogicalOperator
src/lib/cardLocation.ts:43:12
  */
 export function cardLocationCrumbs(location: CardLocation): Crumb[] {
   const project: Crumb = {
-    label: location.projectName ?? 'Projekt',
+    label: location.projectName && 'Projekt',
     to: `/projects/${location.projectId}`,
   }
killedBy: CardDetailModal zeigt den Ortspfad aus Projekt, Board und Spalte
statusReason: Unable to find an accessible element with the role "link" and name "IT-Bildungshaus"

Here are the accessible roles:

  presentation:

  Name "":
  <div

[Killed] ConditionalExpression
src/lib/cardLocation.ts:47:7
     to: `/projects/${location.projectId}`,
   }
   const { board } = location
-  if (board === null) {
+  if (false) {
     return [project, { label: 'Ideen', to: `/projects/${location.projectId}/ideas` }]
   }
killedBy: cardLocationCrumbs nennt eine board-lose Pool-Idee als Ideen des Projekts
statusReason: Cannot read properties of null (reading 'archived')

[Killed] EqualityOperator
src/lib/cardLocation.ts:47:7
     to: `/projects/${location.projectId}`,
   }
   const { board } = location
-  if (board === null) {
+  if (board !== null) {
     return [project, { label: 'Ideen', to: `/projects/${location.projectId}/ideas` }]
   }
killedBy: CardDetailModal zeigt den Ortspfad aus Projekt, Board und Spalte
statusReason: Unable to find an accessible element with the role "link" and name "Entwicklung"

Here are the accessible roles:

  presentation:

  Name "":
  <div

[Killed] ArrayDeclaration
src/lib/cardLocation.ts:48:12
   }
   const { board } = location
   if (board === null) {
-    return [project, { label: 'Ideen', to: `/projects/${location.projectId}/ideas` }]
+    return []
   }
   const boardCrumb: Crumb = board.archived
killedBy: CardDetailModal zeigt für eine board-lose Pool-Idee den verkürzten Pfad zu den Ideen
statusReason: Unable to find an accessible element with the role "link" and name "Ideen"

Here are the accessible roles:

  presentation:

  Name "":
  <div

[Killed] StringLiteral
src/lib/cardLocation.ts:48:44
   }
   const { board } = location
   if (board === null) {
-    return [project, { label: 'Ideen', to: `/projects/${location.projectId}/ideas` }]
+    return [project, { label: 'Ideen', to: `` }]
   }
   const boardCrumb: Crumb = board.archived
killedBy: CardDetailModal zeigt für eine board-lose Pool-Idee den verkürzten Pfad zu den Ideen
statusReason: Unable to find an accessible element with the role "link" and name "Ideen"

Here are the accessible roles:

  presentation:

  Name "":
  <div

[Killed] ObjectLiteral
src/lib/cardLocation.ts:52:7
   }
   const boardCrumb: Crumb = board.archived
     ? { label: `${board.name} (archiviert)` }
-    : { label: board.name, to: `/boards/${board.id}` }
+    : {}
   return board.columnName == null
     ? [project, boardCrumb]
killedBy: cardLocationCrumbs nennt Projekt, Board und Spalte und verlinkt Projekt und Board
statusReason: expected [ …(3) ] to deeply equal [ …(3) ]

[Killed] StringLiteral
src/lib/cardLocation.ts:52:32
   }
   const boardCrumb: Crumb = board.archived
     ? { label: `${board.name} (archiviert)` }
-    : { label: board.name, to: `/boards/${board.id}` }
+    : { label: board.name, to: `` }
   return board.columnName == null
     ? [project, boardCrumb]
killedBy: cardLocationCrumbs nennt Projekt, Board und Spalte und verlinkt Projekt und Board
statusReason: expected [ …(3) ] to deeply equal [ …(3) ]

[Killed] ConditionalExpression
src/lib/cardLocation.ts:53:10
   const boardCrumb: Crumb = board.archived
     ? { label: `${board.name} (archiviert)` }
     : { label: board.name, to: `/boards/${board.id}` }
-  return board.columnName == null
+  return false
     ? [project, boardCrumb]
     : [project, boardCrumb, { label: board.columnName }]
killedBy: cardLocationCrumbs lässt das Spaltensegment weg, wenn der Spaltenname nicht aufgelöst ist
statusReason: expected [ …(3) ] to deeply equal [ …(2) ]

[Killed] EqualityOperator
src/lib/cardLocation.ts:53:10
   const boardCrumb: Crumb = board.archived
     ? { label: `${board.name} (archiviert)` }
     : { label: board.name, to: `/boards/${board.id}` }
-  return board.columnName == null
+  return board.columnName != null
     ? [project, boardCrumb]
     : [project, boardCrumb, { label: board.columnName }]
killedBy: CardDetailModal zeigt den Ortspfad aus Projekt, Board und Spalte
statusReason: Unable to find an element with the text: In Progress. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="padding-right: 1024px; overflow: hidden;"
>
  <div
    aria-hidden="true"

[Killed] BlockStatement
src/lib/cardLocation.ts:63:67
  * eines Auswahleintrags). Bewusst aus denselben Segmenten abgeleitet, damit Sonderfälle wie
  * „archiviert" oder die Pool-Idee nicht an zwei Stellen gepflegt werden müssen.
  */
-export function cardLocationLabel(location: CardLocation): string {
-  return cardLocationCrumbs(location)
-    .map((crumb) => crumb.label)
-    .join(' / ')
-}
+export function cardLocationLabel(location: CardLocation): string {}
 
killedBy: CardNumberSearch zeigt bei mehreren Treffern eine Auswahl mit unterscheidbarem Ort
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Projekt A / Entwicklung / Backlog
Received:
  Fehlerbild klären

[Killed] ArrowFunction
src/lib/cardLocation.ts:65:10
  */
 export function cardLocationLabel(location: CardLocation): string {
   return cardLocationCrumbs(location)
-    .map((crumb) => crumb.label)
+    .map(() => undefined)
     .join(' / ')
 }
killedBy: CardNumberSearch zeigt bei mehreren Treffern eine Auswahl mit unterscheidbarem Ort
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Projekt A / Entwicklung / Backlog
Received:
  Fehlerbild klären / /
