[Killed] BlockStatement
src/lib/cleanupCountdown.ts:14:11
   movedToDoneAt: string,
   retentionDays: number,
   now: number = Date.now(),
-): number {
-  const moved = new Date(movedToDoneAt).getTime()
-  const remaining = retentionDays * 86_400_000 - (now - moved)
-  return Math.max(0, Math.ceil(remaining / 86_400_000))
-}
+): number {}
 
 /** Label-Text für den Done-Archivierungs-Hinweis. */
killedBy: BoardView zeigt den Archiv-Countdown auf Done-Karten
statusReason: Unable to find an element with the text: /wird in 5 Tagen archiviert/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] ArithmeticOperator
src/lib/cleanupCountdown.ts:16:51
   now: number = Date.now(),
 ): number {
   const moved = new Date(movedToDoneAt).getTime()
-  const remaining = retentionDays * 86_400_000 - (now - moved)
+  const remaining = retentionDays * 86_400_000 - (now + moved)
   return Math.max(0, Math.ceil(remaining / 86_400_000))
 }
killedBy: BoardView zeigt den Archiv-Countdown auf Done-Karten
statusReason: Unable to find an element with the text: /wird in 5 Tagen archiviert/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] ArithmeticOperator
src/lib/cleanupCountdown.ts:16:21
   now: number = Date.now(),
 ): number {
   const moved = new Date(movedToDoneAt).getTime()
-  const remaining = retentionDays * 86_400_000 - (now - moved)
+  const remaining = retentionDays / 86_400_000 - (now - moved)
   return Math.max(0, Math.ceil(remaining / 86_400_000))
 }
killedBy: BoardView zeigt den Archiv-Countdown auf Done-Karten
statusReason: Unable to find an element with the text: /wird in 5 Tagen archiviert/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] MethodExpression
src/lib/cleanupCountdown.ts:17:10
 ): number {
   const moved = new Date(movedToDoneAt).getTime()
   const remaining = retentionDays * 86_400_000 - (now - moved)
-  return Math.max(0, Math.ceil(remaining / 86_400_000))
+  return Math.min(0, Math.ceil(remaining / 86_400_000))
 }
 
killedBy: BoardView zeigt den Archiv-Countdown auf Done-Karten
statusReason: Unable to find an element with the text: /wird in 5 Tagen archiviert/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] ArithmeticOperator
src/lib/cleanupCountdown.ts:17:32
 ): number {
   const moved = new Date(movedToDoneAt).getTime()
   const remaining = retentionDays * 86_400_000 - (now - moved)
-  return Math.max(0, Math.ceil(remaining / 86_400_000))
+  return Math.max(0, Math.ceil(remaining * 86_400_000))
 }
 
killedBy: BoardView zeigt den Archiv-Countdown auf Done-Karten
statusReason: Unable to find an element with the text: /wird in 5 Tagen archiviert/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] BlockStatement
src/lib/cleanupCountdown.ts:21:61
 }
 
 /** Label-Text für den Done-Archivierungs-Hinweis. */
-export function cleanupCountdownLabel(days: number): string {
-  if (days === 0) return 'wird heute archiviert'
-  if (days === 1) return 'wird morgen archiviert'
-  return `wird in ${days} Tagen archiviert`
-}
+export function cleanupCountdownLabel(days: number): string {}
 
killedBy: BoardView zeigt den Archiv-Countdown auf Done-Karten
statusReason: Unable to find an element with the text: /wird in 5 Tagen archiviert/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] ConditionalExpression
src/lib/cleanupCountdown.ts:22:7
 
 /** Label-Text für den Done-Archivierungs-Hinweis. */
 export function cleanupCountdownLabel(days: number): string {
-  if (days === 0) return 'wird heute archiviert'
+  if (true) return 'wird heute archiviert'
   if (days === 1) return 'wird morgen archiviert'
   return `wird in ${days} Tagen archiviert`
killedBy: BoardView zeigt den Archiv-Countdown auf Done-Karten
statusReason: Unable to find an element with the text: /wird in 5 Tagen archiviert/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] ConditionalExpression
src/lib/cleanupCountdown.ts:22:7
 
 /** Label-Text für den Done-Archivierungs-Hinweis. */
 export function cleanupCountdownLabel(days: number): string {
-  if (days === 0) return 'wird heute archiviert'
+  if (false) return 'wird heute archiviert'
   if (days === 1) return 'wird morgen archiviert'
   return `wird in ${days} Tagen archiviert`
killedBy: cleanupCountdownLabel formatiert heute/morgen/Tage
statusReason: expected 'wird in 0 Tagen archiviert' to be 'wird heute archiviert' // Object.is equality

[Killed] ConditionalExpression
src/lib/cleanupCountdown.ts:23:7
 /** Label-Text für den Done-Archivierungs-Hinweis. */
 export function cleanupCountdownLabel(days: number): string {
   if (days === 0) return 'wird heute archiviert'
-  if (days === 1) return 'wird morgen archiviert'
+  if (false) return 'wird morgen archiviert'
   return `wird in ${days} Tagen archiviert`
 }
killedBy: cleanupCountdownLabel formatiert heute/morgen/Tage
statusReason: expected 'wird in 1 Tagen archiviert' to be 'wird morgen archiviert' // Object.is equality

[Killed] ConditionalExpression
src/lib/cleanupCountdown.ts:23:7
 /** Label-Text für den Done-Archivierungs-Hinweis. */
 export function cleanupCountdownLabel(days: number): string {
   if (days === 0) return 'wird heute archiviert'
-  if (days === 1) return 'wird morgen archiviert'
+  if (true) return 'wird morgen archiviert'
   return `wird in ${days} Tagen archiviert`
 }
killedBy: BoardView zeigt den Archiv-Countdown auf Done-Karten
statusReason: Unable to find an element with the text: /wird in 5 Tagen archiviert/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] StringLiteral
src/lib/cleanupCountdown.ts:24:10
 export function cleanupCountdownLabel(days: number): string {
   if (days === 0) return 'wird heute archiviert'
   if (days === 1) return 'wird morgen archiviert'
-  return `wird in ${days} Tagen archiviert`
+  return ``
 }
 
killedBy: BoardView zeigt den Archiv-Countdown auf Done-Karten
statusReason: Unable to find an element with the text: /wird in 5 Tagen archiviert/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >
