[Killed] MethodExpression
src/lib/columnMeta.ts:4:56
 import type { BoardColumn } from '../api/boards'
 
 /** Ob eine Spalte fachlich "Done" ist (aus dem Namen). */
-export const isDoneColumn = (name: string): boolean => name.toLowerCase().includes('done')
+export const isDoneColumn = (name: string): boolean => name.toUpperCase().includes('done')
 
 /**
killedBy: isDoneColumn erkennt Done als done=true
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/columnMeta.ts:4:29
 import type { BoardColumn } from '../api/boards'
 
 /** Ob eine Spalte fachlich "Done" ist (aus dem Namen). */
-export const isDoneColumn = (name: string): boolean => name.toLowerCase().includes('done')
+export const isDoneColumn = () => undefined
 
 /**
killedBy: isDoneColumn erkennt Done als done=true
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/lib/columnMeta.ts:14:60
 export function neighbourColumns(
   columns: BoardColumn[],
   columnId: number,
-): { left: BoardColumn | null; right: BoardColumn | null } {
-  const index = columns.findIndex((c) => c.id === columnId)
-  if (index < 0) {
-    return { left: null, right: null }
-  }
-  return {
-    left: index > 0 ? columns[index - 1] : null,
-    right: index < columns.length - 1 ? columns[index + 1] : null,
-  }
-}
+): { left: BoardColumn | null; right: BoardColumn | null } {}
 
killedBy: BoardPage weitere Orchestrierung öffnet eine Karte im Edit-Modus über das ⋮-Menü der BoardView
statusReason: Cannot destructure property 'left' of '(intermediate value)(intermediate value)(intermediate value)' as it is undefined.

[Killed] EqualityOperator
src/lib/columnMeta.ts:15:42
   columns: BoardColumn[],
   columnId: number,
 ): { left: BoardColumn | null; right: BoardColumn | null } {
-  const index = columns.findIndex((c) => c.id === columnId)
+  const index = columns.findIndex((c) => c.id !== columnId)
   if (index < 0) {
     return { left: null, right: null }
killedBy: BoardView archiviert und verschiebt über das ⋮-Menü
statusReason: Unable to find an accessible element with the role "menuitem" and name "Nach rechts verschieben"

Here are the accessible roles:

  presentation:

  Name "":
  <div

[Killed] ConditionalExpression
src/lib/columnMeta.ts:15:42
   columns: BoardColumn[],
   columnId: number,
 ): { left: BoardColumn | null; right: BoardColumn | null } {
-  const index = columns.findIndex((c) => c.id === columnId)
+  const index = columns.findIndex((c) => false)
   if (index < 0) {
     return { left: null, right: null }
killedBy: neighbourColumns liefert für eine mittlere Spalte beide Nachbarn
statusReason: expected { left: null, right: null } to deeply equal { left: { id: 10, …(3) }, …(1) }

[Killed] BlockStatement
src/lib/columnMeta.ts:16:18
   columnId: number,
 ): { left: BoardColumn | null; right: BoardColumn | null } {
   const index = columns.findIndex((c) => c.id === columnId)
-  if (index < 0) {
-    return { left: null, right: null }
-  }
+  if (index < 0) {}
   return {
     left: index > 0 ? columns[index - 1] : null,
killedBy: neighbourColumns liefert für eine unbekannte Spalte keinen Nachbarn
statusReason: expected { left: null, right: { id: 10, …(3) } } to deeply equal { left: null, right: null }

[Killed] ConditionalExpression
src/lib/columnMeta.ts:16:7
   columnId: number,
 ): { left: BoardColumn | null; right: BoardColumn | null } {
   const index = columns.findIndex((c) => c.id === columnId)
-  if (index < 0) {
+  if (true) {
     return { left: null, right: null }
   }
killedBy: neighbourColumns liefert für eine mittlere Spalte beide Nachbarn
statusReason: expected { left: null, right: null } to deeply equal { left: { id: 10, …(3) }, …(1) }

[Killed] EqualityOperator
src/lib/columnMeta.ts:20:11
     return { left: null, right: null }
   }
   return {
-    left: index > 0 ? columns[index - 1] : null,
+    left: index >= 0 ? columns[index - 1] : null,
     right: index < columns.length - 1 ? columns[index + 1] : null,
   }
killedBy: neighbourColumns liefert für die erste Spalte keinen linken Nachbarn
statusReason: expected { left: undefined, …(1) } to deeply equal { left: null, right: { id: 20, …(3) } }

[Killed] ArithmeticOperator
src/lib/columnMeta.ts:20:31
     return { left: null, right: null }
   }
   return {
-    left: index > 0 ? columns[index - 1] : null,
+    left: index > 0 ? columns[index + 1] : null,
     right: index < columns.length - 1 ? columns[index + 1] : null,
   }
killedBy: neighbourColumns liefert für eine mittlere Spalte beide Nachbarn
statusReason: expected { left: { id: 30, …(3) }, …(1) } to deeply equal { left: { id: 10, …(3) }, …(1) }

[Killed] ArithmeticOperator
src/lib/columnMeta.ts:21:20
   }
   return {
     left: index > 0 ? columns[index - 1] : null,
-    right: index < columns.length - 1 ? columns[index + 1] : null,
+    right: index < columns.length + 1 ? columns[index + 1] : null,
   }
 }
killedBy: neighbourColumns liefert für die letzte Spalte keinen rechten Nachbarn
statusReason: expected { left: { id: 20, …(3) }, …(1) } to deeply equal { left: { id: 20, …(3) }, right: null }

[Killed] ArithmeticOperator
src/lib/columnMeta.ts:21:49
   }
   return {
     left: index > 0 ? columns[index - 1] : null,
-    right: index < columns.length - 1 ? columns[index + 1] : null,
+    right: index < columns.length - 1 ? columns[index - 1] : null,
   }
 }
killedBy: neighbourColumns liefert für eine mittlere Spalte beide Nachbarn
statusReason: expected { left: { id: 10, …(3) }, …(1) } to deeply equal { left: { id: 10, …(3) }, …(1) }
