[Survived] ArrayDeclaration
src/lib/designGuard.ts:33:25
  * frisst dort den Zeilenrest oder loescht alles bis zum naechsten Sternschraegstrich.
  */
 export function stripComments(source: string): string {
-  const out: string[] = []
+  const out: string[] = ["Stryker was here"]
   let quote: string | null = null
   let mode: 'code' | 'line' | 'block' = 'code'

[Survived] StringLiteral
src/lib/designGuard.ts:35:41
 export function stripComments(source: string): string {
   const out: string[] = []
   let quote: string | null = null
-  let mode: 'code' | 'line' | 'block' = 'code'
+  let mode: 'code' | 'line' | 'block' = ""
 
   for (let i = 0; i < source.length; i++) {

[Killed] EqualityOperator
src/lib/designGuard.ts:37:19
   let quote: string | null = null
   let mode: 'code' | 'line' | 'block' = 'code'
 
-  for (let i = 0; i < source.length; i++) {
+  for (let i = 0; i >= source.length; i++) {
     const char = source[i]
     const next = source[i + 1]
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] ConditionalExpression
src/lib/designGuard.ts:37:19
   let quote: string | null = null
   let mode: 'code' | 'line' | 'block' = 'code'
 
-  for (let i = 0; i < source.length; i++) {
+  for (let i = 0; false; i++) {
     const char = source[i]
     const next = source[i + 1]
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] ArithmeticOperator
src/lib/designGuard.ts:39:25
 
   for (let i = 0; i < source.length; i++) {
     const char = source[i]
-    const next = source[i + 1]
+    const next = source[i - 1]
     const blank = char === '\n' ? '\n' : ' '
 
killedBy: Design-Leitplanke im Bestand haelt den Bestand frei von Verstoessen ausserhalb der Ausnahmeliste
statusReason: expected [ { …(4) }, { …(4) }, { …(4) } ] to deeply equal []

[Survived] ConditionalExpression
src/lib/designGuard.ts:40:19
   for (let i = 0; i < source.length; i++) {
     const char = source[i]
     const next = source[i + 1]
-    const blank = char === '\n' ? '\n' : ' '
+    const blank = false ? '\n' : ' '
 
     if (mode === 'line') {

[Survived] EqualityOperator
src/lib/designGuard.ts:40:19
   for (let i = 0; i < source.length; i++) {
     const char = source[i]
     const next = source[i + 1]
-    const blank = char === '\n' ? '\n' : ' '
+    const blank = char !== '\n' ? '\n' : ' '
 
     if (mode === 'line') {

[Killed] BlockStatement
src/lib/designGuard.ts:42:26
     const next = source[i + 1]
     const blank = char === '\n' ? '\n' : ' '
 
-    if (mode === 'line') {
-      out.push(blank)
-      if (char === '\n') mode = 'code'
-      continue
-    }
+    if (mode === 'line') {}
     if (mode === 'block') {
       out.push(blank)
killedBy: Design-Leitplanke im Bestand haelt den Bestand frei von Verstoessen ausserhalb der Ausnahmeliste
statusReason: expected [ { …(4) }, { …(4) }, { …(4) } ] to deeply equal []

[Killed] ConditionalExpression
src/lib/designGuard.ts:42:9
     const next = source[i + 1]
     const blank = char === '\n' ? '\n' : ' '
 
-    if (mode === 'line') {
+    if (false) {
       out.push(blank)
       if (char === '\n') mode = 'code'
killedBy: Design-Leitplanke im Bestand haelt den Bestand frei von Verstoessen ausserhalb der Ausnahmeliste
statusReason: expected [ { …(4) }, { …(4) }, { …(4) } ] to deeply equal []

[Killed] ConditionalExpression
src/lib/designGuard.ts:44:11
 
     if (mode === 'line') {
       out.push(blank)
-      if (char === '\n') mode = 'code'
+      if (false) mode = 'code'
       continue
     }
killedBy: scanSource: was nicht gemeldet wird liest ueber maskierte Anfuehrungszeichen hinweg
statusReason: expected [] to deeply equal [ 'hex' ]

[Killed] ConditionalExpression
src/lib/designGuard.ts:44:11
 
     if (mode === 'line') {
       out.push(blank)
-      if (char === '\n') mode = 'code'
+      if (true) mode = 'code'
       continue
     }
killedBy: Design-Leitplanke im Bestand haelt den Bestand frei von Verstoessen ausserhalb der Ausnahmeliste
statusReason: expected [ { …(4) }, { …(4) }, { …(4) } ] to deeply equal []

[Killed] ConditionalExpression
src/lib/designGuard.ts:47:9
       if (char === '\n') mode = 'code'
       continue
     }
-    if (mode === 'block') {
+    if (false) {
       out.push(blank)
       if (char === '*' && next === '/') {
killedBy: Design-Leitplanke im Bestand haelt den Bestand frei von Verstoessen ausserhalb der Ausnahmeliste
statusReason: expected [ { …(4) }, { …(4) }, { …(4) } ] to deeply equal []

[Killed] EqualityOperator
src/lib/designGuard.ts:47:9
       if (char === '\n') mode = 'code'
       continue
     }
-    if (mode === 'block') {
+    if (mode !== 'block') {
       out.push(blank)
       if (char === '*' && next === '/') {
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] ConditionalExpression
src/lib/designGuard.ts:49:27
     }
     if (mode === 'block') {
       out.push(blank)
-      if (char === '*' && next === '/') {
+      if (char === '*' && true) {
         out.push(' ')
         i++
killedBy: Design-Leitplanke im Bestand haelt den Bestand frei von Verstoessen ausserhalb der Ausnahmeliste
statusReason: expected [ { …(4) }, { …(4) }, { …(4) } ] to deeply equal []

[Killed] ConditionalExpression
src/lib/designGuard.ts:49:11
     }
     if (mode === 'block') {
       out.push(blank)
-      if (char === '*' && next === '/') {
+      if (true && next === '/') {
         out.push(' ')
         i++
killedBy: Design-Leitplanke im Bestand haelt den Bestand frei von Verstoessen ausserhalb der Ausnahmeliste
statusReason: expected [ { …(4) }, { …(4) }, { …(4) } ] to deeply equal []

[Survived] UpdateOperator
src/lib/designGuard.ts:51:9
       out.push(blank)
       if (char === '*' && next === '/') {
         out.push(' ')
-        i++
+        i--
         mode = 'code'
       }

[Killed] ConditionalExpression
src/lib/designGuard.ts:56:9
       }
       continue
     }
-    if (quote !== null) {
+    if (true) {
       out.push(char)
       if (char === '\\') {
killedBy: Design-Leitplanke im Bestand haelt den Bestand frei von Verstoessen ausserhalb der Ausnahmeliste
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deeply equal []

[Killed] EqualityOperator
src/lib/designGuard.ts:56:9
       }
       continue
     }
-    if (quote !== null) {
+    if (quote === null) {
       out.push(char)
       if (char === '\\') {
killedBy: Design-Leitplanke im Bestand haelt den Bestand frei von Verstoessen ausserhalb der Ausnahmeliste
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deeply equal []

[Killed] ConditionalExpression
src/lib/designGuard.ts:58:11
     }
     if (quote !== null) {
       out.push(char)
-      if (char === '\\') {
+      if (true) {
         // `slice` statt `source[i + 1]`: am Dateiende gibt es kein naechstes Zeichen, und ein
         // `?? ''` waere ein Zweig, den kein gueltiger Quelltext je nimmt.
killedBy: Design-Leitplanke im Bestand haelt den Bestand frei von Verstoessen ausserhalb der Ausnahmeliste
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deeply equal []

[Killed] EqualityOperator
src/lib/designGuard.ts:58:11
     }
     if (quote !== null) {
       out.push(char)
-      if (char === '\\') {
+      if (char !== '\\') {
         // `slice` statt `source[i + 1]`: am Dateiende gibt es kein naechstes Zeichen, und ein
         // `?? ''` waere ein Zweig, den kein gueltiger Quelltext je nimmt.
killedBy: Design-Leitplanke im Bestand haelt den Bestand frei von Verstoessen ausserhalb der Ausnahmeliste
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deeply equal []

[Killed] MethodExpression
src/lib/designGuard.ts:61:18
       if (char === '\\') {
         // `slice` statt `source[i + 1]`: am Dateiende gibt es kein naechstes Zeichen, und ein
         // `?? ''` waere ein Zweig, den kein gueltiger Quelltext je nimmt.
-        out.push(source.slice(i + 1, i + 2))
+        out.push(source)
         i++
       } else if (char === quote) {
killedBy: Design-Leitplanke im Bestand haelt den Bestand frei von Verstoessen ausserhalb der Ausnahmeliste
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(29) ] to deeply equal []

[Survived] ArithmeticOperator
src/lib/designGuard.ts:61:31
       if (char === '\\') {
         // `slice` statt `source[i + 1]`: am Dateiende gibt es kein naechstes Zeichen, und ein
         // `?? ''` waere ein Zweig, den kein gueltiger Quelltext je nimmt.
-        out.push(source.slice(i + 1, i + 2))
+        out.push(source.slice(i - 1, i + 2))
         i++
       } else if (char === quote) {

[Timeout] UpdateOperator
src/lib/designGuard.ts:62:9
         // `slice` statt `source[i + 1]`: am Dateiende gibt es kein naechstes Zeichen, und ein
         // `?? ''` waere ein Zweig, den kein gueltiger Quelltext je nimmt.
         out.push(source.slice(i + 1, i + 2))
-        i++
+        i--
       } else if (char === quote) {
         quote = null

[Killed] ConditionalExpression
src/lib/designGuard.ts:63:18
         // `?? ''` waere ein Zweig, den kein gueltiger Quelltext je nimmt.
         out.push(source.slice(i + 1, i + 2))
         i++
-      } else if (char === quote) {
+      } else if (false) {
         quote = null
       }
killedBy: Design-Leitplanke im Bestand haelt den Bestand frei von Verstoessen ausserhalb der Ausnahmeliste
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deeply equal []

[Killed] BlockStatement
src/lib/designGuard.ts:63:34
         // `?? ''` waere ein Zweig, den kein gueltiger Quelltext je nimmt.
         out.push(source.slice(i + 1, i + 2))
         i++
-      } else if (char === quote) {
-        quote = null
-      }
+      } else if (char === quote) {}
       continue
     }
killedBy: Design-Leitplanke im Bestand haelt den Bestand frei von Verstoessen ausserhalb der Ausnahmeliste
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deeply equal []

[Killed] LogicalOperator
src/lib/designGuard.ts:68:9
       }
       continue
     }
-    if (char === "'" || char === '"' || char === '`') {
+    if (char === "'" && char === '"' || char === '`') {
       quote = char
       out.push(char)
killedBy: scanSource: was nicht gemeldet wird laesst sich von // und /* innerhalb von Zeichenketten nicht taeuschen
statusReason: expected [] to deeply equal [ 'hex' ]

[Killed] BlockStatement
src/lib/designGuard.ts:68:55
       }
       continue
     }
-    if (char === "'" || char === '"' || char === '`') {
-      quote = char
-      out.push(char)
-      continue
-    }
+    if (char === "'" || char === '"' || char === '`') {}
     if (char === '/' && next === '/') {
       out.push('  ')
killedBy: scanSource: was nicht gemeldet wird laesst sich von // und /* innerhalb von Zeichenketten nicht taeuschen
statusReason: expected [] to deeply equal [ 'hex' ]

[Killed] EqualityOperator
src/lib/designGuard.ts:73:9
       out.push(char)
       continue
     }
-    if (char === '/' && next === '/') {
+    if (char !== '/' && next === '/') {
       out.push('  ')
       i++
killedBy: Design-Leitplanke im Bestand haelt den Bestand frei von Verstoessen ausserhalb der Ausnahmeliste
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] ConditionalExpression
src/lib/designGuard.ts:73:9
       out.push(char)
       continue
     }
-    if (char === '/' && next === '/') {
+    if (true) {
       out.push('  ')
       i++
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] ConditionalExpression
src/lib/designGuard.ts:79:9
       mode = 'line'
       continue
     }
-    if (char === '/' && next === '*') {
+    if (true) {
       out.push('  ')
       i++
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] EqualityOperator
src/lib/designGuard.ts:79:25
       mode = 'line'
       continue
     }
-    if (char === '/' && next === '*') {
+    if (char === '/' && next !== '*') {
       out.push('  ')
       i++
killedBy: Design-Leitplanke im Bestand haelt den Bestand frei von Verstoessen ausserhalb der Ausnahmeliste
statusReason: expected [ { …(4) }, { …(4) }, { …(4) } ] to deeply equal []

[Killed] StringLiteral
src/lib/designGuard.ts:82:14
     if (char === '/' && next === '*') {
       out.push('  ')
       i++
-      mode = 'block'
+      mode = ""
       continue
     }
killedBy: Design-Leitplanke im Bestand haelt den Bestand frei von Verstoessen ausserhalb der Ausnahmeliste
statusReason: expected [ { …(4) }, { …(4) }, { …(4) } ] to deeply equal []

[Killed] Regex
src/lib/designGuard.ts:96:21
  * benannte Style-Konstante (`const cardSx = {`). Ohne den letzten Fall ist die Leitplanke blind
  * fuer genau die Objekte, in die zentralisierte Styles wandern.
  */
-const STYLE_ENTRY = /\b(?:sx|style)\s*[=:]|\bstyled\(|\b\w*[sS]x\s*(?::[^=]*)?=[^=]/g
+const STYLE_ENTRY = /\b(?:sx|style)\s*[=:]|\bstyled\(|\b\w*[sS]x\s*(?::[^=]*)?=[=]/g
 
 /**
killedBy: scanSource: was gemeldet wird meldet Hex-Farben in benannten Style-Konstanten
statusReason: expected [] to deeply equal [ 'hex' ]

[Killed] Regex
src/lib/designGuard.ts:96:21
  * benannte Style-Konstante (`const cardSx = {`). Ohne den letzten Fall ist die Leitplanke blind
  * fuer genau die Objekte, in die zentralisierte Styles wandern.
  */
-const STYLE_ENTRY = /\b(?:sx|style)\s*[=:]|\bstyled\(|\b\w*[sS]x\s*(?::[^=]*)?=[^=]/g
+const STYLE_ENTRY = /\b(?:sx|style)\s*[=:]|\bstyled\(|\b\w[sS]x\s*(?::[^=]*)?=[^=]/g
 
 /**
killedBy: scanSource: was gemeldet wird meldet Hex-Farben in benannten Style-Konstanten
statusReason: expected [] to deeply equal [ 'hex' ]

[Killed] BlockStatement
src/lib/designGuard.ts:108:46
   let position = 0
   let open = carry
 
-  const consume = (from: number): boolean => {
-    // `entered` haelt fest, dass der Ausdruck ueberhaupt begonnen hat: Zwischen dem `sx` und
-    // seiner ersten Klammer steht die Bilanz auf null, und ohne diese Unterscheidung endete die
-    // Spanne sofort wieder.
-    let entered = open > 0
-    for (let i = from; i < line.length; i++) {
-      const char = line[i]
-      if (char === '{' || char === '(') {
-        open++
-        entered = true
-      }
-      if (char === '}' || char === ')') open--
-      if (entered && open <= 0) {
-        spans.push([from, i + 1])
-        position = i + 1
-        open = 0
-        return true
-      }
-    }
-    spans.push([from, line.length])
-    position = line.length
-    return false
-  }
+  const consume = (from: number): boolean => {}
 
   if (open > 0 && !consume(0)) {
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [ 'boxShadow', 'elevation' ] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] ConditionalExpression
src/lib/designGuard.ts:112:19
     // `entered` haelt fest, dass der Ausdruck ueberhaupt begonnen hat: Zwischen dem `sx` und
     // seiner ersten Klammer steht die Bilanz auf null, und ohne diese Unterscheidung endete die
     // Spanne sofort wieder.
-    let entered = open > 0
+    let entered = true
     for (let i = from; i < line.length; i++) {
       const char = line[i]
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [ 'boxShadow', 'elevation' ] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] EqualityOperator
src/lib/designGuard.ts:112:19
     // `entered` haelt fest, dass der Ausdruck ueberhaupt begonnen hat: Zwischen dem `sx` und
     // seiner ersten Klammer steht die Bilanz auf null, und ohne diese Unterscheidung endete die
     // Spanne sofort wieder.
-    let entered = open > 0
+    let entered = open <= 0
     for (let i = from; i < line.length; i++) {
       const char = line[i]
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [ 'boxShadow', 'elevation' ] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] ConditionalExpression
src/lib/designGuard.ts:113:24
     // seiner ersten Klammer steht die Bilanz auf null, und ohne diese Unterscheidung endete die
     // Spanne sofort wieder.
     let entered = open > 0
-    for (let i = from; i < line.length; i++) {
+    for (let i = from; false; i++) {
       const char = line[i]
       if (char === '{' || char === '(') {
killedBy: scanSource: was gemeldet wird meldet eine Hex-Farbe auch in einem mehrzeiligen sx-Block
statusReason: expected [] to deeply equal [ 'hex' ]

[Killed] BlockStatement
src/lib/designGuard.ts:113:46
     // seiner ersten Klammer steht die Bilanz auf null, und ohne diese Unterscheidung endete die
     // Spanne sofort wieder.
     let entered = open > 0
-    for (let i = from; i < line.length; i++) {
-      const char = line[i]
-      if (char === '{' || char === '(') {
-        open++
-        entered = true
-      }
-      if (char === '}' || char === ')') open--
-      if (entered && open <= 0) {
-        spans.push([from, i + 1])
-        position = i + 1
-        open = 0
-        return true
-      }
-    }
+    for (let i = from; i < line.length; i++) {}
     spans.push([from, line.length])
     position = line.length
killedBy: scanSource: was gemeldet wird meldet eine Hex-Farbe auch in einem mehrzeiligen sx-Block
statusReason: expected [] to deeply equal [ 'hex' ]

[Killed] EqualityOperator
src/lib/designGuard.ts:115:27
     let entered = open > 0
     for (let i = from; i < line.length; i++) {
       const char = line[i]
-      if (char === '{' || char === '(') {
+      if (char === '{' || char !== '(') {
         open++
         entered = true
killedBy: scanSource: was nicht gemeldet wird endet mit dem sx-Ausdruck und nicht erst am Zeilenende
statusReason: expected [ { …(4) } ] to deeply equal []

[Killed] ConditionalExpression
src/lib/designGuard.ts:115:11
     let entered = open > 0
     for (let i = from; i < line.length; i++) {
       const char = line[i]
-      if (char === '{' || char === '(') {
+      if (true) {
         open++
         entered = true
killedBy: scanSource: was nicht gemeldet wird endet mit dem sx-Ausdruck und nicht erst am Zeilenende
statusReason: expected [ { …(4) } ] to deeply equal []

[Killed] UpdateOperator
src/lib/designGuard.ts:116:9
     for (let i = from; i < line.length; i++) {
       const char = line[i]
       if (char === '{' || char === '(') {
-        open++
+        open--
         entered = true
       }
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [ 'boxShadow', 'elevation' ] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] BooleanLiteral
src/lib/designGuard.ts:117:19
       const char = line[i]
       if (char === '{' || char === '(') {
         open++
-        entered = true
+        entered = false
       }
       if (char === '}' || char === ')') open--
killedBy: scanSource: was nicht gemeldet wird endet mit dem sx-Ausdruck und nicht erst am Zeilenende
statusReason: expected [ { …(4) } ] to deeply equal []

[Killed] EqualityOperator
src/lib/designGuard.ts:119:27
         open++
         entered = true
       }
-      if (char === '}' || char === ')') open--
+      if (char === '}' || char !== ')') open--
       if (entered && open <= 0) {
         spans.push([from, i + 1])
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [ 'boxShadow', 'elevation' ] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] UpdateOperator
src/lib/designGuard.ts:119:41
         open++
         entered = true
       }
-      if (char === '}' || char === ')') open--
+      if (char === '}' || char === ')') open++
       if (entered && open <= 0) {
         spans.push([from, i + 1])
killedBy: scanSource: was nicht gemeldet wird endet mit dem sx-Ausdruck und nicht erst am Zeilenende
statusReason: expected [ { …(4) } ] to deeply equal []

[Killed] BlockStatement
src/lib/designGuard.ts:120:33
         entered = true
       }
       if (char === '}' || char === ')') open--
-      if (entered && open <= 0) {
-        spans.push([from, i + 1])
-        position = i + 1
-        open = 0
-        return true
-      }
+      if (entered && open <= 0) {}
     }
     spans.push([from, line.length])
killedBy: scanSource: was nicht gemeldet wird endet mit dem sx-Ausdruck und nicht erst am Zeilenende
statusReason: expected [ { …(4) } ] to deeply equal []

[Killed] LogicalOperator
src/lib/designGuard.ts:120:11
         entered = true
       }
       if (char === '}' || char === ')') open--
-      if (entered && open <= 0) {
+      if (entered || open <= 0) {
         spans.push([from, i + 1])
         position = i + 1
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [ 'boxShadow', 'elevation' ] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Survived] ArithmeticOperator
src/lib/designGuard.ts:121:27
       }
       if (char === '}' || char === ')') open--
       if (entered && open <= 0) {
-        spans.push([from, i + 1])
+        spans.push([from, i - 1])
         position = i + 1
         open = 0

[Survived] ArithmeticOperator
src/lib/designGuard.ts:122:20
       if (char === '}' || char === ')') open--
       if (entered && open <= 0) {
         spans.push([from, i + 1])
-        position = i + 1
+        position = i - 1
         open = 0
         return true

[Survived] BooleanLiteral
src/lib/designGuard.ts:124:16
         spans.push([from, i + 1])
         position = i + 1
         open = 0
-        return true
+        return false
       }
     }

[Killed] BooleanLiteral
src/lib/designGuard.ts:129:12
     }
     spans.push([from, line.length])
     position = line.length
-    return false
+    return true
   }
 
killedBy: scanSource: was gemeldet wird meldet eine Hex-Farbe auch in einem mehrzeiligen sx-Block
statusReason: expected [] to deeply equal [ 'hex' ]

[Killed] EqualityOperator
src/lib/designGuard.ts:132:7
     return false
   }
 
-  if (open > 0 && !consume(0)) {
+  if (open >= 0 && !consume(0)) {
     return { spans, carry: open }
   }
killedBy: scanSource: was nicht gemeldet wird haelt die Kartennummer #345 und Issue-Anker in Kommentaren heraus
statusReason: expected [ { …(4) }, { …(4) } ] to deeply equal []

[Killed] ConditionalExpression
src/lib/designGuard.ts:132:7
     return false
   }
 
-  if (open > 0 && !consume(0)) {
+  if (true && !consume(0)) {
     return { spans, carry: open }
   }
killedBy: scanSource: was nicht gemeldet wird haelt die Kartennummer #345 und Issue-Anker in Kommentaren heraus
statusReason: expected [ { …(4) }, { …(4) } ] to deeply equal []

[Killed] ObjectLiteral
src/lib/designGuard.ts:133:12
   }
 
   if (open > 0 && !consume(0)) {
-    return { spans, carry: open }
+    return {}
   }
 
killedBy: scanSource: was gemeldet wird meldet eine Hex-Farbe auch in einem mehrzeiligen sx-Block
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] EqualityOperator
src/lib/designGuard.ts:138:10
 
   STYLE_ENTRY.lastIndex = position
   let match = STYLE_ENTRY.exec(line)
-  while (match !== null) {
+  while (match === null) {
     if (!consume(match.index)) {
       return { spans, carry: open }
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: Cannot read properties of null (reading 'index')

[Killed] ConditionalExpression
src/lib/designGuard.ts:138:10
 
   STYLE_ENTRY.lastIndex = position
   let match = STYLE_ENTRY.exec(line)
-  while (match !== null) {
+  while (false) {
     if (!consume(match.index)) {
       return { spans, carry: open }
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [ 'boxShadow', 'elevation' ] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] ConditionalExpression
src/lib/designGuard.ts:139:9
   STYLE_ENTRY.lastIndex = position
   let match = STYLE_ENTRY.exec(line)
   while (match !== null) {
-    if (!consume(match.index)) {
+    if (true) {
       return { spans, carry: open }
     }
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [ 'boxShadow', 'elevation' ] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] BlockStatement
src/lib/designGuard.ts:139:32
   STYLE_ENTRY.lastIndex = position
   let match = STYLE_ENTRY.exec(line)
   while (match !== null) {
-    if (!consume(match.index)) {
-      return { spans, carry: open }
-    }
+    if (!consume(match.index)) {}
     STYLE_ENTRY.lastIndex = position
     match = STYLE_ENTRY.exec(line)
killedBy: scanSource: was gemeldet wird meldet eine Hex-Farbe auch in einem mehrzeiligen sx-Block
statusReason: expected [] to deeply equal [ 'hex' ]

[Killed] ObjectLiteral
src/lib/designGuard.ts:140:14
   let match = STYLE_ENTRY.exec(line)
   while (match !== null) {
     if (!consume(match.index)) {
-      return { spans, carry: open }
+      return {}
     }
     STYLE_ENTRY.lastIndex = position
killedBy: scanSource: was gemeldet wird meldet eine Hex-Farbe auch in einem mehrzeiligen sx-Block
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] Regex
src/lib/designGuard.ts:149:13
   return { spans, carry: 0 }
 }
 
-const HEX = /#[0-9a-fA-F]{3,8}(?![0-9a-fA-F])/
+const HEX = /#[0-9a-fA-F](?![0-9a-fA-F])/
 /** `elevation={…}` mit allem ausser einer glatten 0 — auch aus einer Variablen. */
 const ELEVATION = /elevation=\{\s*(?!0\s*\})/
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [ 'boxShadow', 'elevation' ] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] Regex
src/lib/designGuard.ts:149:13
   return { spans, carry: 0 }
 }
 
-const HEX = /#[0-9a-fA-F]{3,8}(?![0-9a-fA-F])/
+const HEX = /#[0-9a-fA-F]{3,8}(?![^0-9a-fA-F])/
 /** `elevation={…}` mit allem ausser einer glatten 0 — auch aus einer Variablen. */
 const ELEVATION = /elevation=\{\s*(?!0\s*\})/
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [ 'boxShadow', 'elevation' ] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Survived] Regex
src/lib/designGuard.ts:152:24
 const HEX = /#[0-9a-fA-F]{3,8}(?![0-9a-fA-F])/
 /** `elevation={…}` mit allem ausser einer glatten 0 — auch aus einer Variablen. */
 const ELEVATION = /elevation=\{\s*(?!0\s*\})/
-const NUMERIC_SHADOW = /boxShadow\s*:\s*[1-9]/
+const NUMERIC_SHADOW = /boxShadow\S*:\s*[1-9]/
 /** Ein Schatten mit schwarzem Anteil, auch als Zeichenkette geschrieben. */
 const BLACK_SHADOW = /boxShadow[^,}\n]*(?:rgba?\(\s*0\s*,\s*0\s*,\s*0|#000)/i

[Killed] Regex
src/lib/designGuard.ts:154:22
 const ELEVATION = /elevation=\{\s*(?!0\s*\})/
 const NUMERIC_SHADOW = /boxShadow\s*:\s*[1-9]/
 /** Ein Schatten mit schwarzem Anteil, auch als Zeichenkette geschrieben. */
-const BLACK_SHADOW = /boxShadow[^,}\n]*(?:rgba?\(\s*0\s*,\s*0\s*,\s*0|#000)/i
+const BLACK_SHADOW = /boxShadow[^,}\n]*(?:rgba?\(\s0\s*,\s*0\s*,\s*0|#000)/i
 
 /**
killedBy: scanSource: was gemeldet wird meldet einen schwarzen Schatten auch als Zeichenkette
statusReason: expected [] to deeply equal [ 'boxShadow' ]

[Killed] Regex
src/lib/designGuard.ts:154:22
 const ELEVATION = /elevation=\{\s*(?!0\s*\})/
 const NUMERIC_SHADOW = /boxShadow\s*:\s*[1-9]/
 /** Ein Schatten mit schwarzem Anteil, auch als Zeichenkette geschrieben. */
-const BLACK_SHADOW = /boxShadow[^,}\n]*(?:rgba?\(\s*0\s*,\s*0\s*,\s*0|#000)/i
+const BLACK_SHADOW = /boxShadow[^,}\n]*(?:rgba?\(\s*0\s*,\s0\s*,\s*0|#000)/i
 
 /**
killedBy: scanSource: was gemeldet wird meldet einen schwarzen Schatten auch als Zeichenkette
statusReason: expected [] to deeply equal [ 'boxShadow' ]

[Killed] BlockStatement
src/lib/designGuard.ts:160:77
  * Verstoesse einer Quelldatei. Hex-Literale zaehlen nur innerhalb eines Style-Ausdrucks — sonst
  * schluege `placeholder="#345"` an, eine Kartennummer und keine Farbe.
  */
-export function scanSource(file: string, source: string): DesignViolation[] {
-  const violations: DesignViolation[] = []
-  let carry = 0
-
-  stripComments(source)
-    .split('\n')
-    .forEach((line, index) => {
-      const { spans, carry: next } = styleSpans(line, carry)
-      carry = next
-
-      const push = (rule: DesignRule) => violations.push({ file, line: index + 1, rule, text: line.trim() })
-      const styleText = spans.map(([from, to]) => line.slice(from, to)).join(' ')
-
-      if (HEX.test(styleText)) push('hex')
-      if (ELEVATION.test(line)) push('elevation')
-      if (NUMERIC_SHADOW.test(line) || BLACK_SHADOW.test(line)) push('boxShadow')
-    })
-
-  return violations
-}
+export function scanSource(file: string, source: string): DesignViolation[] {}
 
 const covers = (violation: DesignViolation, entry: DesignAllowance) =>
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: Cannot read properties of undefined (reading 'map')
