[Killed] BlockStatement
src/lib/designGuard.ts:166:31
 
   stripComments(source)
     .split('\n')
-    .forEach((line, index) => {
-      const { spans, carry: next } = styleSpans(line, carry)
-      carry = next
-
-      const push = (rule: DesignRule) => violations.push({ file, line: index + 1, rule, text: line.trim() })
-      const styleText = spans.map(([from, to]) => line.slice(from, to)).join(' ')
-
-      if (HEX.test(styleText)) push('hex')
-      if (ELEVATION.test(line)) push('elevation')
-      if (NUMERIC_SHADOW.test(line) || BLACK_SHADOW.test(line)) push('boxShadow')
-    })
+    .forEach((line, index) => {})
 
   return violations
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] ArrowFunction
src/lib/designGuard.ts:170:20
       const { spans, carry: next } = styleSpans(line, carry)
       carry = next
 
-      const push = (rule: DesignRule) => violations.push({ file, line: index + 1, rule, text: line.trim() })
+      const push = () => undefined
       const styleText = spans.map(([from, to]) => line.slice(from, to)).join(' ')
 
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Survived] ArithmeticOperator
src/lib/designGuard.ts:170:72
       const { spans, carry: next } = styleSpans(line, carry)
       carry = next
 
-      const push = (rule: DesignRule) => violations.push({ file, line: index + 1, rule, text: line.trim() })
+      const push = (rule: DesignRule) => violations.push({ file, line: index - 1, rule, text: line.trim() })
       const styleText = spans.map(([from, to]) => line.slice(from, to)).join(' ')
 

[Killed] ArrowFunction
src/lib/designGuard.ts:171:35
       carry = next
 
       const push = (rule: DesignRule) => violations.push({ file, line: index + 1, rule, text: line.trim() })
-      const styleText = spans.map(([from, to]) => line.slice(from, to)).join(' ')
+      const styleText = spans.map(() => undefined).join(' ')
 
       if (HEX.test(styleText)) push('hex')
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [ 'boxShadow', 'elevation' ] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Survived] MethodExpression
src/lib/designGuard.ts:171:51
       carry = next
 
       const push = (rule: DesignRule) => violations.push({ file, line: index + 1, rule, text: line.trim() })
-      const styleText = spans.map(([from, to]) => line.slice(from, to)).join(' ')
+      const styleText = spans.map(([from, to]) => line).join(' ')
 
       if (HEX.test(styleText)) push('hex')

[Killed] ConditionalExpression
src/lib/designGuard.ts:173:11
       const push = (rule: DesignRule) => violations.push({ file, line: index + 1, rule, text: line.trim() })
       const styleText = spans.map(([from, to]) => line.slice(from, to)).join(' ')
 
-      if (HEX.test(styleText)) push('hex')
+      if (false) push('hex')
       if (ELEVATION.test(line)) push('elevation')
       if (NUMERIC_SHADOW.test(line) || BLACK_SHADOW.test(line)) push('boxShadow')
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [ 'boxShadow', 'elevation' ] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] ConditionalExpression
src/lib/designGuard.ts:173:11
       const push = (rule: DesignRule) => violations.push({ file, line: index + 1, rule, text: line.trim() })
       const styleText = spans.map(([from, to]) => line.slice(from, to)).join(' ')
 
-      if (HEX.test(styleText)) push('hex')
+      if (true) push('hex')
       if (ELEVATION.test(line)) push('elevation')
       if (NUMERIC_SHADOW.test(line) || BLACK_SHADOW.test(line)) push('boxShadow')
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [ 'boxShadow', 'elevation', …(3) ] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] ConditionalExpression
src/lib/designGuard.ts:174:11
       const styleText = spans.map(([from, to]) => line.slice(from, to)).join(' ')
 
       if (HEX.test(styleText)) push('hex')
-      if (ELEVATION.test(line)) push('elevation')
+      if (false) push('elevation')
       if (NUMERIC_SHADOW.test(line) || BLACK_SHADOW.test(line)) push('boxShadow')
     })
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [ 'boxShadow', 'hex' ] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] ConditionalExpression
src/lib/designGuard.ts:174:11
       const styleText = spans.map(([from, to]) => line.slice(from, to)).join(' ')
 
       if (HEX.test(styleText)) push('hex')
-      if (ELEVATION.test(line)) push('elevation')
+      if (true) push('elevation')
       if (NUMERIC_SHADOW.test(line) || BLACK_SHADOW.test(line)) push('boxShadow')
     })
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [ 'boxShadow', 'elevation', …(3) ] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] LogicalOperator
src/lib/designGuard.ts:175:11
 
       if (HEX.test(styleText)) push('hex')
       if (ELEVATION.test(line)) push('elevation')
-      if (NUMERIC_SHADOW.test(line) || BLACK_SHADOW.test(line)) push('boxShadow')
+      if (NUMERIC_SHADOW.test(line) && BLACK_SHADOW.test(line)) push('boxShadow')
     })
 
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [ 'elevation', 'hex' ] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] ConditionalExpression
src/lib/designGuard.ts:175:11
 
       if (HEX.test(styleText)) push('hex')
       if (ELEVATION.test(line)) push('elevation')
-      if (NUMERIC_SHADOW.test(line) || BLACK_SHADOW.test(line)) push('boxShadow')
+      if (true) push('boxShadow')
     })
 
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [ 'boxShadow', 'boxShadow', …(3) ] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] ArrowFunction
src/lib/designGuard.ts:181:16
   return violations
 }
 
-const covers = (violation: DesignViolation, entry: DesignAllowance) =>
-  entry.file === violation.file && entry.rule === violation.rule
+const covers = () => undefined
 
 /** Verstoesse, die keine Ausnahme deckt — sie machen die Leitplanke rot. */
killedBy: Ausnahmeliste laesst genau die gedeckten Verstoesse durch
statusReason: expected [ { …(4) }, { …(4) } ] to deeply equal [ Array(1) ]

[Killed] ConditionalExpression
src/lib/designGuard.ts:182:3
 }
 
 const covers = (violation: DesignViolation, entry: DesignAllowance) =>
-  entry.file === violation.file && entry.rule === violation.rule
+  true
 
 /** Verstoesse, die keine Ausnahme deckt — sie machen die Leitplanke rot. */
killedBy: Ausnahmeliste laesst genau die gedeckten Verstoesse durch
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] EqualityOperator
src/lib/designGuard.ts:182:3
 }
 
 const covers = (violation: DesignViolation, entry: DesignAllowance) =>
-  entry.file === violation.file && entry.rule === violation.rule
+  entry.file !== violation.file && entry.rule === violation.rule
 
 /** Verstoesse, die keine Ausnahme deckt — sie machen die Leitplanke rot. */
killedBy: Ausnahmeliste laesst genau die gedeckten Verstoesse durch
statusReason: expected [ { …(4) }, { …(4) } ] to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/lib/designGuard.ts:188:22
 export function unmatchedViolations(
   violations: readonly DesignViolation[],
   allowlist: readonly DesignAllowance[],
-): DesignViolation[] {
-  return violations.filter((violation) => !allowlist.some((entry) => covers(violation, entry)))
-}
+): DesignViolation[] {}
 
 /**
killedBy: Ausnahmeliste laesst genau die gedeckten Verstoesse durch
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] MethodExpression
src/lib/designGuard.ts:189:44
   violations: readonly DesignViolation[],
   allowlist: readonly DesignAllowance[],
 ): DesignViolation[] {
-  return violations.filter((violation) => !allowlist.some((entry) => covers(violation, entry)))
+  return violations.filter((violation) => !allowlist.every(entry => covers(violation, entry)))
 }
 
killedBy: Ausnahmeliste kommt mit einer leeren Liste in beide Richtungen zurecht
statusReason: expected [] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] ArrowFunction
src/lib/designGuard.ts:189:28
   violations: readonly DesignViolation[],
   allowlist: readonly DesignAllowance[],
 ): DesignViolation[] {
-  return violations.filter((violation) => !allowlist.some((entry) => covers(violation, entry)))
+  return violations.filter(() => undefined)
 }
 
killedBy: Ausnahmeliste laesst genau die gedeckten Verstoesse durch
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/lib/designGuard.ts:200:22
 export function deadAllowlistEntries(
   violations: readonly DesignViolation[],
   allowlist: readonly DesignAllowance[],
-): DesignAllowance[] {
-  return allowlist.filter((entry) => !violations.some((violation) => covers(violation, entry)))
-}
+): DesignAllowance[] {}
 
killedBy: Ausnahmeliste meldet einen Eintrag, der keinen Verstoss mehr deckt
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] ArrowFunction
src/lib/designGuard.ts:201:27
   violations: readonly DesignViolation[],
   allowlist: readonly DesignAllowance[],
 ): DesignAllowance[] {
-  return allowlist.filter((entry) => !violations.some((violation) => covers(violation, entry)))
+  return allowlist.filter(() => undefined)
 }
 
killedBy: Ausnahmeliste meldet einen Eintrag, der keinen Verstoss mehr deckt
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] MethodExpression
src/lib/designGuard.ts:201:10
   violations: readonly DesignViolation[],
   allowlist: readonly DesignAllowance[],
 ): DesignAllowance[] {
-  return allowlist.filter((entry) => !violations.some((violation) => covers(violation, entry)))
+  return allowlist
 }
 
killedBy: Ausnahmeliste meldet einen Eintrag, der keinen Verstoss mehr deckt
statusReason: expected [ { …(3) }, { …(3) } ] to deeply equal [ Array(1) ]
