[Killed] BlockStatement
src/lib/dueDate.ts:7:103
  */
 
 /** Ob eine Karte überfällig ist: Fälligkeit in der Vergangenheit und nicht in einer Done-Spalte. */
-export function isOverdue(dueDate: string | null, isDone: boolean, now: number = Date.now()): boolean {
-  if (dueDate == null || isDone) {
-    return false
-  }
-  return new Date(dueDate).getTime() < now
-}
+export function isOverdue(dueDate: string | null, isDone: boolean, now: number = Date.now()): boolean {}
 
 /** Fälligkeitsdatum menschenlesbar (de-DE, nur Datum). */
killedBy: CardDetailModal zeigt ein überfälliges Datum hervorgehoben im Lesemodus
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  überfällig
Received:
  Fällig am 1.1.2020

[Killed] EqualityOperator
src/lib/dueDate.ts:8:7
 
 /** Ob eine Karte überfällig ist: Fälligkeit in der Vergangenheit und nicht in einer Done-Spalte. */
 export function isOverdue(dueDate: string | null, isDone: boolean, now: number = Date.now()): boolean {
-  if (dueDate == null || isDone) {
+  if (dueDate != null || isDone) {
     return false
   }
killedBy: CardDetailModal zeigt ein überfälliges Datum hervorgehoben im Lesemodus
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  überfällig
Received:
  Fällig am 1.1.2020

[Killed] ConditionalExpression
src/lib/dueDate.ts:8:7
 
 /** Ob eine Karte überfällig ist: Fälligkeit in der Vergangenheit und nicht in einer Done-Spalte. */
 export function isOverdue(dueDate: string | null, isDone: boolean, now: number = Date.now()): boolean {
-  if (dueDate == null || isDone) {
+  if (true) {
     return false
   }
killedBy: CardDetailModal zeigt ein überfälliges Datum hervorgehoben im Lesemodus
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  überfällig
Received:
  Fällig am 1.1.2020

[Killed] BooleanLiteral
src/lib/dueDate.ts:9:12
 /** Ob eine Karte überfällig ist: Fälligkeit in der Vergangenheit und nicht in einer Done-Spalte. */
 export function isOverdue(dueDate: string | null, isDone: boolean, now: number = Date.now()): boolean {
   if (dueDate == null || isDone) {
-    return false
+    return true
   }
   return new Date(dueDate).getTime() < now
killedBy: isOverdue ist false bei Done-Spalte trotz Vergangenheit
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/dueDate.ts:11:10
   if (dueDate == null || isDone) {
     return false
   }
-  return new Date(dueDate).getTime() < now
+  return false
 }
 
killedBy: isOverdue ist true bei Datum in der Vergangenheit und nicht Done
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/dueDate.ts:11:10
   if (dueDate == null || isDone) {
     return false
   }
-  return new Date(dueDate).getTime() < now
+  return new Date(dueDate).getTime() >= now
 }
 
killedBy: isOverdue ist true bei Datum in der Vergangenheit und nicht Done
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/dueDate.ts:15:56
 }
 
 /** Fälligkeitsdatum menschenlesbar (de-DE, nur Datum). */
-export function formatDueDate(dueDate: string): string {
-  return new Date(dueDate).toLocaleDateString('de-DE')
-}
+export function formatDueDate(dueDate: string): string {}
 
 /** Wandelt eine `YYYY-MM-DD`-Eingabe in einen ISO-Zeitstempel (Mitternacht UTC) oder `null`. */
killedBy: formatDueDate formatiert als deutsches Datum
statusReason: expected undefined to be '1.8.2026' // Object.is equality

[Killed] BlockStatement
src/lib/dueDate.ts:20:61
 }
 
 /** Wandelt eine `YYYY-MM-DD`-Eingabe in einen ISO-Zeitstempel (Mitternacht UTC) oder `null`. */
-export function dueInputToIso(value: string): string | null {
-  return value ? `${value}T00:00:00Z` : null
-}
+export function dueInputToIso(value: string): string | null {}
 
killedBy: dueInputToIso wandelt YYYY-MM-DD in Mitternacht-UTC-ISO
statusReason: expected undefined to be '2026-08-01T00:00:00Z' // Object.is equality
