[Killed] BlockStatement
src/lib/epicTiles.ts:36:57
  * möglich durch den Done-Retention-Job oder eine Ladelücke; als Arbeitspaket gezählt zeigte die
  * Kachel eine Karte an, die niemand öffnen kann.
  */
-function memberCards(epic: Epic, cards: Card[]): Card[] {
-  const byNumber = new Map(cards.map((c) => [c.number, c]))
-  return epic.memberNumbers.map((n) => byNumber.get(n)).filter((c): c is Card => c !== undefined)
-}
+function memberCards(epic: Epic, cards: Card[]): Card[] {}
 
 /**
killedBy: EpicsPage listet Epics mit Kürzel und Fortschritt
statusReason: Unable to find an element with the text: Auth. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
src/lib/epicTiles.ts:37:38
  * Kachel eine Karte an, die niemand öffnen kann.
  */
 function memberCards(epic: Epic, cards: Card[]): Card[] {
-  const byNumber = new Map(cards.map((c) => [c.number, c]))
+  const byNumber = new Map(cards.map(() => undefined))
   return epic.memberNumbers.map((n) => byNumber.get(n)).filter((c): c is Card => c !== undefined)
 }
killedBy: EpicsPage öffnet ein Epic per Klick im Detail-Modal mit seinen Kind-Karten
statusReason: Unable to find an element with the text: Auth. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] MethodExpression
src/lib/epicTiles.ts:38:10
  */
 function memberCards(epic: Epic, cards: Card[]): Card[] {
   const byNumber = new Map(cards.map((c) => [c.number, c]))
-  return epic.memberNumbers.map((n) => byNumber.get(n)).filter((c): c is Card => c !== undefined)
+  return epic.memberNumbers.map(n => byNumber.get(n))
 }
 
killedBy: EpicsPage trägt keine Aufklapp-Schaltfläche mehr
statusReason: Unable to find an element with the text: Auth. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style=""
>
  <div />
</body>

[Killed] ConditionalExpression
src/lib/epicTiles.ts:38:82
  */
 function memberCards(epic: Epic, cards: Card[]): Card[] {
   const byNumber = new Map(cards.map((c) => [c.number, c]))
-  return epic.memberNumbers.map((n) => byNumber.get(n)).filter((c): c is Card => c !== undefined)
+  return epic.memberNumbers.map((n) => byNumber.get(n)).filter((c): c is Card => false)
 }
 
killedBy: countKinds zählt fachliche Anforderungen, Pläne und Arbeitspakete getrennt
statusReason: expected { requirements: +0, plans: +0, …(1) } to deeply equal { requirements: 1, plans: 1, …(1) }

[Killed] BlockStatement
src/lib/epicTiles.ts:52:67
  * Manne, 2026-08-31): Eine eingeplante Idee ist faktisch ein Arbeitspaket, und Ideen im Pool
  * erscheinen ohnehin nicht, sie tragen `ideaStored`.
  */
-export function countKinds(epic: Epic, cards: Card[]): KindCounts {
-  const counts: KindCounts = { requirements: 0, plans: 0, workItems: 0 }
-  for (const card of memberCards(epic, cards)) {
-    if (card.title.startsWith('[Fachlich]')) {
-      counts.requirements++
-    } else if (card.title.startsWith('[Plan]')) {
-      counts.plans++
-    } else {
-      counts.workItems++
-    }
-  }
-  return counts
-}
+export function countKinds(epic: Epic, cards: Card[]): KindCounts {}
 
 /**
killedBy: countKinds zählt fachliche Anforderungen, Pläne und Arbeitspakete getrennt
statusReason: expected undefined to deeply equal { requirements: 1, plans: 1, …(1) }

[Killed] BlockStatement
src/lib/epicTiles.ts:54:48
  */
 export function countKinds(epic: Epic, cards: Card[]): KindCounts {
   const counts: KindCounts = { requirements: 0, plans: 0, workItems: 0 }
-  for (const card of memberCards(epic, cards)) {
-    if (card.title.startsWith('[Fachlich]')) {
-      counts.requirements++
-    } else if (card.title.startsWith('[Plan]')) {
-      counts.plans++
-    } else {
-      counts.workItems++
-    }
-  }
+  for (const card of memberCards(epic, cards)) {}
   return counts
 }
killedBy: countKinds zählt fachliche Anforderungen, Pläne und Arbeitspakete getrennt
statusReason: expected { requirements: +0, plans: +0, …(1) } to deeply equal { requirements: 1, plans: 1, …(1) }

[Killed] MethodExpression
src/lib/epicTiles.ts:55:9
 export function countKinds(epic: Epic, cards: Card[]): KindCounts {
   const counts: KindCounts = { requirements: 0, plans: 0, workItems: 0 }
   for (const card of memberCards(epic, cards)) {
-    if (card.title.startsWith('[Fachlich]')) {
+    if (card.title.endsWith('[Fachlich]')) {
       counts.requirements++
     } else if (card.title.startsWith('[Plan]')) {
killedBy: countKinds zählt fachliche Anforderungen, Pläne und Arbeitspakete getrennt
statusReason: expected { requirements: +0, plans: 1, …(1) } to deeply equal { requirements: 1, plans: 1, …(1) }

[Killed] ConditionalExpression
src/lib/epicTiles.ts:55:9
 export function countKinds(epic: Epic, cards: Card[]): KindCounts {
   const counts: KindCounts = { requirements: 0, plans: 0, workItems: 0 }
   for (const card of memberCards(epic, cards)) {
-    if (card.title.startsWith('[Fachlich]')) {
+    if (false) {
       counts.requirements++
     } else if (card.title.startsWith('[Plan]')) {
killedBy: EpicsPage zeigt die Zusammensetzung nach Art getrennt
statusReason: Unable to find an element with the text: 1 Anforderung. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] UpdateOperator
src/lib/epicTiles.ts:56:7
   const counts: KindCounts = { requirements: 0, plans: 0, workItems: 0 }
   for (const card of memberCards(epic, cards)) {
     if (card.title.startsWith('[Fachlich]')) {
-      counts.requirements++
+      counts.requirements--
     } else if (card.title.startsWith('[Plan]')) {
       counts.plans++
killedBy: countKinds zählt fachliche Anforderungen, Pläne und Arbeitspakete getrennt
statusReason: expected { requirements: -1, plans: 1, …(1) } to deeply equal { requirements: 1, plans: 1, …(1) }

[Killed] ConditionalExpression
src/lib/epicTiles.ts:57:16
   for (const card of memberCards(epic, cards)) {
     if (card.title.startsWith('[Fachlich]')) {
       counts.requirements++
-    } else if (card.title.startsWith('[Plan]')) {
+    } else if (false) {
       counts.plans++
     } else {
killedBy: EpicsPage zeigt die Zusammensetzung nach Art getrennt
statusReason: Unable to find an element with the text: 2 Pläne. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] MethodExpression
src/lib/epicTiles.ts:57:16
   for (const card of memberCards(epic, cards)) {
     if (card.title.startsWith('[Fachlich]')) {
       counts.requirements++
-    } else if (card.title.startsWith('[Plan]')) {
+    } else if (card.title.endsWith('[Plan]')) {
       counts.plans++
     } else {
killedBy: countKinds zählt fachliche Anforderungen, Pläne und Arbeitspakete getrennt
statusReason: expected { requirements: 1, plans: +0, …(1) } to deeply equal { requirements: 1, plans: 1, …(1) }

[Killed] UpdateOperator
src/lib/epicTiles.ts:58:7
     if (card.title.startsWith('[Fachlich]')) {
       counts.requirements++
     } else if (card.title.startsWith('[Plan]')) {
-      counts.plans++
+      counts.plans--
     } else {
       counts.workItems++
killedBy: countKinds zählt fachliche Anforderungen, Pläne und Arbeitspakete getrennt
statusReason: expected { requirements: 1, plans: -1, …(1) } to deeply equal { requirements: 1, plans: 1, …(1) }

[Killed] BlockStatement
src/lib/epicTiles.ts:59:12
       counts.requirements++
     } else if (card.title.startsWith('[Plan]')) {
       counts.plans++
-    } else {
-      counts.workItems++
-    }
+    } else {}
   }
   return counts
killedBy: EpicsPage zeigt die Zusammensetzung nach Art getrennt
statusReason: Unable to find an element with the text: 5 Arbeitspakete. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] UpdateOperator
src/lib/epicTiles.ts:60:7
     } else if (card.title.startsWith('[Plan]')) {
       counts.plans++
     } else {
-      counts.workItems++
+      counts.workItems--
     }
   }
killedBy: EpicsPage zeigt die Zusammensetzung nach Art getrennt
statusReason: Unable to find an element with the text: 5 Arbeitspakete. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] BlockStatement
src/lib/epicTiles.ts:75:84
  * Zustand, sondern über die Label-Verwaltung. Die Reihenfolge folgt der Label-ID aufsteigend,
  * dieselbe Ordnung wie im Herkunftsbaum (#661).
  */
-export function aggregateMarks(epic: Epic, cards: Card[], labels: Label[]): Mark[] {
-  const counted = labels.filter((l) => l.countOnEpicTile).sort((a, b) => a.id - b.id)
-  const members = memberCards(epic, cards)
-  return counted
-    .map((label) => ({
-      name: label.name,
-      color: label.color,
-      count: members.filter((c) => c.labels.includes(label.id)).length,
-    }))
-    .filter((mark) => mark.count > 0)
-}
+export function aggregateMarks(epic: Epic, cards: Card[], labels: Label[]): Mark[] {}
 
 /** Karten des Vorhabens mit mindestens einer gezählten Marke — je Karte höchstens einmal. */
killedBy: aggregateMarks zählt eine Karte bei jedem ihrer gezählten Labels
statusReason: expected undefined to deeply equal [ { name: 'bereit', …(2) }, …(1) ]

[Killed] ArrowFunction
src/lib/epicTiles.ts:76:33
  * dieselbe Ordnung wie im Herkunftsbaum (#661).
  */
 export function aggregateMarks(epic: Epic, cards: Card[], labels: Label[]): Mark[] {
-  const counted = labels.filter((l) => l.countOnEpicTile).sort((a, b) => a.id - b.id)
+  const counted = labels.filter(() => undefined).sort((a, b) => a.id - b.id)
   const members = memberCards(epic, cards)
   return counted
killedBy: EpicsPage zeigt je gezähltem Label eine Marke mit Anzahl als Text
statusReason: Unable to find an element with the text: stockt 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <div

[Killed] MethodExpression
src/lib/epicTiles.ts:76:19
  * dieselbe Ordnung wie im Herkunftsbaum (#661).
  */
 export function aggregateMarks(epic: Epic, cards: Card[], labels: Label[]): Mark[] {
-  const counted = labels.filter((l) => l.countOnEpicTile).sort((a, b) => a.id - b.id)
+  const counted = labels.sort((a, b) => a.id - b.id)
   const members = memberCards(epic, cards)
   return counted
killedBy: aggregateMarks lässt ein Label mit countOnEpicTile === false weg
statusReason: expected [ { name: 'bereit', …(2) }, …(1) ] to deeply equal [ { name: 'bereit', …(2) } ]

[Killed] MethodExpression
src/lib/epicTiles.ts:78:10
 export function aggregateMarks(epic: Epic, cards: Card[], labels: Label[]): Mark[] {
   const counted = labels.filter((l) => l.countOnEpicTile).sort((a, b) => a.id - b.id)
   const members = memberCards(epic, cards)
-  return counted
-    .map((label) => ({
-      name: label.name,
-      color: label.color,
-      count: members.filter((c) => c.labels.includes(label.id)).length,
-    }))
-    .filter((mark) => mark.count > 0)
+  return counted.map(label => ({
+  name: label.name,
+  color: label.color,
+  count: members.filter(c => c.labels.includes(label.id)).length
+}))
 }
 
killedBy: aggregateMarks lässt ein Label mit countOnEpicTile === false weg
statusReason: expected [ { name: 'bereit', …(2) }, …(1) ] to deeply equal [ { name: 'bereit', …(2) } ]

[Killed] ArrowFunction
src/lib/epicTiles.ts:79:10
   const counted = labels.filter((l) => l.countOnEpicTile).sort((a, b) => a.id - b.id)
   const members = memberCards(epic, cards)
   return counted
-    .map((label) => ({
-      name: label.name,
-      color: label.color,
-      count: members.filter((c) => c.labels.includes(label.id)).length,
-    }))
+    .map(() => undefined)
     .filter((mark) => mark.count > 0)
 }
killedBy: EpicsPage zeigt je gezähltem Label eine Marke mit Anzahl als Text
statusReason: Unable to find an element with the text: stockt 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style=""
>
  <div />
</body>

[Killed] ArrowFunction
src/lib/epicTiles.ts:82:29
     .map((label) => ({
       name: label.name,
       color: label.color,
-      count: members.filter((c) => c.labels.includes(label.id)).length,
+      count: members.filter(() => undefined).length,
     }))
     .filter((mark) => mark.count > 0)
killedBy: EpicsPage zeigt je gezähltem Label eine Marke mit Anzahl als Text
statusReason: Unable to find an element with the text: stockt 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] MethodExpression
src/lib/epicTiles.ts:82:14
     .map((label) => ({
       name: label.name,
       color: label.color,
-      count: members.filter((c) => c.labels.includes(label.id)).length,
+      count: members.length,
     }))
     .filter((mark) => mark.count > 0)
killedBy: aggregateMarks lässt ein Label mit countOnEpicTile === false weg
statusReason: expected [ { name: 'bereit', …(2) }, …(1) ] to deeply equal [ { name: 'bereit', …(2) } ]

[Killed] EqualityOperator
src/lib/epicTiles.ts:84:23
       color: label.color,
       count: members.filter((c) => c.labels.includes(label.id)).length,
     }))
-    .filter((mark) => mark.count > 0)
+    .filter((mark) => mark.count >= 0)
 }
 
killedBy: aggregateMarks lässt ein Label mit countOnEpicTile === false weg
statusReason: expected [ { name: 'bereit', …(2) }, …(1) ] to deeply equal [ { name: 'bereit', …(2) } ]

[Killed] ConditionalExpression
src/lib/epicTiles.ts:84:23
       color: label.color,
       count: members.filter((c) => c.labels.includes(label.id)).length,
     }))
-    .filter((mark) => mark.count > 0)
+    .filter((mark) => false)
 }
 
killedBy: aggregateMarks zählt eine Karte bei jedem ihrer gezählten Labels
statusReason: expected [] to deeply equal [ { name: 'bereit', …(2) }, …(1) ]

[Killed] BlockStatement
src/lib/epicTiles.ts:88:78
 }
 
 /** Karten des Vorhabens mit mindestens einer gezählten Marke — je Karte höchstens einmal. */
-function handlungsbedarf(epic: Epic, cards: Card[], labels: Label[]): number {
-  const countedIds = new Set(labels.filter((l) => l.countOnEpicTile).map((l) => l.id))
-  return memberCards(epic, cards).filter((c) => c.labels.some((id) => countedIds.has(id))).length
-}
+function handlungsbedarf(epic: Epic, cards: Card[], labels: Label[]): number {}
 
 /**
killedBy: sortEpics sortiert absteigend nach Karten mit mindestens einer gezählten Marke
statusReason: expected [ 1, 2 ] to deeply equal [ 2, 1 ]

[Killed] ArrowFunction
src/lib/epicTiles.ts:89:74
 
 /** Karten des Vorhabens mit mindestens einer gezählten Marke — je Karte höchstens einmal. */
 function handlungsbedarf(epic: Epic, cards: Card[], labels: Label[]): number {
-  const countedIds = new Set(labels.filter((l) => l.countOnEpicTile).map((l) => l.id))
+  const countedIds = new Set(labels.filter((l) => l.countOnEpicTile).map(() => undefined))
   return memberCards(epic, cards).filter((c) => c.labels.some((id) => countedIds.has(id))).length
 }
killedBy: sortEpics sortiert absteigend nach Karten mit mindestens einer gezählten Marke
statusReason: expected [ 1, 2 ] to deeply equal [ 2, 1 ]

[Killed] ArrowFunction
src/lib/epicTiles.ts:89:44
 
 /** Karten des Vorhabens mit mindestens einer gezählten Marke — je Karte höchstens einmal. */
 function handlungsbedarf(epic: Epic, cards: Card[], labels: Label[]): number {
-  const countedIds = new Set(labels.filter((l) => l.countOnEpicTile).map((l) => l.id))
+  const countedIds = new Set(labels.filter(() => undefined).map((l) => l.id))
   return memberCards(epic, cards).filter((c) => c.labels.some((id) => countedIds.has(id))).length
 }
killedBy: sortEpics sortiert absteigend nach Karten mit mindestens einer gezählten Marke
statusReason: expected [ 1, 2 ] to deeply equal [ 2, 1 ]

[Killed] ArrowFunction
src/lib/epicTiles.ts:90:63
 /** Karten des Vorhabens mit mindestens einer gezählten Marke — je Karte höchstens einmal. */
 function handlungsbedarf(epic: Epic, cards: Card[], labels: Label[]): number {
   const countedIds = new Set(labels.filter((l) => l.countOnEpicTile).map((l) => l.id))
-  return memberCards(epic, cards).filter((c) => c.labels.some((id) => countedIds.has(id))).length
+  return memberCards(epic, cards).filter((c) => c.labels.some(() => undefined)).length
 }
 
killedBy: sortEpics sortiert absteigend nach Karten mit mindestens einer gezählten Marke
statusReason: expected [ 1, 2 ] to deeply equal [ 2, 1 ]

[Killed] ArrowFunction
src/lib/epicTiles.ts:90:42
 /** Karten des Vorhabens mit mindestens einer gezählten Marke — je Karte höchstens einmal. */
 function handlungsbedarf(epic: Epic, cards: Card[], labels: Label[]): number {
   const countedIds = new Set(labels.filter((l) => l.countOnEpicTile).map((l) => l.id))
-  return memberCards(epic, cards).filter((c) => c.labels.some((id) => countedIds.has(id))).length
+  return memberCards(epic, cards).filter(() => undefined).length
 }
 
killedBy: sortEpics sortiert absteigend nach Karten mit mindestens einer gezählten Marke
statusReason: expected [ 1, 2 ] to deeply equal [ 2, 1 ]

[Killed] BlockStatement
src/lib/epicTiles.ts:100:37
  * Leer heißt `total === 0` **und** ohne Anforderung: Ein Vorhaben, das eine Anforderung trägt, aber
  * noch keine Karten hat, ist eröffnet und gehört nicht ans Ende.
  */
-function gruppe(epic: Epic): number {
-  if (epic.total === 0 && epic.requirementCardNumber === null) return 2
-  if (epic.done === epic.total && epic.total > 0) return 1
-  return 0
-}
+function gruppe(epic: Epic): number {}
 
 /**
killedBy: EpicsPage ordnet die Kacheln nach Handlungsbedarf, leere ans Ende
statusReason: expected [ 'vorhaben-kachel-1', …(2) ] to deeply equal [ 'vorhaben-kachel-3', …(2) ]

[Killed] ConditionalExpression
src/lib/epicTiles.ts:101:7
  * noch keine Karten hat, ist eröffnet und gehört nicht ans Ende.
  */
 function gruppe(epic: Epic): number {
-  if (epic.total === 0 && epic.requirementCardNumber === null) return 2
+  if (true) return 2
   if (epic.done === epic.total && epic.total > 0) return 1
   return 0
killedBy: sortEpics stellt ein abgeschlossenes Vorhaben hinter die unfertigen
statusReason: expected [ 1, 2 ] to deeply equal [ 2, 1 ]

[Killed] ConditionalExpression
src/lib/epicTiles.ts:101:7
  * noch keine Karten hat, ist eröffnet und gehört nicht ans Ende.
  */
 function gruppe(epic: Epic): number {
-  if (epic.total === 0 && epic.requirementCardNumber === null) return 2
+  if (true && epic.requirementCardNumber === null) return 2
   if (epic.done === epic.total && epic.total > 0) return 1
   return 0
killedBy: sortEpics stellt ein abgeschlossenes Vorhaben hinter die unfertigen
statusReason: expected [ 1, 2 ] to deeply equal [ 2, 1 ]

[Killed] EqualityOperator
src/lib/epicTiles.ts:102:35
  */
 function gruppe(epic: Epic): number {
   if (epic.total === 0 && epic.requirementCardNumber === null) return 2
-  if (epic.done === epic.total && epic.total > 0) return 1
+  if (epic.done === epic.total && epic.total <= 0) return 1
   return 0
 }
killedBy: sortEpics stellt ein abgeschlossenes Vorhaben hinter die unfertigen
statusReason: expected [ 1, 2 ] to deeply equal [ 2, 1 ]

[Killed] ConditionalExpression
src/lib/epicTiles.ts:102:7
  */
 function gruppe(epic: Epic): number {
   if (epic.total === 0 && epic.requirementCardNumber === null) return 2
-  if (epic.done === epic.total && epic.total > 0) return 1
+  if (true && epic.total > 0) return 1
   return 0
 }
killedBy: sortEpics stellt ein abgeschlossenes Vorhaben hinter die unfertigen
statusReason: expected [ 1, 2 ] to deeply equal [ 2, 1 ]

[Killed] BlockStatement
src/lib/epicTiles.ts:117:82
  *
  * Reine Funktion: Das Eingabe-Array bleibt unverändert.
  */
-export function sortEpics(epics: Epic[], cards: Card[], labels: Label[]): Epic[] {
-  return [...epics].sort((a, b) => {
-    const gruppenUnterschied = gruppe(a) - gruppe(b)
-    if (gruppenUnterschied !== 0) return gruppenUnterschied
-    const bedarfUnterschied = handlungsbedarf(b, cards, labels) - handlungsbedarf(a, cards, labels)
-    if (bedarfUnterschied !== 0) return bedarfUnterschied
-    return epicShortcode(a.title, a.shortcode).localeCompare(epicShortcode(b.title, b.shortcode))
-  })
-}
+export function sortEpics(epics: Epic[], cards: Card[], labels: Label[]): Epic[] {}
 
 /**
killedBy: sortEpics sortiert absteigend nach Karten mit mindestens einer gezählten Marke
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/lib/epicTiles.ts:118:36
  * Reine Funktion: Das Eingabe-Array bleibt unverändert.
  */
 export function sortEpics(epics: Epic[], cards: Card[], labels: Label[]): Epic[] {
-  return [...epics].sort((a, b) => {
-    const gruppenUnterschied = gruppe(a) - gruppe(b)
-    if (gruppenUnterschied !== 0) return gruppenUnterschied
-    const bedarfUnterschied = handlungsbedarf(b, cards, labels) - handlungsbedarf(a, cards, labels)
-    if (bedarfUnterschied !== 0) return bedarfUnterschied
-    return epicShortcode(a.title, a.shortcode).localeCompare(epicShortcode(b.title, b.shortcode))
-  })
+  return [...epics].sort((a, b) => {})
 }
 
killedBy: EpicsPage ordnet die Kacheln nach Handlungsbedarf, leere ans Ende
statusReason: expected [ 'vorhaben-kachel-1', …(2) ] to deeply equal [ 'vorhaben-kachel-3', …(2) ]

[Killed] MethodExpression
src/lib/epicTiles.ts:118:10
  * Reine Funktion: Das Eingabe-Array bleibt unverändert.
  */
 export function sortEpics(epics: Epic[], cards: Card[], labels: Label[]): Epic[] {
-  return [...epics].sort((a, b) => {
-    const gruppenUnterschied = gruppe(a) - gruppe(b)
-    if (gruppenUnterschied !== 0) return gruppenUnterschied
-    const bedarfUnterschied = handlungsbedarf(b, cards, labels) - handlungsbedarf(a, cards, labels)
-    if (bedarfUnterschied !== 0) return bedarfUnterschied
-    return epicShortcode(a.title, a.shortcode).localeCompare(epicShortcode(b.title, b.shortcode))
-  })
+  return [...epics]
 }
 
killedBy: sortEpics sortiert absteigend nach Karten mit mindestens einer gezählten Marke
statusReason: expected [ 1, 2 ] to deeply equal [ 2, 1 ]

[Killed] ArithmeticOperator
src/lib/epicTiles.ts:119:32
  */
 export function sortEpics(epics: Epic[], cards: Card[], labels: Label[]): Epic[] {
   return [...epics].sort((a, b) => {
-    const gruppenUnterschied = gruppe(a) - gruppe(b)
+    const gruppenUnterschied = gruppe(a) + gruppe(b)
     if (gruppenUnterschied !== 0) return gruppenUnterschied
     const bedarfUnterschied = handlungsbedarf(b, cards, labels) - handlungsbedarf(a, cards, labels)
killedBy: sortEpics stellt ein abgeschlossenes Vorhaben hinter die unfertigen
statusReason: expected [ 1, 2 ] to deeply equal [ 2, 1 ]

[Killed] ConditionalExpression
src/lib/epicTiles.ts:120:9
 export function sortEpics(epics: Epic[], cards: Card[], labels: Label[]): Epic[] {
   return [...epics].sort((a, b) => {
     const gruppenUnterschied = gruppe(a) - gruppe(b)
-    if (gruppenUnterschied !== 0) return gruppenUnterschied
+    if (false) return gruppenUnterschied
     const bedarfUnterschied = handlungsbedarf(b, cards, labels) - handlungsbedarf(a, cards, labels)
     if (bedarfUnterschied !== 0) return bedarfUnterschied
killedBy: sortEpics stellt ein abgeschlossenes Vorhaben hinter die unfertigen
statusReason: expected [ 1, 2 ] to deeply equal [ 2, 1 ]

[Killed] ConditionalExpression
src/lib/epicTiles.ts:120:9
 export function sortEpics(epics: Epic[], cards: Card[], labels: Label[]): Epic[] {
   return [...epics].sort((a, b) => {
     const gruppenUnterschied = gruppe(a) - gruppe(b)
-    if (gruppenUnterschied !== 0) return gruppenUnterschied
+    if (true) return gruppenUnterschied
     const bedarfUnterschied = handlungsbedarf(b, cards, labels) - handlungsbedarf(a, cards, labels)
     if (bedarfUnterschied !== 0) return bedarfUnterschied
killedBy: sortEpics sortiert absteigend nach Karten mit mindestens einer gezählten Marke
statusReason: expected [ 1, 2 ] to deeply equal [ 2, 1 ]

[Killed] ArithmeticOperator
src/lib/epicTiles.ts:121:31
   return [...epics].sort((a, b) => {
     const gruppenUnterschied = gruppe(a) - gruppe(b)
     if (gruppenUnterschied !== 0) return gruppenUnterschied
-    const bedarfUnterschied = handlungsbedarf(b, cards, labels) - handlungsbedarf(a, cards, labels)
+    const bedarfUnterschied = handlungsbedarf(b, cards, labels) + handlungsbedarf(a, cards, labels)
     if (bedarfUnterschied !== 0) return bedarfUnterschied
     return epicShortcode(a.title, a.shortcode).localeCompare(epicShortcode(b.title, b.shortcode))
killedBy: sortEpics sortiert absteigend nach Karten mit mindestens einer gezählten Marke
statusReason: expected [ 1, 2 ] to deeply equal [ 2, 1 ]

[Killed] ConditionalExpression
src/lib/epicTiles.ts:122:9
     const gruppenUnterschied = gruppe(a) - gruppe(b)
     if (gruppenUnterschied !== 0) return gruppenUnterschied
     const bedarfUnterschied = handlungsbedarf(b, cards, labels) - handlungsbedarf(a, cards, labels)
-    if (bedarfUnterschied !== 0) return bedarfUnterschied
+    if (true) return bedarfUnterschied
     return epicShortcode(a.title, a.shortcode).localeCompare(epicShortcode(b.title, b.shortcode))
   })
killedBy: sortEpics entscheidet bei Gleichstand über das Anzeige-Kürzel
statusReason: expected [ 1, 2 ] to deeply equal [ 2, 1 ]

[Killed] ConditionalExpression
src/lib/epicTiles.ts:122:9
     const gruppenUnterschied = gruppe(a) - gruppe(b)
     if (gruppenUnterschied !== 0) return gruppenUnterschied
     const bedarfUnterschied = handlungsbedarf(b, cards, labels) - handlungsbedarf(a, cards, labels)
-    if (bedarfUnterschied !== 0) return bedarfUnterschied
+    if (false) return bedarfUnterschied
     return epicShortcode(a.title, a.shortcode).localeCompare(epicShortcode(b.title, b.shortcode))
   })
killedBy: sortEpics sortiert absteigend nach Karten mit mindestens einer gezählten Marke
statusReason: expected [ 1, 2 ] to deeply equal [ 2, 1 ]

[Killed] BlockStatement
src/lib/epicTiles.ts:150:11
   epics: readonly Epic[],
   hidden: ReadonlySet<number>,
   zeigeAusgeblendete: boolean,
-): Epic[] {
-  if (zeigeAusgeblendete) return [...epics]
-  return epics.filter((epic) => !hidden.has(epic.id))
-}
+): Epic[] {}
 
killedBy: visibleEpics liefert bei leerem Ausblende-Zustand alle Vorhaben in unveränderter Reihenfolge
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/lib/epicTiles.ts:151:7
   hidden: ReadonlySet<number>,
   zeigeAusgeblendete: boolean,
 ): Epic[] {
-  if (zeigeAusgeblendete) return [...epics]
+  if (true) return [...epics]
   return epics.filter((epic) => !hidden.has(epic.id))
 }
killedBy: visibleEpics lässt ein ausgeblendetes Vorhaben weg und behält die Reihenfolge der übrigen
statusReason: expected [ 1, 2, 3 ] to deeply equal [ 1, 3 ]

[Killed] ConditionalExpression
src/lib/epicTiles.ts:151:7
   hidden: ReadonlySet<number>,
   zeigeAusgeblendete: boolean,
 ): Epic[] {
-  if (zeigeAusgeblendete) return [...epics]
+  if (false) return [...epics]
   return epics.filter((epic) => !hidden.has(epic.id))
 }
killedBy: visibleEpics liefert im Zeige-Modus alle Vorhaben als neue Liste, auch die ausgeblendeten
statusReason: expected [ 1, 3 ] to deeply equal [ 1, 2, 3 ]

[Killed] MethodExpression
src/lib/epicTiles.ts:152:10
   zeigeAusgeblendete: boolean,
 ): Epic[] {
   if (zeigeAusgeblendete) return [...epics]
-  return epics.filter((epic) => !hidden.has(epic.id))
+  return epics
 }
 
killedBy: visibleEpics lässt ein ausgeblendetes Vorhaben weg und behält die Reihenfolge der übrigen
statusReason: expected [ 1, 2, 3 ] to deeply equal [ 1, 3 ]

[Killed] BooleanLiteral
src/lib/epicTiles.ts:152:33
   zeigeAusgeblendete: boolean,
 ): Epic[] {
   if (zeigeAusgeblendete) return [...epics]
-  return epics.filter((epic) => !hidden.has(epic.id))
+  return epics.filter((epic) => hidden.has(epic.id))
 }
 
killedBy: visibleEpics liefert bei leerem Ausblende-Zustand alle Vorhaben in unveränderter Reihenfolge
statusReason: expected [] to deeply equal [ 1, 2, 3 ]
