[Killed] BlockStatement
src/lib/epicToCard.ts:4:63
 import type { Card } from '../api/cards'
 import type { Epic } from '../api/epics'
 
-export function epicToCard(epic: Epic, boardId: number): Card {
-  return {
-    id: epic.id, boardId, columnId: 0, number: epic.number, title: epic.title,
-    description: epic.description, positionInColumn: 0, archived: false, ideaStored: false, movedToDoneAt: null,
-    dependencies: [], type: 'EPIC', parentId: null, shortcode: epic.shortcode, assignees: [], dueDate: null, labels: [],
-    // Vorhaben tragen keine Herkunft (Issue #607): der Anlege-Endpunkt lehnt sie fuer EPIC ab.
-    derivedFrom: null,
-  }
-}
+export function epicToCard(epic: Epic, boardId: number): Card {}
 
killedBy: BoardPage weitere Orchestrierung öffnet über das Kürzel auf der Karte das Vorhaben im Detail-Dialog, nicht die Karte
statusReason: Unable to find role="dialog"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] ObjectLiteral
src/lib/epicToCard.ts:5:10
 import type { Epic } from '../api/epics'
 
 export function epicToCard(epic: Epic, boardId: number): Card {
-  return {
-    id: epic.id, boardId, columnId: 0, number: epic.number, title: epic.title,
-    description: epic.description, positionInColumn: 0, archived: false, ideaStored: false, movedToDoneAt: null,
-    dependencies: [], type: 'EPIC', parentId: null, shortcode: epic.shortcode, assignees: [], dueDate: null, labels: [],
-    // Vorhaben tragen keine Herkunft (Issue #607): der Anlege-Endpunkt lehnt sie fuer EPIC ab.
-    derivedFrom: null,
-  }
+  return {}
 }
 
killedBy: EpicsPage öffnet ein Epic per Klick im Detail-Modal mit seinen Kind-Karten
statusReason: Cannot read properties of undefined (reading 'join')

[Survived] BooleanLiteral
src/lib/epicToCard.ts:7:67
 export function epicToCard(epic: Epic, boardId: number): Card {
   return {
     id: epic.id, boardId, columnId: 0, number: epic.number, title: epic.title,
-    description: epic.description, positionInColumn: 0, archived: false, ideaStored: false, movedToDoneAt: null,
+    description: epic.description, positionInColumn: 0, archived: true, ideaStored: false, movedToDoneAt: null,
     dependencies: [], type: 'EPIC', parentId: null, shortcode: epic.shortcode, assignees: [], dueDate: null, labels: [],
     // Vorhaben tragen keine Herkunft (Issue #607): der Anlege-Endpunkt lehnt sie fuer EPIC ab.

[Survived] BooleanLiteral
src/lib/epicToCard.ts:7:86
 export function epicToCard(epic: Epic, boardId: number): Card {
   return {
     id: epic.id, boardId, columnId: 0, number: epic.number, title: epic.title,
-    description: epic.description, positionInColumn: 0, archived: false, ideaStored: false, movedToDoneAt: null,
+    description: epic.description, positionInColumn: 0, archived: false, ideaStored: true, movedToDoneAt: null,
     dependencies: [], type: 'EPIC', parentId: null, shortcode: epic.shortcode, assignees: [], dueDate: null, labels: [],
     // Vorhaben tragen keine Herkunft (Issue #607): der Anlege-Endpunkt lehnt sie fuer EPIC ab.

[Killed] StringLiteral
src/lib/epicToCard.ts:8:29
   return {
     id: epic.id, boardId, columnId: 0, number: epic.number, title: epic.title,
     description: epic.description, positionInColumn: 0, archived: false, ideaStored: false, movedToDoneAt: null,
-    dependencies: [], type: 'EPIC', parentId: null, shortcode: epic.shortcode, assignees: [], dueDate: null, labels: [],
+    dependencies: [], type: "", parentId: null, shortcode: epic.shortcode, assignees: [], dueDate: null, labels: [],
     // Vorhaben tragen keine Herkunft (Issue #607): der Anlege-Endpunkt lehnt sie fuer EPIC ab.
     derivedFrom: null,
killedBy: EpicsPage öffnet ein Epic per Klick im Detail-Modal mit seinen Kind-Karten
statusReason: Unable to find role="tree"

Ignored nodes: comments, script, style
<body
  style="padding-right: 1024px; overflow: hidden;"
>
  <div
    aria-hidden="true"

[Survived] ArrayDeclaration
src/lib/epicToCard.ts:8:19
   return {
     id: epic.id, boardId, columnId: 0, number: epic.number, title: epic.title,
     description: epic.description, positionInColumn: 0, archived: false, ideaStored: false, movedToDoneAt: null,
-    dependencies: [], type: 'EPIC', parentId: null, shortcode: epic.shortcode, assignees: [], dueDate: null, labels: [],
+    dependencies: ["Stryker was here"], type: 'EPIC', parentId: null, shortcode: epic.shortcode, assignees: [], dueDate: null, labels: [],
     // Vorhaben tragen keine Herkunft (Issue #607): der Anlege-Endpunkt lehnt sie fuer EPIC ab.
     derivedFrom: null,
