[Killed] Regex
src/lib/markdownTasks.ts:10:15
 // wir die Marker vor dem Rendern zu `[ ]`/`[x]` — am Zeilenanfang und außerhalb von Code-Fences.
 // Nackte Marker ohne Listenmarker bekommen zusätzlich einen `- `, damit GFM sie als Liste erkennt.
 
-const FENCE = /^\s*(```|~~~)/
+const FENCE = /^\s(```|~~~)/
 // Marker-Kern durchgängig `\[\s*(?:[xX]\s*)?\]` statt `\[\s*[xX]?\s*\]`: Letzteres hat zwei
 // benachbarte `\s*` um ein optionales Zeichen und erlaubt super-lineares Backtracking bei
killedBy: normalizeTaskLists rührt Marker in Code-Fences nicht an
statusReason: expected '```\n- [ ] kein Task\n```' to be '```\n[ ] kein Task\n```' // Object.is equality

[Killed] Regex
src/lib/markdownTasks.ts:17:16
 // Whitespace-Gruppen als Anker; die Menge der akzeptierten Marker ist identisch
 // (`[]`, `[ ]`, `[  ]`, `[x]`, `[ x ]`, `[X]`).
 /** Marker-Kern: eckige Klammern mit optionalem x/X und beliebigem Whitespace. */
-const MARKER = /\[\s*(?:[xX]\s*)?\]/
+const MARKER = /\[\s*(?:[xX]\s*)\]/
 /** Zeile mit Listenmarker (`-`/`*`/`+`/`1.`) direkt vor dem Task-Marker. */
 const LISTED = /^(\s*(?:[-*+]|\d+[.)])\s+)(\[\s*(?:[xX]\s*)?\])(.*)$/
killedBy: toggleTaskAt schaltet die n-te Checkbox um
statusReason: expected '[ ] eins\n[ ] zwei' to be '[x] eins\n[ ] zwei' // Object.is equality

[Killed] Regex
src/lib/markdownTasks.ts:17:16
 // Whitespace-Gruppen als Anker; die Menge der akzeptierten Marker ist identisch
 // (`[]`, `[ ]`, `[  ]`, `[x]`, `[ x ]`, `[X]`).
 /** Marker-Kern: eckige Klammern mit optionalem x/X und beliebigem Whitespace. */
-const MARKER = /\[\s*(?:[xX]\s*)?\]/
+const MARKER = /\[\s*(?:[^xX]\s*)?\]/
 /** Zeile mit Listenmarker (`-`/`*`/`+`/`1.`) direkt vor dem Task-Marker. */
 const LISTED = /^(\s*(?:[-*+]|\d+[.)])\s+)(\[\s*(?:[xX]\s*)?\])(.*)$/
killedBy: toggleTaskAt schaltet [x] zurück auf [ ]
statusReason: expected '- [x] fertig' to be '- [ ] fertig' // Object.is equality

[Killed] Regex
src/lib/markdownTasks.ts:19:16
 /** Marker-Kern: eckige Klammern mit optionalem x/X und beliebigem Whitespace. */
 const MARKER = /\[\s*(?:[xX]\s*)?\]/
 /** Zeile mit Listenmarker (`-`/`*`/`+`/`1.`) direkt vor dem Task-Marker. */
-const LISTED = /^(\s*(?:[-*+]|\d+[.)])\s+)(\[\s*(?:[xX]\s*)?\])(.*)$/
+const LISTED = /^(\s*(?:[-*+]|\D+[.)])\s+)(\[\s*(?:[xX]\s*)?\])(.*)$/
 /** Nackter Task-Marker am Zeilenanfang (ohne Listenmarker), gefolgt von Whitespace. */
 const NAKED = /^(\s*)(\[\s*(?:[xX]\s*)?\])(\s.*)$/
killedBy: toggleTaskAt zählt gemischte Marker (mit/ohne Liste) in Dokumentreihenfolge
statusReason: expected '- [ ] a\n1. [ ] b\n[ ] c' to be '- [ ] a\n1. [ ] b\n[x] c' // Object.is equality

[Killed] Regex
src/lib/markdownTasks.ts:19:16
 /** Marker-Kern: eckige Klammern mit optionalem x/X und beliebigem Whitespace. */
 const MARKER = /\[\s*(?:[xX]\s*)?\]/
 /** Zeile mit Listenmarker (`-`/`*`/`+`/`1.`) direkt vor dem Task-Marker. */
-const LISTED = /^(\s*(?:[-*+]|\d+[.)])\s+)(\[\s*(?:[xX]\s*)?\])(.*)$/
+const LISTED = /^(\s(?:[-*+]|\d+[.)])\s+)(\[\s*(?:[xX]\s*)?\])(.*)$/
 /** Nackter Task-Marker am Zeilenanfang (ohne Listenmarker), gefolgt von Whitespace. */
 const NAKED = /^(\s*)(\[\s*(?:[xX]\s*)?\])(\s.*)$/
killedBy: normalizeTaskLists kanonisiert Marker mit abweichender Leerzeichen-Zahl bei Listen-Items
statusReason: expected '- [  ] doppelt' to be '- [ ] doppelt' // Object.is equality

[Killed] Regex
src/lib/markdownTasks.ts:21:15
 /** Zeile mit Listenmarker (`-`/`*`/`+`/`1.`) direkt vor dem Task-Marker. */
 const LISTED = /^(\s*(?:[-*+]|\d+[.)])\s+)(\[\s*(?:[xX]\s*)?\])(.*)$/
 /** Nackter Task-Marker am Zeilenanfang (ohne Listenmarker), gefolgt von Whitespace. */
-const NAKED = /^(\s*)(\[\s*(?:[xX]\s*)?\])(\s.*)$/
+const NAKED = /^(\s)(\[\s*(?:[xX]\s*)?\])(\s.*)$/
 
 /** Kanonische Marker-Form: `[x]` wenn irgendein x/X enthalten ist, sonst `[ ]`. */
killedBy: normalizeTaskLists wandelt nackte [ ] am Zeilenanfang in Task-Items um
statusReason: expected '[ ] Aufgabe eins' to be '- [ ] Aufgabe eins' // Object.is equality

[Killed] Regex
src/lib/markdownTasks.ts:21:15
 /** Zeile mit Listenmarker (`-`/`*`/`+`/`1.`) direkt vor dem Task-Marker. */
 const LISTED = /^(\s*(?:[-*+]|\d+[.)])\s+)(\[\s*(?:[xX]\s*)?\])(.*)$/
 /** Nackter Task-Marker am Zeilenanfang (ohne Listenmarker), gefolgt von Whitespace. */
-const NAKED = /^(\s*)(\[\s*(?:[xX]\s*)?\])(\s.*)$/
+const NAKED = /^(\s*)(\[\S*(?:[xX]\s*)?\])(\s.*)$/
 
 /** Kanonische Marker-Form: `[x]` wenn irgendein x/X enthalten ist, sonst `[ ]`. */
killedBy: normalizeTaskLists wandelt nackte [ ] am Zeilenanfang in Task-Items um
statusReason: expected '[ ] Aufgabe eins' to be '- [ ] Aufgabe eins' // Object.is equality

[Killed] BlockStatement
src/lib/markdownTasks.ts:24:44
 const NAKED = /^(\s*)(\[\s*(?:[xX]\s*)?\])(\s.*)$/
 
 /** Kanonische Marker-Form: `[x]` wenn irgendein x/X enthalten ist, sonst `[ ]`. */
-function canonical(marker: string): string {
-  return /[xX]/.test(marker) ? '[x]' : '[ ]'
-}
+function canonical(marker: string): string {}
 
 /**
killedBy: CardDetailModal rendert auch nackte [ ] als Checkbox
statusReason: Unable to find a label with the text of: Aufgabe 1

Ignored nodes: comments, script, style
<body
  style="padding-right: 1024px; overflow: hidden;"
>
  <div
    aria-hidden="true"

[Killed] BooleanLiteral
src/lib/markdownTasks.ts:36:17
  * Klammern im Fließtext unangetastet bleiben. Code-Fences bleiben unverändert.
  */
 export function normalizeTaskLists(md: string): string {
-  let inFence = false
+  let inFence = true
   return md
     .split('\n')
killedBy: CardDetailModal rendert auch nackte [ ] als Checkbox
statusReason: Unable to find a label with the text of: Aufgabe 1

Ignored nodes: comments, script, style
<body
  style="padding-right: 1024px; overflow: hidden;"
>
  <div
    aria-hidden="true"

[Killed] StringLiteral
src/lib/markdownTasks.ts:38:12
 export function normalizeTaskLists(md: string): string {
   let inFence = false
   return md
-    .split('\n')
+    .split("")
     .map((line) => {
       if (FENCE.test(line)) {
killedBy: CardDetailModal rendert im Lesemodus Markdown, Abhängigkeiten und Kommentare
statusReason: Unable to find an accessible element with the role "heading" and name "Titel"

Here are the accessible roles:

  presentation:

  Name "":
  <div

[Killed] BlockStatement
src/lib/markdownTasks.ts:39:20
   let inFence = false
   return md
     .split('\n')
-    .map((line) => {
-      if (FENCE.test(line)) {
-        inFence = !inFence
-        return line
-      }
-      if (inFence) {
-        return line
-      }
-      const listed = LISTED.exec(line)
-      if (listed) {
-        const [, prefix, marker, rest] = listed
-        const body = rest.replace(/^\s*/, '')
-        const suffix = body ? ` ${body}` : ''
-        return `${prefix}${canonical(marker)}${suffix}`
-      }
-      const naked = NAKED.exec(line)
-      if (naked) {
-        const [, indent, marker, rest] = naked
-        const body = rest.replace(/^\s*/, '')
-        const suffix = body ? ` ${body}` : ''
-        return `${indent}- ${canonical(marker)}${suffix}`
-      }
-      return line
-    })
+    .map((line) => {})
     .join('\n')
 }
killedBy: CardDetailModal rendert im Lesemodus Markdown, Abhängigkeiten und Kommentare
statusReason: Unable to find an accessible element with the role "heading" and name "Titel"

Here are the accessible roles:

  presentation:

  Name "":
  <div

[Killed] ConditionalExpression
src/lib/markdownTasks.ts:40:11
   return md
     .split('\n')
     .map((line) => {
-      if (FENCE.test(line)) {
+      if (true) {
         inFence = !inFence
         return line
killedBy: CardDetailModal rendert auch nackte [ ] als Checkbox
statusReason: Unable to find a label with the text of: Aufgabe 1

Ignored nodes: comments, script, style
<body
  style="padding-right: 1024px; overflow: hidden;"
>
  <div
    aria-hidden="true"

[Killed] ConditionalExpression
src/lib/markdownTasks.ts:40:11
   return md
     .split('\n')
     .map((line) => {
-      if (FENCE.test(line)) {
+      if (false) {
         inFence = !inFence
         return line
killedBy: normalizeTaskLists rührt Marker in Code-Fences nicht an
statusReason: expected '```\n- [ ] kein Task\n```' to be '```\n[ ] kein Task\n```' // Object.is equality

[Killed] BooleanLiteral
src/lib/markdownTasks.ts:41:19
     .split('\n')
     .map((line) => {
       if (FENCE.test(line)) {
-        inFence = !inFence
+        inFence = inFence
         return line
       }
killedBy: normalizeTaskLists rührt Marker in Code-Fences nicht an
statusReason: expected '```\n- [ ] kein Task\n```' to be '```\n[ ] kein Task\n```' // Object.is equality

[Killed] ConditionalExpression
src/lib/markdownTasks.ts:44:11
         inFence = !inFence
         return line
       }
-      if (inFence) {
+      if (true) {
         return line
       }
killedBy: normalizeTaskLists wandelt nackte [ ] am Zeilenanfang in Task-Items um
statusReason: expected '[ ] Aufgabe eins' to be '- [ ] Aufgabe eins' // Object.is equality

[Killed] ConditionalExpression
src/lib/markdownTasks.ts:44:11
         inFence = !inFence
         return line
       }
-      if (inFence) {
+      if (false) {
         return line
       }
killedBy: normalizeTaskLists rührt Marker in Code-Fences nicht an
statusReason: expected '```\n- [ ] kein Task\n```' to be '```\n[ ] kein Task\n```' // Object.is equality

[Killed] ConditionalExpression
src/lib/markdownTasks.ts:48:11
         return line
       }
       const listed = LISTED.exec(line)
-      if (listed) {
+      if (true) {
         const [, prefix, marker, rest] = listed
         const body = rest.replace(/^\s*/, '')
killedBy: normalizeTaskLists wandelt nackte [ ] am Zeilenanfang in Task-Items um
statusReason: listed is not iterable

[Killed] BlockStatement
src/lib/markdownTasks.ts:48:19
         return line
       }
       const listed = LISTED.exec(line)
-      if (listed) {
-        const [, prefix, marker, rest] = listed
-        const body = rest.replace(/^\s*/, '')
-        const suffix = body ? ` ${body}` : ''
-        return `${prefix}${canonical(marker)}${suffix}`
-      }
+      if (listed) {}
       const naked = NAKED.exec(line)
       if (naked) {
killedBy: normalizeTaskLists kanonisiert Marker mit abweichender Leerzeichen-Zahl bei Listen-Items
statusReason: expected '- [  ] doppelt' to be '- [ ] doppelt' // Object.is equality

[Killed] StringLiteral
src/lib/markdownTasks.ts:50:43
       const listed = LISTED.exec(line)
       if (listed) {
         const [, prefix, marker, rest] = listed
-        const body = rest.replace(/^\s*/, '')
+        const body = rest.replace(/^\s*/, "Stryker was here!")
         const suffix = body ? ` ${body}` : ''
         return `${prefix}${canonical(marker)}${suffix}`
killedBy: normalizeTaskLists behält Marker ohne nachfolgenden Text ohne angehängtes Leerzeichen
statusReason: expected '- [x] Stryker was here!' to be '- [x]' // Object.is equality

[Survived] Regex
src/lib/markdownTasks.ts:50:35
       const listed = LISTED.exec(line)
       if (listed) {
         const [, prefix, marker, rest] = listed
-        const body = rest.replace(/^\s*/, '')
+        const body = rest.replace(/\s*/, '')
         const suffix = body ? ` ${body}` : ''
         return `${prefix}${canonical(marker)}${suffix}`

[Killed] StringLiteral
src/lib/markdownTasks.ts:51:31
       if (listed) {
         const [, prefix, marker, rest] = listed
         const body = rest.replace(/^\s*/, '')
-        const suffix = body ? ` ${body}` : ''
+        const suffix = body ? `` : ''
         return `${prefix}${canonical(marker)}${suffix}`
       }
killedBy: normalizeTaskLists lässt bereits vorhandene Listenmarker unverändert
statusReason: expected '- [ ]' to be '- [ ] schon Liste' // Object.is equality

[Killed] StringLiteral
src/lib/markdownTasks.ts:52:16
         const [, prefix, marker, rest] = listed
         const body = rest.replace(/^\s*/, '')
         const suffix = body ? ` ${body}` : ''
-        return `${prefix}${canonical(marker)}${suffix}`
+        return ``
       }
       const naked = NAKED.exec(line)
killedBy: normalizeTaskLists behält Marker ohne nachfolgenden Text ohne angehängtes Leerzeichen
statusReason: expected '' to be '- [x]' // Object.is equality

[Killed] BlockStatement
src/lib/markdownTasks.ts:55:18
         return `${prefix}${canonical(marker)}${suffix}`
       }
       const naked = NAKED.exec(line)
-      if (naked) {
-        const [, indent, marker, rest] = naked
-        const body = rest.replace(/^\s*/, '')
-        const suffix = body ? ` ${body}` : ''
-        return `${indent}- ${canonical(marker)}${suffix}`
-      }
+      if (naked) {}
       return line
     })
killedBy: normalizeTaskLists wandelt nackte [ ] am Zeilenanfang in Task-Items um
statusReason: expected '[ ] Aufgabe eins' to be '- [ ] Aufgabe eins' // Object.is equality

[Killed] ConditionalExpression
src/lib/markdownTasks.ts:55:11
         return `${prefix}${canonical(marker)}${suffix}`
       }
       const naked = NAKED.exec(line)
-      if (naked) {
+      if (false) {
         const [, indent, marker, rest] = naked
         const body = rest.replace(/^\s*/, '')
killedBy: normalizeTaskLists wandelt nackte [ ] am Zeilenanfang in Task-Items um
statusReason: expected '[ ] Aufgabe eins' to be '- [ ] Aufgabe eins' // Object.is equality

[Killed] BlockStatement
src/lib/markdownTasks.ts:72:71
  * (Code-Fences zählen nicht; Marker-Varianten wie `[  ]`/`[]`/`[ x ]` zählen mit), damit der Index
  * dem gerenderten Checkbox-Index entspricht. Kein Treffer → unveränderter Text.
  */
-export function toggleTaskAt(md: string, targetIndex: number): string {
-  const lines = md.split('\n')
-  let inFence = false
-  let i = 0
-  for (let l = 0; l < lines.length; l++) {
-    const line = lines[l]
-    if (FENCE.test(line)) {
-      inFence = !inFence
-      continue
-    }
-    if (inFence || (!LISTED.test(line) && !NAKED.test(line))) {
-      continue
-    }
-    if (i === targetIndex) {
-      // Nur den führenden Marker flippen (nicht Klammern im Task-Text) und kanonisch schreiben.
-      lines[l] = line.replace(MARKER, (mk) => (/[xX]/.test(mk) ? '[ ]' : '[x]'))
-      return lines.join('\n')
-    }
-    i++
-  }
-  return md
-}
+export function toggleTaskAt(md: string, targetIndex: number): string {}
 
killedBy: toggleTaskAt schaltet die n-te Checkbox um
statusReason: expected undefined to be '[x] eins\n[ ] zwei' // Object.is equality

[Killed] StringLiteral
src/lib/markdownTasks.ts:73:26
  * dem gerenderten Checkbox-Index entspricht. Kein Treffer → unveränderter Text.
  */
 export function toggleTaskAt(md: string, targetIndex: number): string {
-  const lines = md.split('\n')
+  const lines = md.split("")
   let inFence = false
   let i = 0
killedBy: toggleTaskAt schaltet die n-te Checkbox um
statusReason: expected '[ ] eins\n[ ] zwei' to be '[x] eins\n[ ] zwei' // Object.is equality

[Killed] BooleanLiteral
src/lib/markdownTasks.ts:74:17
  */
 export function toggleTaskAt(md: string, targetIndex: number): string {
   const lines = md.split('\n')
-  let inFence = false
+  let inFence = true
   let i = 0
   for (let l = 0; l < lines.length; l++) {
killedBy: toggleTaskAt schaltet die n-te Checkbox um
statusReason: expected '[ ] eins\n[ ] zwei' to be '[x] eins\n[ ] zwei' // Object.is equality

[Killed] EqualityOperator
src/lib/markdownTasks.ts:76:19
   const lines = md.split('\n')
   let inFence = false
   let i = 0
-  for (let l = 0; l < lines.length; l++) {
+  for (let l = 0; l >= lines.length; l++) {
     const line = lines[l]
     if (FENCE.test(line)) {
killedBy: toggleTaskAt schaltet die n-te Checkbox um
statusReason: expected '[ ] eins\n[ ] zwei' to be '[x] eins\n[ ] zwei' // Object.is equality

[Killed] ConditionalExpression
src/lib/markdownTasks.ts:76:19
   const lines = md.split('\n')
   let inFence = false
   let i = 0
-  for (let l = 0; l < lines.length; l++) {
+  for (let l = 0; false; l++) {
     const line = lines[l]
     if (FENCE.test(line)) {
killedBy: toggleTaskAt schaltet die n-te Checkbox um
statusReason: expected '[ ] eins\n[ ] zwei' to be '[x] eins\n[ ] zwei' // Object.is equality

[Killed] ConditionalExpression
src/lib/markdownTasks.ts:78:9
   let i = 0
   for (let l = 0; l < lines.length; l++) {
     const line = lines[l]
-    if (FENCE.test(line)) {
+    if (false) {
       inFence = !inFence
       continue
killedBy: toggleTaskAt überspringt Checkboxen in Code-Fences
statusReason: expected '```\n[x] ignoriert\n```\n[ ] echt' to be '```\n[ ] ignoriert\n```\n[x] echt' // Object.is equality

[Killed] ConditionalExpression
src/lib/markdownTasks.ts:78:9
   let i = 0
   for (let l = 0; l < lines.length; l++) {
     const line = lines[l]
-    if (FENCE.test(line)) {
+    if (true) {
       inFence = !inFence
       continue
killedBy: toggleTaskAt schaltet die n-te Checkbox um
statusReason: expected '[ ] eins\n[ ] zwei' to be '[x] eins\n[ ] zwei' // Object.is equality

[Killed] LogicalOperator
src/lib/markdownTasks.ts:82:9
       inFence = !inFence
       continue
     }
-    if (inFence || (!LISTED.test(line) && !NAKED.test(line))) {
+    if (inFence && !LISTED.test(line) && !NAKED.test(line)) {
       continue
     }
killedBy: toggleTaskAt überspringt Checkboxen in Code-Fences
statusReason: expected '```\n[x] ignoriert\n```\n[ ] echt' to be '```\n[ ] ignoriert\n```\n[x] echt' // Object.is equality

[Killed] BlockStatement
src/lib/markdownTasks.ts:82:63
       inFence = !inFence
       continue
     }
-    if (inFence || (!LISTED.test(line) && !NAKED.test(line))) {
-      continue
-    }
+    if (inFence || (!LISTED.test(line) && !NAKED.test(line))) {}
     if (i === targetIndex) {
       // Nur den führenden Marker flippen (nicht Klammern im Task-Text) und kanonisch schreiben.
killedBy: toggleTaskAt überspringt Checkboxen in Code-Fences
statusReason: expected '```\n[x] ignoriert\n```\n[ ] echt' to be '```\n[ ] ignoriert\n```\n[x] echt' // Object.is equality

[Killed] ConditionalExpression
src/lib/markdownTasks.ts:85:9
     if (inFence || (!LISTED.test(line) && !NAKED.test(line))) {
       continue
     }
-    if (i === targetIndex) {
+    if (true) {
       // Nur den führenden Marker flippen (nicht Klammern im Task-Text) und kanonisch schreiben.
       lines[l] = line.replace(MARKER, (mk) => (/[xX]/.test(mk) ? '[ ]' : '[x]'))
killedBy: toggleTaskAt schaltet die n-te Checkbox um
statusReason: expected '[x] eins\n[ ] zwei' to be '[ ] eins\n[x] zwei' // Object.is equality

[Killed] EqualityOperator
src/lib/markdownTasks.ts:85:9
     if (inFence || (!LISTED.test(line) && !NAKED.test(line))) {
       continue
     }
-    if (i === targetIndex) {
+    if (i !== targetIndex) {
       // Nur den führenden Marker flippen (nicht Klammern im Task-Text) und kanonisch schreiben.
       lines[l] = line.replace(MARKER, (mk) => (/[xX]/.test(mk) ? '[ ]' : '[x]'))
killedBy: toggleTaskAt schaltet die n-te Checkbox um
statusReason: expected '[ ] eins\n[x] zwei' to be '[x] eins\n[ ] zwei' // Object.is equality

[Killed] ArrowFunction
src/lib/markdownTasks.ts:87:39
     }
     if (i === targetIndex) {
       // Nur den führenden Marker flippen (nicht Klammern im Task-Text) und kanonisch schreiben.
-      lines[l] = line.replace(MARKER, (mk) => (/[xX]/.test(mk) ? '[ ]' : '[x]'))
+      lines[l] = line.replace(MARKER, () => undefined)
       return lines.join('\n')
     }
killedBy: toggleTaskAt schaltet die n-te Checkbox um
statusReason: expected 'undefined eins\n[ ] zwei' to be '[x] eins\n[ ] zwei' // Object.is equality

[Killed] StringLiteral
src/lib/markdownTasks.ts:87:74
     }
     if (i === targetIndex) {
       // Nur den führenden Marker flippen (nicht Klammern im Task-Text) und kanonisch schreiben.
-      lines[l] = line.replace(MARKER, (mk) => (/[xX]/.test(mk) ? '[ ]' : '[x]'))
+      lines[l] = line.replace(MARKER, (mk) => (/[xX]/.test(mk) ? '[ ]' : ""))
       return lines.join('\n')
     }
killedBy: toggleTaskAt schaltet die n-te Checkbox um
statusReason: expected ' eins\n[ ] zwei' to be '[x] eins\n[ ] zwei' // Object.is equality

[Killed] UpdateOperator
src/lib/markdownTasks.ts:90:5
       lines[l] = line.replace(MARKER, (mk) => (/[xX]/.test(mk) ? '[ ]' : '[x]'))
       return lines.join('\n')
     }
-    i++
+    i--
   }
   return md
killedBy: toggleTaskAt schaltet die n-te Checkbox um
statusReason: expected '[ ] eins\n[ ] zwei' to be '[ ] eins\n[x] zwei' // Object.is equality
