[Killed] StringLiteral
src/lib/nightRunHandoff.ts:41:8
 export const NIGHT_RUN_STATE_TEXT: Record<NightRunState, string> = {
   GREEN: 'Erfolg',
   YELLOW: 'Erfolg, Prüfung rot',
-  RED: 'gescheitert',
+  RED: "",
   GREY: 'nicht bearbeitet',
 }
killedBy: NightRunPage — Zustände, Kennzahlen und Auszüge macht jeden der vier Zustände am Text erkennbar, nicht nur an der Farbe
statusReason: Unable to find an element with the text: gescheitert. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<div
  class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation0 MuiPaper-root MuiPaper-outlined MuiPaper-rounded MuiAccor

[Killed] StringLiteral
src/lib/nightRunHandoff.ts:42:9
   GREEN: 'Erfolg',
   YELLOW: 'Erfolg, Prüfung rot',
   RED: 'gescheitert',
-  GREY: 'nicht bearbeitet',
+  GREY: "",
 }
 
killedBy: NightRunPage — Zustände, Kennzahlen und Auszüge macht jeden der vier Zustände am Text erkennbar, nicht nur an der Farbe
statusReason: Unable to find an element with the text: nicht bearbeitet. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<div
  class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation0 MuiPaper-root MuiPaper-outlined MuiPaper-rounded Mui

[Survived] StringLiteral
src/lib/nightRunHandoff.ts:54:21
 export const NIGHT_RUN_ERROR_CLASS_TEXT: Record<NightRunErrorClass, string> = {
   CHECKS_RED: 'Prüfungen rot',
   CHECKS_NOT_STARTED: 'Prüfungen nicht gelaufen',
-  DEPENDENCY_UNMET: 'Abhängigkeit offen',
+  DEPENDENCY_UNMET: "",
   UNEXPECTED_STATE: 'Unerwarteter Zustand',
   HARD_ABORT: 'Harter Abbruch',

[Killed] BlockStatement
src/lib/nightRunHandoff.ts:71:76
  * <p>Fehlende Angaben lassen ihre Zeile weg, statt sie leer oder mit `undefined` zu schreiben: Ein
  * Text, der `Auszug: undefined` in eine fremde Sitzung traegt, behauptet dort etwas Falsches.
  */
-export function buildHandoffText(item: NightRunHandoffItem): string | null {
-  if (item.state !== 'YELLOW' && item.state !== 'RED') {
-    return null
-  }
-  const karte = item.title === '' ? `#${item.cardNumber}` : `#${item.cardNumber} ${item.title}`
-  const zeilen = [`Nachtlauf-Befund zu Karte ${karte}`, `Zustand: ${NIGHT_RUN_STATE_TEXT[item.state]}`]
-
-  if (item.errorClass !== undefined) {
-    zeilen.push(`Fehlerklasse: ${NIGHT_RUN_ERROR_CLASS_TEXT[item.errorClass]}`)
-  }
-  // Truthiness statt `!== undefined`: Ein leerer Auszug ergaebe eine Zeile, die nichts sagt.
-  if (item.excerpt) {
-    zeilen.push(`Auszug: ${item.excerpt}`)
-  }
-  return zeilen.join('\n')
-}
+export function buildHandoffText(item: NightRunHandoffItem): string | null {}
 
killedBy: NightRunPage — Übernahmetext für die Entwicklungsumgebung zeigt zu einem gelben und einem roten Arbeitspaket den vollständigen Text, bevor kopiert wird
statusReason: It looks like undefined was passed instead of a matcher. Did you do something like getByText(undefined)?

[Killed] ConditionalExpression
src/lib/nightRunHandoff.ts:72:34
  * Text, der `Auszug: undefined` in eine fremde Sitzung traegt, behauptet dort etwas Falsches.
  */
 export function buildHandoffText(item: NightRunHandoffItem): string | null {
-  if (item.state !== 'YELLOW' && item.state !== 'RED') {
+  if (item.state !== 'YELLOW' && true) {
     return null
   }
killedBy: NightRunPage — Übernahmetext für die Entwicklungsumgebung zeigt zu einem gelben und einem roten Arbeitspaket den vollständigen Text, bevor kopiert wird
statusReason: It looks like null was passed instead of a matcher. Did you do something like getByText(null)?

[Killed] LogicalOperator
src/lib/nightRunHandoff.ts:72:7
  * Text, der `Auszug: undefined` in eine fremde Sitzung traegt, behauptet dort etwas Falsches.
  */
 export function buildHandoffText(item: NightRunHandoffItem): string | null {
-  if (item.state !== 'YELLOW' && item.state !== 'RED') {
+  if (item.state !== 'YELLOW' || item.state !== 'RED') {
     return null
   }
killedBy: NightRunPage — Übernahmetext für die Entwicklungsumgebung zeigt zu einem gelben und einem roten Arbeitspaket den vollständigen Text, bevor kopiert wird
statusReason: Unable to find an element with the display value: null.

Ignored nodes: comments, script, style
<div
  class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation0 MuiPaper-root MuiPaper-outlined MuiPaper-rounded MuiAccordion-root MuiAccordion-rounded Mui-expanded MuiAccordion-gutters css-4nqx66-MuiPaper-root-MuiPaper-root-MuiAccordion-root"
  data-testid="lauf-2026-09-01T22:00:00.

[Killed] ConditionalExpression
src/lib/nightRunHandoff.ts:75:17
   if (item.state !== 'YELLOW' && item.state !== 'RED') {
     return null
   }
-  const karte = item.title === '' ? `#${item.cardNumber}` : `#${item.cardNumber} ${item.title}`
+  const karte = false ? `#${item.cardNumber}` : `#${item.cardNumber} ${item.title}`
   const zeilen = [`Nachtlauf-Befund zu Karte ${karte}`, `Zustand: ${NIGHT_RUN_STATE_TEXT[item.state]}`]
 
killedBy: buildHandoffText — gelbe und rote Arbeitspakete nennt die Karte ohne nachlaufendes Leerzeichen, wenn das Protokoll keinen Titel trug
statusReason: expected 'Nachtlauf-Befund zu Karte #700 ' to match /#700$/

[Killed] ConditionalExpression
src/lib/nightRunHandoff.ts:75:17
   if (item.state !== 'YELLOW' && item.state !== 'RED') {
     return null
   }
-  const karte = item.title === '' ? `#${item.cardNumber}` : `#${item.cardNumber} ${item.title}`
+  const karte = true ? `#${item.cardNumber}` : `#${item.cardNumber} ${item.title}`
   const zeilen = [`Nachtlauf-Befund zu Karte ${karte}`, `Zustand: ${NIGHT_RUN_STATE_TEXT[item.state]}`]
 
killedBy: NightRunPage — null aus der API (#734) lässt die Fehlerklasse aus dem Übernahmetext weg, statt „undefined" hineinzuschreiben
statusReason: expected 'Nachtlauf-Befund zu Karte #700\nZusta…' to be 'Nachtlauf-Befund zu Karte #700 Paket …' // Object.is equality

[Killed] EqualityOperator
src/lib/nightRunHandoff.ts:78:7
   const karte = item.title === '' ? `#${item.cardNumber}` : `#${item.cardNumber} ${item.title}`
   const zeilen = [`Nachtlauf-Befund zu Karte ${karte}`, `Zustand: ${NIGHT_RUN_STATE_TEXT[item.state]}`]
 
-  if (item.errorClass !== undefined) {
+  if (item.errorClass === undefined) {
     zeilen.push(`Fehlerklasse: ${NIGHT_RUN_ERROR_CLASS_TEXT[item.errorClass]}`)
   }
killedBy: buildHandoffText — gelbe und rote Arbeitspakete nennt zu einem roten Arbeitspaket Kartennummer, Zustand, Fehlerklasse und Auszug
statusReason: expected 'Nachtlauf-Befund zu Karte #700 Paket …' to contain 'Harter Abbruch'

[Killed] BlockStatement
src/lib/nightRunHandoff.ts:78:38
   const karte = item.title === '' ? `#${item.cardNumber}` : `#${item.cardNumber} ${item.title}`
   const zeilen = [`Nachtlauf-Befund zu Karte ${karte}`, `Zustand: ${NIGHT_RUN_STATE_TEXT[item.state]}`]
 
-  if (item.errorClass !== undefined) {
-    zeilen.push(`Fehlerklasse: ${NIGHT_RUN_ERROR_CLASS_TEXT[item.errorClass]}`)
-  }
+  if (item.errorClass !== undefined) {}
   // Truthiness statt `!== undefined`: Ein leerer Auszug ergaebe eine Zeile, die nichts sagt.
   if (item.excerpt) {
killedBy: buildHandoffText — gelbe und rote Arbeitspakete nennt zu einem roten Arbeitspaket Kartennummer, Zustand, Fehlerklasse und Auszug
statusReason: expected 'Nachtlauf-Befund zu Karte #700 Paket …' to contain 'Harter Abbruch'

[Killed] StringLiteral
src/lib/nightRunHandoff.ts:79:17
   const zeilen = [`Nachtlauf-Befund zu Karte ${karte}`, `Zustand: ${NIGHT_RUN_STATE_TEXT[item.state]}`]
 
   if (item.errorClass !== undefined) {
-    zeilen.push(`Fehlerklasse: ${NIGHT_RUN_ERROR_CLASS_TEXT[item.errorClass]}`)
+    zeilen.push(``)
   }
   // Truthiness statt `!== undefined`: Ein leerer Auszug ergaebe eine Zeile, die nichts sagt.
killedBy: buildHandoffText — gelbe und rote Arbeitspakete nennt zu einem roten Arbeitspaket Kartennummer, Zustand, Fehlerklasse und Auszug
statusReason: expected 'Nachtlauf-Befund zu Karte #700 Paket …' to contain 'Harter Abbruch'

[Killed] ConditionalExpression
src/lib/nightRunHandoff.ts:82:7
     zeilen.push(`Fehlerklasse: ${NIGHT_RUN_ERROR_CLASS_TEXT[item.errorClass]}`)
   }
   // Truthiness statt `!== undefined`: Ein leerer Auszug ergaebe eine Zeile, die nichts sagt.
-  if (item.excerpt) {
+  if (true) {
     zeilen.push(`Auszug: ${item.excerpt}`)
   }
killedBy: buildHandoffText — fehlende Angaben erzeugt den Text auch ohne Auszug, ohne `undefined` und ohne leeren Block
statusReason: expected 'Nachtlauf-Befund zu Karte #700 Paket …' not to contain 'undefined'

[Killed] ConditionalExpression
src/lib/nightRunHandoff.ts:82:7
     zeilen.push(`Fehlerklasse: ${NIGHT_RUN_ERROR_CLASS_TEXT[item.errorClass]}`)
   }
   // Truthiness statt `!== undefined`: Ein leerer Auszug ergaebe eine Zeile, die nichts sagt.
-  if (item.excerpt) {
+  if (false) {
     zeilen.push(`Auszug: ${item.excerpt}`)
   }
killedBy: buildHandoffText — gelbe und rote Arbeitspakete nennt zu einem roten Arbeitspaket Kartennummer, Zustand, Fehlerklasse und Auszug
statusReason: expected 'Nachtlauf-Befund zu Karte #700 Paket …' to contain '  HARTER STOPP: erfolgreiche Runde zu…'

[Killed] StringLiteral
src/lib/nightRunHandoff.ts:85:22
   if (item.excerpt) {
     zeilen.push(`Auszug: ${item.excerpt}`)
   }
-  return zeilen.join('\n')
+  return zeilen.join("")
 }
 
killedBy: buildHandoffText — gelbe und rote Arbeitspakete nennt die Karte ohne nachlaufendes Leerzeichen, wenn das Protokoll keinen Titel trug
statusReason: expected 'Nachtlauf-Befund zu Karte #700Zustand…' to match /#700$/
