[Killed] Regex
src/lib/nightRunLog.ts:103:17
 }
 
 /** `[ISO-Zeitstempel] Text` — so schreibt `log()` in `night.mjs`. */
-const PRAEFIX = /^\[(\d{4}-\d{2}-\d{2}T\d{2}:\d{2}:\d{2}\.\d{3}Z)\] (.*)$/
+const PRAEFIX = /^\[(\d{4}-\D{2}-\d{2}T\d{2}:\d{2}:\d{2}\.\d{3}Z)\] (.*)$/
 
 /** Der zweite Schreiber: `fail()` schreibt ohne Praefix und beendet den Lauf. */
killedBy: NightRunPage — Protokoll hineingeben erzeugt aus mehreren Läufen mehrere Auswertungen und überspringt Probeläufe
statusReason: Unable to find an element by: [data-testid="/^lauf-/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] Regex
src/lib/nightRunLog.ts:103:17
 }
 
 /** `[ISO-Zeitstempel] Text` — so schreibt `log()` in `night.mjs`. */
-const PRAEFIX = /^\[(\d{4}-\d{2}-\d{2}T\d{2}:\d{2}:\d{2}\.\d{3}Z)\] (.*)$/
+const PRAEFIX = /^\[(\d{4}-\d{2}-\d{2}T\d{2}:\d{2}:\d\.\d{3}Z)\] (.*)$/
 
 /** Der zweite Schreiber: `fail()` schreibt ohne Praefix und beendet den Lauf. */
killedBy: NightRunPage — Protokoll hineingeben erzeugt aus mehreren Läufen mehrere Auswertungen und überspringt Probeläufe
statusReason: Unable to find an element by: [data-testid="/^lauf-/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Survived] Regex
src/lib/nightRunLog.ts:106:14
 const PRAEFIX = /^\[(\d{4}-\d{2}-\d{2}T\d{2}:\d{2}:\d{2}\.\d{3}Z)\] (.*)$/
 
 /** Der zweite Schreiber: `fail()` schreibt ohne Praefix und beendet den Lauf. */
-const FAIL = /^Fehler: /
+const FAIL = /Fehler: /
 
 /** Ein Lauf beginnt hier — **unmittelbar** nach dem Praefix, nie als Teilzeichenkette. */

[Killed] Regex
src/lib/nightRunLog.ts:109:15
 const FAIL = /^Fehler: /
 
 /** Ein Lauf beginnt hier — **unmittelbar** nach dem Praefix, nie als Teilzeichenkette. */
-const START = /^Nacht-Runner startet \(Modus (\w+)/
+const START = /^Nacht-Runner startet \(Modus (\w)/
 
 /** Abschluss eines Laufs; `Dry-Run beendet` markiert ihn zugleich als Probelauf. */
killedBy: NightRunPage — Zustände, Kennzahlen und Auszüge kennzeichnet einen Prüf-Lauf als solchen
statusReason: Unable to find an element with the text: Prüf-Lauf. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<div
  class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation0 MuiPaper-root MuiPaper-outlined MuiPaper-rounded MuiAccordi

[Killed] Regex
src/lib/nightRunLog.ts:109:15
 const FAIL = /^Fehler: /
 
 /** Ein Lauf beginnt hier — **unmittelbar** nach dem Praefix, nie als Teilzeichenkette. */
-const START = /^Nacht-Runner startet \(Modus (\w+)/
+const START = /^Nacht-Runner startet \(Modus (\W+)/
 
 /** Abschluss eines Laufs; `Dry-Run beendet` markiert ihn zugleich als Probelauf. */
killedBy: NightRunPage — Protokoll hineingeben erzeugt aus mehreren Läufen mehrere Auswertungen und überspringt Probeläufe
statusReason: Unable to find an element by: [data-testid="/^lauf-/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Survived] Regex
src/lib/nightRunLog.ts:112:19
 const START = /^Nacht-Runner startet \(Modus (\w+)/
 
 /** Abschluss eines Laufs; `Dry-Run beendet` markiert ihn zugleich als Probelauf. */
-const ABSCHLUSS = /^(Nacht-Runner beendet|Nacht-Review beendet|Dry-Run beendet)/
+const ABSCHLUSS = /(Nacht-Runner beendet|Nacht-Review beendet|Dry-Run beendet)/
 const DRY_RUN = /^Dry-Run beendet/
 const STUFE = /beendet \(Stufe ([^)]+)\)/

[Killed] Regex
src/lib/nightRunLog.ts:114:15
 /** Abschluss eines Laufs; `Dry-Run beendet` markiert ihn zugleich als Probelauf. */
 const ABSCHLUSS = /^(Nacht-Runner beendet|Nacht-Review beendet|Dry-Run beendet)/
 const DRY_RUN = /^Dry-Run beendet/
-const STUFE = /beendet \(Stufe ([^)]+)\)/
+const STUFE = /beendet \(Stufe ([)]+)\)/
 
 /**
killedBy: parseNightRunLog — Pruef-Lauf erkennt den Modus und die Stufe
statusReason: expected undefined to be 'issue' // Object.is equality

[Killed] ArithmeticOperator
src/lib/nightRunLog.ts:120:54
  * Minuten aus einer Regex-Gruppe in Millisekunden. Der Runner schreibt sie mit
  * Nachkommastelle (`nach 8.8 min`) — an echten Protokollen belegt, nicht an Fixtures.
  */
-const minuten = (wert: string): number => Math.round(Number(wert) * 60_000)
+const minuten = (wert: string): number => Math.round(Number(wert) / 60_000)
 
 /** Was ein Muster ueber eine Zeile aussagt. */
killedBy: NightRunPage — Zustände, Kennzahlen und Auszüge zeigt Dauer und Stückzahlen je Lauf sowie die Dauer je Arbeitspaket, aber keine Kosten
statusReason: Unable to find an element with the text: 7 Min. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<div
  class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation0 MuiPaper-root MuiPaper-outlined MuiPaper-rounded MuiAccordion-r

[Killed] ArrowFunction
src/lib/nightRunLog.ts:120:17
  * Minuten aus einer Regex-Gruppe in Millisekunden. Der Runner schreibt sie mit
  * Nachkommastelle (`nach 8.8 min`) — an echten Protokollen belegt, nicht an Fixtures.
  */
-const minuten = (wert: string): number => Math.round(Number(wert) * 60_000)
+const minuten = () => undefined
 
 /** Was ein Muster ueber eine Zeile aussagt. */
killedBy: NightRunPage — Zustände, Kennzahlen und Auszüge zeigt Dauer und Stückzahlen je Lauf sowie die Dauer je Arbeitspaket, aber keine Kosten
statusReason: Unable to find an element with the text: 7 Min. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<div
  class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation0 MuiPaper-root MuiPaper-outlined MuiPaper-rounded MuiAccordion-r

[Killed] Regex
src/lib/nightRunLog.ts:143:9
 const MUSTER: ReadonlyArray<{ re: RegExp; deute: (m: RegExpExecArray) => Treffer }> = [
   // --- Implementierungs-Lauf, Ausgaenge je Arbeitspaket
   {
-    re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
+    re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min, Commit ([0-9a-f]{7,40}), Issue #(\d) in In review\./,
     deute: (m) => ({ cardNumber: Number(m[3]), state: "GREEN", durationMs: minuten(m[1]), commit: m[2] }),
   },
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg mit gruenen Pruefungen gruen
statusReason: expected { cardNumber: 100, …(5) } to match object { state: 'GREEN', …(2) }
(5 matching properties omitted from actual)

[Survived] Regex
src/lib/nightRunLog.ts:143:9
 const MUSTER: ReadonlyArray<{ re: RegExp; deute: (m: RegExpExecArray) => Treffer }> = [
   // --- Implementierungs-Lauf, Ausgaenge je Arbeitspaket
   {
-    re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
+    re: / {2}Erfolg nach (\d+(?:\.\d+)?) min, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
     deute: (m) => ({ cardNumber: Number(m[3]), state: "GREEN", durationMs: minuten(m[1]), commit: m[2] }),
   },

[Killed] ArrowFunction
src/lib/nightRunLog.ts:144:12
   // --- Implementierungs-Lauf, Ausgaenge je Arbeitspaket
   {
     re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
-    deute: (m) => ({ cardNumber: Number(m[3]), state: "GREEN", durationMs: minuten(m[1]), commit: m[2] }),
+    deute: () => undefined,
   },
   {
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg mit gruenen Pruefungen gruen
statusReason: Cannot read properties of undefined (reading 'cardNumber')

[Killed] ObjectLiteral
src/lib/nightRunLog.ts:144:20
   // --- Implementierungs-Lauf, Ausgaenge je Arbeitspaket
   {
     re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
-    deute: (m) => ({ cardNumber: Number(m[3]), state: "GREEN", durationMs: minuten(m[1]), commit: m[2] }),
+    deute: (m) => ({}),
   },
   {
killedBy: NightRunPage — Zustände, Kennzahlen und Auszüge macht jeden der vier Zustände am Text erkennbar, nicht nur an der Farbe
statusReason: Unable to find an element with the text: Erfolg. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<div
  class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation0 MuiPaper-root MuiPaper-outlined MuiPaper-rounded MuiAccordion-

[Killed] ObjectLiteral
src/lib/nightRunLog.ts:146:3
     re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
     deute: (m) => ({ cardNumber: Number(m[3]), state: "GREEN", durationMs: minuten(m[1]), commit: m[2] }),
   },
-  {
-    re: /^ {2}Salvage erfolgreich, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "GREEN", commit: m[1] }),
-  },
+  {},
   {
     re: /^ {2}FEHLSCHLAG nach (\d+(?:\.\d+)?) min: Issue #(\d+) nicht in In review UND Working Tree dirty/,
killedBy: parseNightRunLog — unvollstaendige Laeufe und harter Abbruch markiert einen Lauf ohne Abschlusszeile als incomplete
statusReason: Cannot read properties of undefined (reading 'exec')

[Killed] Regex
src/lib/nightRunLog.ts:147:9
     deute: (m) => ({ cardNumber: Number(m[3]), state: "GREEN", durationMs: minuten(m[1]), commit: m[2] }),
   },
   {
-    re: /^ {2}Salvage erfolgreich, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
+    re: /^ {2}Salvage erfolgreich, Commit ([0-9a-f]{7,40}), Issue #(\d) in In review\./,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "GREEN", commit: m[1] }),
   },
killedBy: parseNightRunLog — Fixture "vollstaendiger Lauf" deutet jede Runner-Zeile — unparsedCount ist 0
statusReason: expected 1 to be +0 // Object.is equality

[Killed] Regex
src/lib/nightRunLog.ts:147:9
     deute: (m) => ({ cardNumber: Number(m[3]), state: "GREEN", durationMs: minuten(m[1]), commit: m[2] }),
   },
   {
-    re: /^ {2}Salvage erfolgreich, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
+    re: /^ {2}Salvage erfolgreich, Commit ([0-9a-f]), Issue #(\d+) in In review\./,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "GREEN", commit: m[1] }),
   },
killedBy: parseNightRunLog — Fixture "vollstaendiger Lauf" deutet jede Runner-Zeile — unparsedCount ist 0
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrowFunction
src/lib/nightRunLog.ts:148:12
   },
   {
     re: /^ {2}Salvage erfolgreich, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "GREEN", commit: m[1] }),
+    deute: () => undefined,
   },
   {
killedBy: parseNightRunLog — Fixture "vollstaendiger Lauf" deutet jede Runner-Zeile — unparsedCount ist 0
statusReason: Cannot read properties of undefined (reading 'cardNumber')

[Killed] ObjectLiteral
src/lib/nightRunLog.ts:150:3
     re: /^ {2}Salvage erfolgreich, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "GREEN", commit: m[1] }),
   },
-  {
-    re: /^ {2}FEHLSCHLAG nach (\d+(?:\.\d+)?) min: Issue #(\d+) nicht in In review UND Working Tree dirty/,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
-  },
+  {},
   {
     re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d+) — die Session hat nichts hinterlassen/,
killedBy: parseNightRunLog — unvollstaendige Laeufe und harter Abbruch markiert einen Lauf ohne Abschlusszeile als incomplete
statusReason: Cannot read properties of undefined (reading 'exec')

[Killed] Regex
src/lib/nightRunLog.ts:151:9
     deute: (m) => ({ cardNumber: Number(m[2]), state: "GREEN", commit: m[1] }),
   },
   {
-    re: /^ {2}FEHLSCHLAG nach (\d+(?:\.\d+)?) min: Issue #(\d+) nicht in In review UND Working Tree dirty/,
+    re: /^ FEHLSCHLAG nach (\d+(?:\.\d+)?) min: Issue #(\d+) nicht in In review UND Working Tree dirty/,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
   },
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht einen Fehlschlag mit dirtyem Tree rot mit HARD_ABORT
statusReason: expected { cardNumber: 100, …(5) } to match object { state: 'RED', …(2) }
(4 matching properties omitted from actual)

[Killed] Regex
src/lib/nightRunLog.ts:151:9
     deute: (m) => ({ cardNumber: Number(m[2]), state: "GREEN", commit: m[1] }),
   },
   {
-    re: /^ {2}FEHLSCHLAG nach (\d+(?:\.\d+)?) min: Issue #(\d+) nicht in In review UND Working Tree dirty/,
+    re: /^ {2}FEHLSCHLAG nach (\D+(?:\.\d+)?) min: Issue #(\d+) nicht in In review UND Working Tree dirty/,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
   },
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht einen Fehlschlag mit dirtyem Tree rot mit HARD_ABORT
statusReason: expected { cardNumber: 100, …(5) } to match object { state: 'RED', …(2) }
(4 matching properties omitted from actual)

[Killed] ArrowFunction
src/lib/nightRunLog.ts:152:12
   },
   {
     re: /^ {2}FEHLSCHLAG nach (\d+(?:\.\d+)?) min: Issue #(\d+) nicht in In review UND Working Tree dirty/,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
+    deute: () => undefined,
   },
   {
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht einen Fehlschlag mit dirtyem Tree rot mit HARD_ABORT
statusReason: Cannot read properties of undefined (reading 'cardNumber')

[Killed] StringLiteral
src/lib/nightRunLog.ts:152:55
   },
   {
     re: /^ {2}FEHLSCHLAG nach (\d+(?:\.\d+)?) min: Issue #(\d+) nicht in In review UND Working Tree dirty/,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
+    deute: (m) => ({ cardNumber: Number(m[2]), state: "", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
   },
   {
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht einen Fehlschlag mit dirtyem Tree rot mit HARD_ABORT
statusReason: expected { cardNumber: 100, …(5) } to match object { state: 'RED', …(2) }
(4 matching properties omitted from actual)

[Killed] Regex
src/lib/nightRunLog.ts:155:9
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
   },
   {
-    re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d+) — die Session hat nichts hinterlassen/,
+    re: /^ {2}Fehlschlag nach (\D+(?:\.\d+)?) min: Issue #(\d+) — die Session hat nichts hinterlassen/,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "CHECKS_NOT_STARTED", durationMs: minuten(m[1]) }),
   },
killedBy: parseNightRunLog — Pruef-Lauf macht "die Session hat nichts hinterlassen" rot mit CHECKS_NOT_STARTED
statusReason: expected { cardNumber: 200, …(5) } to match object { state: 'RED', …(1) }
(4 matching properties omitted from actual)

[Killed] Regex
src/lib/nightRunLog.ts:155:9
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
   },
   {
-    re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d+) — die Session hat nichts hinterlassen/,
+    re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d) — die Session hat nichts hinterlassen/,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "CHECKS_NOT_STARTED", durationMs: minuten(m[1]) }),
   },
killedBy: parseNightRunLog — Pruef-Lauf macht "die Session hat nichts hinterlassen" rot mit CHECKS_NOT_STARTED
statusReason: expected { cardNumber: 200, …(5) } to match object { state: 'RED', …(1) }
(4 matching properties omitted from actual)

[Killed] ArrowFunction
src/lib/nightRunLog.ts:156:12
   },
   {
     re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d+) — die Session hat nichts hinterlassen/,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "CHECKS_NOT_STARTED", durationMs: minuten(m[1]) }),
+    deute: () => undefined,
   },
   {
killedBy: parseNightRunLog — Pruef-Lauf macht "die Session hat nichts hinterlassen" rot mit CHECKS_NOT_STARTED
statusReason: Cannot read properties of undefined (reading 'cardNumber')

[Killed] StringLiteral
src/lib/nightRunLog.ts:156:55
   },
   {
     re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d+) — die Session hat nichts hinterlassen/,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "CHECKS_NOT_STARTED", durationMs: minuten(m[1]) }),
+    deute: (m) => ({ cardNumber: Number(m[2]), state: "", errorClass: "CHECKS_NOT_STARTED", durationMs: minuten(m[1]) }),
   },
   {
killedBy: parseNightRunLog — Pruef-Lauf macht "die Session hat nichts hinterlassen" rot mit CHECKS_NOT_STARTED
statusReason: expected { cardNumber: 200, …(5) } to match object { state: 'RED', …(1) }
(4 matching properties omitted from actual)

[Killed] ObjectLiteral
src/lib/nightRunLog.ts:158:3
     re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d+) — die Session hat nichts hinterlassen/,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "CHECKS_NOT_STARTED", durationMs: minuten(m[1]) }),
   },
-  {
-    re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d+) nicht in In review, Tree sauber/,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "UNEXPECTED_STATE", durationMs: minuten(m[1]) }),
-  },
+  {},
   {
     re: /^ {2}INFRASTRUKTUR-FEHLSCHLAG nach (\d+(?:\.\d+)?) min .*Issue #(\d+) bleibt unangetastet\./,
killedBy: NightRunPage — Protokoll hineingeben erzeugt aus mehreren Läufen mehrere Auswertungen und überspringt Probeläufe
statusReason: Cannot read properties of undefined (reading 'exec')

[Killed] Regex
src/lib/nightRunLog.ts:159:9
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "CHECKS_NOT_STARTED", durationMs: minuten(m[1]) }),
   },
   {
-    re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d+) nicht in In review, Tree sauber/,
+    re: /^ Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d+) nicht in In review, Tree sauber/,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "UNEXPECTED_STATE", durationMs: minuten(m[1]) }),
   },
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht einen Fehlschlag bei sauberem Tree rot
statusReason: expected { cardNumber: 100, …(5) } to match object { state: 'RED', …(1) }
(4 matching properties omitted from actual)

[Killed] Regex
src/lib/nightRunLog.ts:159:9
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "CHECKS_NOT_STARTED", durationMs: minuten(m[1]) }),
   },
   {
-    re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d+) nicht in In review, Tree sauber/,
+    re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)) min: Issue #(\d+) nicht in In review, Tree sauber/,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "UNEXPECTED_STATE", durationMs: minuten(m[1]) }),
   },
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht einen Fehlschlag bei sauberem Tree rot
statusReason: expected { cardNumber: 100, …(5) } to match object { state: 'RED', …(1) }
(4 matching properties omitted from actual)

[Killed] ArrowFunction
src/lib/nightRunLog.ts:160:12
   },
   {
     re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d+) nicht in In review, Tree sauber/,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "UNEXPECTED_STATE", durationMs: minuten(m[1]) }),
+    deute: () => undefined,
   },
   {
killedBy: NightRunPage — Zustände, Kennzahlen und Auszüge macht jeden der vier Zustände am Text erkennbar, nicht nur an der Farbe
statusReason: Cannot read properties of undefined (reading 'cardNumber')

[Killed] StringLiteral
src/lib/nightRunLog.ts:160:74
   },
   {
     re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d+) nicht in In review, Tree sauber/,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "UNEXPECTED_STATE", durationMs: minuten(m[1]) }),
+    deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "", durationMs: minuten(m[1]) }),
   },
   {
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht einen Fehlschlag bei sauberem Tree rot
statusReason: expected { cardNumber: 100, …(6) } to match object { state: 'RED', …(1) }
(5 matching properties omitted from actual)

[Killed] ObjectLiteral
src/lib/nightRunLog.ts:162:3
     re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d+) nicht in In review, Tree sauber/,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "UNEXPECTED_STATE", durationMs: minuten(m[1]) }),
   },
-  {
-    re: /^ {2}INFRASTRUKTUR-FEHLSCHLAG nach (\d+(?:\.\d+)?) min .*Issue #(\d+) bleibt unangetastet\./,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
-  },
+  {},
   {
     re: /^ {2}HARTER STOPP: (?:erfolgreiche Runde zu|die Review-Session zu) Issue #(\d+)/,
killedBy: NightRunPage — Protokoll hineingeben erzeugt aus mehreren Läufen mehrere Auswertungen und überspringt Probeläufe
statusReason: Cannot read properties of undefined (reading 'exec')

[Survived] Regex
src/lib/nightRunLog.ts:163:9
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "UNEXPECTED_STATE", durationMs: minuten(m[1]) }),
   },
   {
-    re: /^ {2}INFRASTRUKTUR-FEHLSCHLAG nach (\d+(?:\.\d+)?) min .*Issue #(\d+) bleibt unangetastet\./,
+    re: /^ INFRASTRUKTUR-FEHLSCHLAG nach (\d+(?:\.\d+)?) min .*Issue #(\d+) bleibt unangetastet\./,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
   },

[Survived] Regex
src/lib/nightRunLog.ts:163:9
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "UNEXPECTED_STATE", durationMs: minuten(m[1]) }),
   },
   {
-    re: /^ {2}INFRASTRUKTUR-FEHLSCHLAG nach (\d+(?:\.\d+)?) min .*Issue #(\d+) bleibt unangetastet\./,
+    re: /^ {2}INFRASTRUKTUR-FEHLSCHLAG nach (\d+(?:\.\d+)) min .*Issue #(\d+) bleibt unangetastet\./,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
   },

[Killed] ArrowFunction
src/lib/nightRunLog.ts:164:12
   },
   {
     re: /^ {2}INFRASTRUKTUR-FEHLSCHLAG nach (\d+(?:\.\d+)?) min .*Issue #(\d+) bleibt unangetastet\./,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
+    deute: () => undefined,
   },
   {
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht einen Infrastruktur-Fehlschlag rot mit HARD_ABORT
statusReason: Cannot read properties of undefined (reading 'cardNumber')

[Survived] ObjectLiteral
src/lib/nightRunLog.ts:164:20
   },
   {
     re: /^ {2}INFRASTRUKTUR-FEHLSCHLAG nach (\d+(?:\.\d+)?) min .*Issue #(\d+) bleibt unangetastet\./,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
+    deute: (m) => ({}),
   },
   {

[Killed] ObjectLiteral
src/lib/nightRunLog.ts:166:3
     re: /^ {2}INFRASTRUKTUR-FEHLSCHLAG nach (\d+(?:\.\d+)?) min .*Issue #(\d+) bleibt unangetastet\./,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
   },
-  {
-    re: /^ {2}HARTER STOPP: (?:erfolgreiche Runde zu|die Review-Session zu) Issue #(\d+)/,
-    deute: (m) => ({ cardNumber: Number(m[1]), state: "RED", errorClass: "HARD_ABORT" }),
-  },
+  {},
   {
     re: /^ {2}SALVAGE-VERSUCH gescheitert — harter Stopp\. Issue #(\d+)/,
killedBy: NightRunPage — Protokoll hineingeben erzeugt aus mehreren Läufen mehrere Auswertungen und überspringt Probeläufe
statusReason: Cannot read properties of undefined (reading 'exec')

[Survived] Regex
src/lib/nightRunLog.ts:167:9
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
   },
   {
-    re: /^ {2}HARTER STOPP: (?:erfolgreiche Runde zu|die Review-Session zu) Issue #(\d+)/,
+    re: / {2}HARTER STOPP: (?:erfolgreiche Runde zu|die Review-Session zu) Issue #(\d+)/,
     deute: (m) => ({ cardNumber: Number(m[1]), state: "RED", errorClass: "HARD_ABORT" }),
   },

[Survived] Regex
src/lib/nightRunLog.ts:167:9
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
   },
   {
-    re: /^ {2}HARTER STOPP: (?:erfolgreiche Runde zu|die Review-Session zu) Issue #(\d+)/,
+    re: /^ {2}HARTER STOPP: (?:erfolgreiche Runde zu|die Review-Session zu) Issue #(\D+)/,
     deute: (m) => ({ cardNumber: Number(m[1]), state: "RED", errorClass: "HARD_ABORT" }),
   },

[Killed] ArrowFunction
src/lib/nightRunLog.ts:168:12
   },
   {
     re: /^ {2}HARTER STOPP: (?:erfolgreiche Runde zu|die Review-Session zu) Issue #(\d+)/,
-    deute: (m) => ({ cardNumber: Number(m[1]), state: "RED", errorClass: "HARD_ABORT" }),
+    deute: () => undefined,
   },
   {
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht unkommittete Reste nach einer erfolgreichen Runde rot mit HARD_ABORT
statusReason: Cannot read properties of undefined (reading 'cardNumber')

[Survived] StringLiteral
src/lib/nightRunLog.ts:168:55
   },
   {
     re: /^ {2}HARTER STOPP: (?:erfolgreiche Runde zu|die Review-Session zu) Issue #(\d+)/,
-    deute: (m) => ({ cardNumber: Number(m[1]), state: "RED", errorClass: "HARD_ABORT" }),
+    deute: (m) => ({ cardNumber: Number(m[1]), state: "", errorClass: "HARD_ABORT" }),
   },
   {

[Survived] Regex
src/lib/nightRunLog.ts:171:9
     deute: (m) => ({ cardNumber: Number(m[1]), state: "RED", errorClass: "HARD_ABORT" }),
   },
   {
-    re: /^ {2}SALVAGE-VERSUCH gescheitert — harter Stopp\. Issue #(\d+)/,
+    re: /^ SALVAGE-VERSUCH gescheitert — harter Stopp\. Issue #(\d+)/,
     deute: (m) => ({ cardNumber: Number(m[1]), state: "RED", errorClass: "HARD_ABORT" }),
   },

[Survived] Regex
src/lib/nightRunLog.ts:171:9
     deute: (m) => ({ cardNumber: Number(m[1]), state: "RED", errorClass: "HARD_ABORT" }),
   },
   {
-    re: /^ {2}SALVAGE-VERSUCH gescheitert — harter Stopp\. Issue #(\d+)/,
+    re: /^ {2}SALVAGE-VERSUCH gescheitert — harter Stopp\. Issue #(\d)/,
     deute: (m) => ({ cardNumber: Number(m[1]), state: "RED", errorClass: "HARD_ABORT" }),
   },

[Killed] ArrowFunction
src/lib/nightRunLog.ts:172:12
   },
   {
     re: /^ {2}SALVAGE-VERSUCH gescheitert — harter Stopp\. Issue #(\d+)/,
-    deute: (m) => ({ cardNumber: Number(m[1]), state: "RED", errorClass: "HARD_ABORT" }),
+    deute: () => undefined,
   },
 
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht einen gescheiterten Salvage-Versuch rot mit HARD_ABORT
statusReason: Cannot read properties of undefined (reading 'cardNumber')

[Killed] ObjectLiteral
src/lib/nightRunLog.ts:176:3
   },
 
   // --- Pruef-Lauf, Ausgaenge je Arbeitspaket
-  {
-    re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min: Issue #(\d+) geprueft (?:ohne|mit) Befund/,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "GREEN", durationMs: minuten(m[1]) }),
-  },
+  {},
   {
     re: /^ {2}Nach (\d+(?:\.\d+)?) min: Issue #(\d+) — Befunde vorhanden, aber kein Body-Vorschlag/,
killedBy: NightRunPage — Protokoll hineingeben erzeugt aus mehreren Läufen mehrere Auswertungen und überspringt Probeläufe
statusReason: Cannot read properties of undefined (reading 'exec')

[Killed] Regex
src/lib/nightRunLog.ts:177:9
 
   // --- Pruef-Lauf, Ausgaenge je Arbeitspaket
   {
-    re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min: Issue #(\d+) geprueft (?:ohne|mit) Befund/,
+    re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min: Issue #(\D+) geprueft (?:ohne|mit) Befund/,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "GREEN", durationMs: minuten(m[1]) }),
   },
killedBy: parseNightRunLog — Pruef-Lauf macht "geprueft ohne Befund" gruen
statusReason: expected 'RED' to be 'GREEN' // Object.is equality

[Killed] Regex
src/lib/nightRunLog.ts:177:9
 
   // --- Pruef-Lauf, Ausgaenge je Arbeitspaket
   {
-    re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min: Issue #(\d+) geprueft (?:ohne|mit) Befund/,
+    re: /^ Erfolg nach (\d+(?:\.\d+)?) min: Issue #(\d+) geprueft (?:ohne|mit) Befund/,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "GREEN", durationMs: minuten(m[1]) }),
   },
killedBy: parseNightRunLog — Pruef-Lauf macht "geprueft ohne Befund" gruen
statusReason: expected 'RED' to be 'GREEN' // Object.is equality

[Killed] ArrowFunction
src/lib/nightRunLog.ts:178:12
   // --- Pruef-Lauf, Ausgaenge je Arbeitspaket
   {
     re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min: Issue #(\d+) geprueft (?:ohne|mit) Befund/,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "GREEN", durationMs: minuten(m[1]) }),
+    deute: () => undefined,
   },
   {
killedBy: NightRunPage — Zustände, Kennzahlen und Auszüge kennzeichnet einen Prüf-Lauf als solchen
statusReason: Cannot read properties of undefined (reading 'cardNumber')
