[Killed] StringLiteral
src/lib/nightRunLog.ts:389:37
     a = null
   }
 
-  for (const rohzeile of text.split('\n')) {
+  for (const rohzeile of text.split("")) {
     const zeile = rohzeile.replace(/\r$/, '')
     const m = PRAEFIX.exec(zeile)
killedBy: parseNightRunLog — Zerlegung in Laeufe ignoriert Text vor der ersten Startzeile
statusReason: expected [] to have a length of 1 but got +0

[Survived] Regex
src/lib/nightRunLog.ts:390:36
   }
 
   for (const rohzeile of text.split('\n')) {
-    const zeile = rohzeile.replace(/\r$/, '')
+    const zeile = rohzeile.replace(/\r/, '')
     const m = PRAEFIX.exec(zeile)
 

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:393:9
     const zeile = rohzeile.replace(/\r$/, '')
     const m = PRAEFIX.exec(zeile)
 
-    if (!m) {
+    if (true) {
       // Der zweite Schreiber: `fail()` haengt kein Praefix an und beendet den Lauf.
       if (a && FAIL.test(zeile)) {
killedBy: parseNightRunLog — Zerlegung in Laeufe ignoriert Text vor der ersten Startzeile
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:395:11
 
     if (!m) {
       // Der zweite Schreiber: `fail()` haengt kein Praefix an und beendet den Lauf.
-      if (a && FAIL.test(zeile)) {
+      if (true) {
         a.runState = 'RED'
         a.runErrorClass = 'HARD_ABORT'
killedBy: NightRunPage — Protokoll hineingeben meldet ein Protokoll ohne jeden Lauf
statusReason: Unable to find an element with the text: Kein Nachtlauf-Protokoll erkannt. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:395:11
 
     if (!m) {
       // Der zweite Schreiber: `fail()` haengt kein Praefix an und beendet den Lauf.
-      if (a && FAIL.test(zeile)) {
+      if (false) {
         a.runState = 'RED'
         a.runErrorClass = 'HARD_ABORT'
killedBy: parseNightRunLog — unvollstaendige Laeufe und harter Abbruch deutet eine praefixlose Fehler-Zeile als harten Abbruch auf Lauf-Ebene, ohne sie als ungedeutet zu zaehlen
statusReason: expected undefined to be 'RED' // Object.is equality

[Survived] BooleanLiteral
src/lib/nightRunLog.ts:399:27
         a.runState = 'RED'
         a.runErrorClass = 'HARD_ABORT'
         a.runExcerpt = zeile
-        a.abgeschlossen = true
+        a.abgeschlossen = false
       }
       // Alles andere ohne Praefix ist Sitzungsstrom — weder gedeutet noch gezaehlt.

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:407:9
 
     const [, zeitstempel, inhalt] = m
     const start = START.exec(inhalt)
-    if (start) {
+    if (true) {
       schliesse()
       a = neuerAufbau(zeitstempel, start[1])
killedBy: NightRunPage — Protokoll hineingeben erzeugt aus mehreren Läufen mehrere Auswertungen und überspringt Probeläufe
statusReason: Cannot read properties of null (reading '1')

[Killed] BlockStatement
src/lib/nightRunLog.ts:407:16
 
     const [, zeitstempel, inhalt] = m
     const start = START.exec(inhalt)
-    if (start) {
-      schliesse()
-      a = neuerAufbau(zeitstempel, start[1])
-      continue
-    }
+    if (start) {}
     if (!a) continue // Runner-Zeilen vor dem ersten Start gehoeren zu keinem Lauf.
 
killedBy: NightRunPage — Protokoll hineingeben erzeugt aus mehreren Läufen mehrere Auswertungen und überspringt Probeläufe
statusReason: Unable to find an element by: [data-testid="/^lauf-/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:412:9
       a = neuerAufbau(zeitstempel, start[1])
       continue
     }
-    if (!a) continue // Runner-Zeilen vor dem ersten Start gehoeren zu keinem Lauf.
+    if (true) continue // Runner-Zeilen vor dem ersten Start gehoeren zu keinem Lauf.
 
     a.letzterZeitstempel = zeitstempel
killedBy: NightRunPage — Protokoll hineingeben erzeugt aus mehreren Läufen mehrere Auswertungen und überspringt Probeläufe
statusReason: expected [ <div …(3)>…(1)</div>, …(2) ] to have a length of 2 but got 3

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:412:9
       a = neuerAufbau(zeitstempel, start[1])
       continue
     }
-    if (!a) continue // Runner-Zeilen vor dem ersten Start gehoeren zu keinem Lauf.
+    if (false) continue // Runner-Zeilen vor dem ersten Start gehoeren zu keinem Lauf.
 
     a.letzterZeitstempel = zeitstempel
killedBy: parseNightRunLog — Zerlegung in Laeufe ignoriert auch eine Runner-Zeile mit Praefix vor dem ersten Start
statusReason: Cannot set properties of null (setting 'letzterZeitstempel')

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:415:9
     if (!a) continue // Runner-Zeilen vor dem ersten Start gehoeren zu keinem Lauf.
 
     a.letzterZeitstempel = zeitstempel
-    if (ABSCHLUSS.test(inhalt)) {
+    if (false) {
       a.abgeschlossen = true
       if (DRY_RUN.test(inhalt)) a.dryRun = true
killedBy: NightRunPage — Protokoll hineingeben erzeugt aus mehreren Läufen mehrere Auswertungen und überspringt Probeläufe
statusReason: expected [ <div …(3)>…(1)</div>, …(2) ] to have a length of 2 but got 3

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:415:9
     if (!a) continue // Runner-Zeilen vor dem ersten Start gehoeren zu keinem Lauf.
 
     a.letzterZeitstempel = zeitstempel
-    if (ABSCHLUSS.test(inhalt)) {
+    if (true) {
       a.abgeschlossen = true
       if (DRY_RUN.test(inhalt)) a.dryRun = true
killedBy: parseNightRunLog — unvollstaendige Laeufe und harter Abbruch markiert einen Lauf ohne Abschlusszeile als incomplete
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/nightRunLog.ts:416:25
 
     a.letzterZeitstempel = zeitstempel
     if (ABSCHLUSS.test(inhalt)) {
-      a.abgeschlossen = true
+      a.abgeschlossen = false
       if (DRY_RUN.test(inhalt)) a.dryRun = true
       a.stage = STUFE.exec(inhalt)?.[1] ?? a.stage
killedBy: parseNightRunLog — Zerlegung in Laeufe rechnet die Laufdauer aus Start- und Abschlusszeitstempel
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:417:11
     a.letzterZeitstempel = zeitstempel
     if (ABSCHLUSS.test(inhalt)) {
       a.abgeschlossen = true
-      if (DRY_RUN.test(inhalt)) a.dryRun = true
+      if (false) a.dryRun = true
       a.stage = STUFE.exec(inhalt)?.[1] ?? a.stage
     }
killedBy: parseNightRunLog — Probelaeufe und Laeufe ohne Session verwirft einen Probelauf und zaehlt ihn
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:417:11
     a.letzterZeitstempel = zeitstempel
     if (ABSCHLUSS.test(inhalt)) {
       a.abgeschlossen = true
-      if (DRY_RUN.test(inhalt)) a.dryRun = true
+      if (true) a.dryRun = true
       a.stage = STUFE.exec(inhalt)?.[1] ?? a.stage
     }
killedBy: parseNightRunLog — Zerlegung in Laeufe ignoriert Text vor der ersten Startzeile
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
src/lib/nightRunLog.ts:418:17
     if (ABSCHLUSS.test(inhalt)) {
       a.abgeschlossen = true
       if (DRY_RUN.test(inhalt)) a.dryRun = true
-      a.stage = STUFE.exec(inhalt)?.[1] ?? a.stage
+      a.stage = STUFE.exec(inhalt)?.[1] && a.stage
     }
 
killedBy: parseNightRunLog — Pruef-Lauf erkennt den Modus und die Stufe
statusReason: expected undefined to be 'issue' // Object.is equality

[Killed] OptionalChaining
src/lib/nightRunLog.ts:418:17
     if (ABSCHLUSS.test(inhalt)) {
       a.abgeschlossen = true
       if (DRY_RUN.test(inhalt)) a.dryRun = true
-      a.stage = STUFE.exec(inhalt)?.[1] ?? a.stage
+      a.stage = STUFE.exec(inhalt)[1] ?? a.stage
     }
 
killedBy: parseNightRunLog — Zerlegung in Laeufe ignoriert Text vor der ersten Startzeile
statusReason: Cannot read properties of null (reading '1')

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:421:9
       a.stage = STUFE.exec(inhalt)?.[1] ?? a.stage
     }
 
-    if (!deuteZeile(a, inhalt)) {
+    if (true) {
       a.unparsedCount++
       if (a.unparsedSample.length < 5) a.unparsedSample.push(inhalt)
killedBy: parseNightRunLog — Zerlegung in Laeufe ignoriert auch eine Runner-Zeile mit Praefix vor dem ersten Start
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:421:9
       a.stage = STUFE.exec(inhalt)?.[1] ?? a.stage
     }
 
-    if (!deuteZeile(a, inhalt)) {
+    if (false) {
       a.unparsedCount++
       if (a.unparsedSample.length < 5) a.unparsedSample.push(inhalt)
killedBy: NightRunPage — Protokoll hineingeben schickt die Auswertung hinaus, nie das Protokoll selbst
statusReason: expected '{"runs":[{"startedAt":"2026-09-01T22:…' to contain '"cardNumber":700'

[Killed] UpdateOperator
src/lib/nightRunLog.ts:422:7
     }
 
     if (!deuteZeile(a, inhalt)) {
-      a.unparsedCount++
+      a.unparsedCount--
       if (a.unparsedSample.length < 5) a.unparsedSample.push(inhalt)
     }
killedBy: parseNightRunLog — was als ungedeutet zaehlt zaehlt eine Runner-Zeile mit Praefix ohne passendes Muster und liefert einen Auszug
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:423:11
 
     if (!deuteZeile(a, inhalt)) {
       a.unparsedCount++
-      if (a.unparsedSample.length < 5) a.unparsedSample.push(inhalt)
+      if (true) a.unparsedSample.push(inhalt)
     }
   }
killedBy: parseNightRunLog — was als ungedeutet zaehlt nimmt hoechstens fuenf Zeilen in den Auszug auf, zaehlt aber alle
statusReason: expected [ 'Unbekannte Zeile 0', …(7) ] to have a length of 5 but got 8

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:423:11
 
     if (!deuteZeile(a, inhalt)) {
       a.unparsedCount++
-      if (a.unparsedSample.length < 5) a.unparsedSample.push(inhalt)
+      if (false) a.unparsedSample.push(inhalt)
     }
   }
killedBy: parseNightRunLog — was als ungedeutet zaehlt zaehlt eine Runner-Zeile mit Praefix ohne passendes Muster und liefert einen Auszug
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] ObjectLiteral
src/lib/nightRunLog.ts:428:10
   }
   schliesse()
 
-  return { runs, dryRunCount }
+  return {}
 }
 
killedBy: NightRunPage — Protokoll hineingeben erzeugt aus mehreren Läufen mehrere Auswertungen und überspringt Probeläufe
statusReason: Cannot read properties of undefined (reading 'map')
