[Killed] BlockStatement
src/lib/readTextFile.ts:12:59
  * Das Promise bricht mit einem Fehler ab, wenn die Datei nicht lesbar ist (z. B. Verzeichnis,
  * entzogene Berechtigung); der Aufrufer meldet das dem Nutzer.
  */
-export function readTextFile(file: Blob): Promise<string> {
-  return new Promise((resolve, reject) => {
-    const reader = new FileReader()
-    reader.onload = () => resolve(String(reader.result))
-    reader.onerror = () => reject(new Error('Datei konnte nicht gelesen werden.'))
-    reader.readAsText(file)
-  })
-}
+export function readTextFile(file: Blob): Promise<string> {}
 
killedBy: NightRunPage — Protokoll hineingeben erzeugt aus mehreren Läufen mehrere Auswertungen und überspringt Probeläufe
statusReason: Unable to find an element by: [data-testid="/^lauf-/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] BlockStatement
src/lib/readTextFile.ts:13:43
  * entzogene Berechtigung); der Aufrufer meldet das dem Nutzer.
  */
 export function readTextFile(file: Blob): Promise<string> {
-  return new Promise((resolve, reject) => {
-    const reader = new FileReader()
-    reader.onload = () => resolve(String(reader.result))
-    reader.onerror = () => reject(new Error('Datei konnte nicht gelesen werden.'))
-    reader.readAsText(file)
-  })
+  return new Promise((resolve, reject) => {})
 }
 
killedBy: NightRunPage — Protokoll hineingeben erzeugt aus mehreren Läufen mehrere Auswertungen und überspringt Probeläufe
statusReason: Unable to find an element by: [data-testid="/^lauf-/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] ArrowFunction
src/lib/readTextFile.ts:15:21
 export function readTextFile(file: Blob): Promise<string> {
   return new Promise((resolve, reject) => {
     const reader = new FileReader()
-    reader.onload = () => resolve(String(reader.result))
+    reader.onload = () => undefined
     reader.onerror = () => reject(new Error('Datei konnte nicht gelesen werden.'))
     reader.readAsText(file)
killedBy: NightRunPage — Protokoll hineingeben erzeugt aus mehreren Läufen mehrere Auswertungen und überspringt Probeläufe
statusReason: Unable to find an element by: [data-testid="/^lauf-/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] ArrowFunction
src/lib/readTextFile.ts:16:22
   return new Promise((resolve, reject) => {
     const reader = new FileReader()
     reader.onload = () => resolve(String(reader.result))
-    reader.onerror = () => reject(new Error('Datei konnte nicht gelesen werden.'))
+    reader.onerror = () => undefined
     reader.readAsText(file)
   })
killedBy: NightRunPage — Protokoll hineingeben meldet eine unlesbare Datei, ohne abzustürzen
statusReason: Unable to find an element with the text: Die Datei konnte nicht gelesen werden.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] StringLiteral
src/lib/readTextFile.ts:16:45
   return new Promise((resolve, reject) => {
     const reader = new FileReader()
     reader.onload = () => resolve(String(reader.result))
-    reader.onerror = () => reject(new Error('Datei konnte nicht gelesen werden.'))
+    reader.onerror = () => reject(new Error(""))
     reader.readAsText(file)
   })
killedBy: readTextFile bricht mit einem Fehler ab, wenn die Datei nicht lesbar ist
statusReason: expected [Function] to throw error including 'Datei konnte nicht gelesen werden.' but got ''
