[Killed] BlockStatement
src/lib/textLimits.ts:18:56
  * Bewusst ohne die Differenz: Sie ist aus beiden Zahlen ablesbar, und ein drittes Zahlenfeld im
  * Fehlertext wäre eine weitere Stelle, die auseinanderlaufen kann.
  */
-export function tooLongMessage(length: number): string {
-  const format = (value: number) => value.toLocaleString('de-DE')
-  return `${format(length)} / ${format(MAX_TEXT_LENGTH)} Zeichen`
-}
+export function tooLongMessage(length: number): string {}
 
 /** Ob der Text die Grenze reißt — dieselbe Prüfung für Feldzustand und Aktions-Sperre. */
killedBy: CardFields haelt eine zu lange Beschreibung vollstaendig und meldet die Ueberschreitung
statusReason: Unable to find an element with the text: 60.000 / 50.000 Zeichen. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiFormControl-root MuiFormControl-fullWidth MuiTextField-root css-cmpglg-MuiFormControl-roo

[Killed] ArrowFunction
src/lib/textLimits.ts:19:18
  * Fehlertext wäre eine weitere Stelle, die auseinanderlaufen kann.
  */
 export function tooLongMessage(length: number): string {
-  const format = (value: number) => value.toLocaleString('de-DE')
+  const format = () => undefined
   return `${format(length)} / ${format(MAX_TEXT_LENGTH)} Zeichen`
 }
killedBy: CardDetailModal sperrt Senden und meldet die Ueberschreitung bei einem zu langen neuen Kommentar
statusReason: Unable to find an element with the text: 60.000 / 50.000 Zeichen. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="padding-right: 1024px; overflow: hidden;"
>
  <div
    aria-hidden="true"

[Killed] StringLiteral
src/lib/textLimits.ts:19:58
  * Fehlertext wäre eine weitere Stelle, die auseinanderlaufen kann.
  */
 export function tooLongMessage(length: number): string {
-  const format = (value: number) => value.toLocaleString('de-DE')
+  const format = (value: number) => value.toLocaleString("")
   return `${format(length)} / ${format(MAX_TEXT_LENGTH)} Zeichen`
 }
killedBy: CardDetailModal sperrt Senden und meldet die Ueberschreitung bei einem zu langen neuen Kommentar
statusReason: Unable to find a label with the text of: Kommentar schreiben

Ignored nodes: comments, script, style
<body
  style=""
>
  <div />
</body>

[Killed] StringLiteral
src/lib/textLimits.ts:20:10
  */
 export function tooLongMessage(length: number): string {
   const format = (value: number) => value.toLocaleString('de-DE')
-  return `${format(length)} / ${format(MAX_TEXT_LENGTH)} Zeichen`
+  return ``
 }
 
killedBy: CardDetailModal sperrt Senden und meldet die Ueberschreitung bei einem zu langen neuen Kommentar
statusReason: Unable to find an element with the text: 60.000 / 50.000 Zeichen. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="padding-right: 1024px; overflow: hidden;"
>
  <div
    aria-hidden="true"

[Killed] BlockStatement
src/lib/textLimits.ts:24:50
 }
 
 /** Ob der Text die Grenze reißt — dieselbe Prüfung für Feldzustand und Aktions-Sperre. */
-export function isTooLong(text: string): boolean {
-  return text.length > MAX_TEXT_LENGTH
-}
+export function isTooLong(text: string): boolean {}
 
killedBy: CardFields haelt eine zu lange Beschreibung vollstaendig und meldet die Ueberschreitung
statusReason: Unable to find an element with the text: 60.000 / 50.000 Zeichen. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiFormControl-root MuiFormControl-fullWidth MuiTextField-root css-cmpglg-MuiFormControl-roo

[Killed] EqualityOperator
src/lib/textLimits.ts:25:10
 
 /** Ob der Text die Grenze reißt — dieselbe Prüfung für Feldzustand und Aktions-Sperre. */
 export function isTooLong(text: string): boolean {
-  return text.length > MAX_TEXT_LENGTH
+  return text.length <= MAX_TEXT_LENGTH
 }
 
killedBy: CardDetailModal legt einen Kommentar an
statusReason: expected "spy" to be called with arguments: [ 100, 'Neu' ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/lib/textLimits.ts:25:10
 
 /** Ob der Text die Grenze reißt — dieselbe Prüfung für Feldzustand und Aktions-Sperre. */
 export function isTooLong(text: string): boolean {
-  return text.length > MAX_TEXT_LENGTH
+  return false
 }
 
killedBy: CardDetailModal sperrt Senden und meldet die Ueberschreitung bei einem zu langen neuen Kommentar
statusReason: Unable to find an element with the text: 60.000 / 50.000 Zeichen. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  style="padding-right: 1024px; overflow: hidden;"
>
  <div
    aria-hidden="true"
