[Killed] BlockStatement
src/lib/useBoardEvents.ts:22:77
  * Die aktuelle `onChange`-Referenz wird über ein Ref gehalten, damit der Stream nicht bei jeder
  * Neudefinition der Callback-Funktion neu geöffnet werden muss (nur `boardId` steuert das).
  */
-export function useBoardEvents(boardId: number, onChange: () => void): void {
-  const ref = useRef(onChange)
-  useEffect(() => {
-    ref.current = onChange
-  })
-
-  useEffect(() => {
-    if (!Number.isInteger(boardId) || boardId <= 0) {
-      return
-    }
-    const source = new EventSource(`/api/boards/${boardId}/events`)
-    let timer: ReturnType<typeof setTimeout> | undefined
-    const onChanged = () => {
-      clearTimeout(timer)
-      timer = setTimeout(() => ref.current(), DEBOUNCE_MS)
-    }
-    source.addEventListener('board-changed', onChanged)
-    return () => {
-      clearTimeout(timer)
-      source.removeEventListener('board-changed', onChanged)
-      source.close()
-    }
-  }, [boardId])
-}
+export function useBoardEvents(boardId: number, onChange: () => void): void {}
 
killedBy: useBoardEvents öffnet den SSE-Stream für das Board
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/lib/useBoardEvents.ts:24:19
  */
 export function useBoardEvents(boardId: number, onChange: () => void): void {
   const ref = useRef(onChange)
-  useEffect(() => {
-    ref.current = onChange
-  })
+  useEffect(() => {})
 
   useEffect(() => {
killedBy: useBoardEvents nutzt die aktuelle onChange-Referenz ohne den Stream neu zu öffnen
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/lib/useBoardEvents.ts:28:19
     ref.current = onChange
   })
 
-  useEffect(() => {
-    if (!Number.isInteger(boardId) || boardId <= 0) {
-      return
-    }
-    const source = new EventSource(`/api/boards/${boardId}/events`)
-    let timer: ReturnType<typeof setTimeout> | undefined
-    const onChanged = () => {
-      clearTimeout(timer)
-      timer = setTimeout(() => ref.current(), DEBOUNCE_MS)
-    }
-    source.addEventListener('board-changed', onChanged)
-    return () => {
-      clearTimeout(timer)
-      source.removeEventListener('board-changed', onChanged)
-      source.close()
-    }
-  }, [boardId])
+  useEffect(() => {}, [boardId])
 }
 
killedBy: useBoardEvents öffnet den SSE-Stream für das Board
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/lib/useBoardEvents.ts:29:39
   })
 
   useEffect(() => {
-    if (!Number.isInteger(boardId) || boardId <= 0) {
+    if (!Number.isInteger(boardId) || boardId < 0) {
       return
     }
killedBy: useBoardEvents öffnet keinen Stream bei ungültiger Board-ID
statusReason: expected [ MockEventSource{ …(3) } ] to have a length of +0 but got 1

[Killed] BooleanLiteral
src/lib/useBoardEvents.ts:29:9
   })
 
   useEffect(() => {
-    if (!Number.isInteger(boardId) || boardId <= 0) {
+    if (Number.isInteger(boardId) || boardId <= 0) {
       return
     }
killedBy: useBoardEvents öffnet den SSE-Stream für das Board
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
src/lib/useBoardEvents.ts:32:36
     if (!Number.isInteger(boardId) || boardId <= 0) {
       return
     }
-    const source = new EventSource(`/api/boards/${boardId}/events`)
+    const source = new EventSource(``)
     let timer: ReturnType<typeof setTimeout> | undefined
     const onChanged = () => {
killedBy: useBoardEvents öffnet den SSE-Stream für das Board
statusReason: expected '' to be '/api/boards/7/events' // Object.is equality

[Killed] BlockStatement
src/lib/useBoardEvents.ts:34:29
     }
     const source = new EventSource(`/api/boards/${boardId}/events`)
     let timer: ReturnType<typeof setTimeout> | undefined
-    const onChanged = () => {
-      clearTimeout(timer)
-      timer = setTimeout(() => ref.current(), DEBOUNCE_MS)
-    }
+    const onChanged = () => {}
     source.addEventListener('board-changed', onChanged)
     return () => {
killedBy: useBoardEvents ruft onChange debounced bei einem Event (mehrere Events → ein Refetch)
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ArrowFunction
src/lib/useBoardEvents.ts:36:26
     let timer: ReturnType<typeof setTimeout> | undefined
     const onChanged = () => {
       clearTimeout(timer)
-      timer = setTimeout(() => ref.current(), DEBOUNCE_MS)
+      timer = setTimeout(() => undefined, DEBOUNCE_MS)
     }
     source.addEventListener('board-changed', onChanged)
killedBy: useBoardEvents ruft onChange debounced bei einem Event (mehrere Events → ein Refetch)
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] StringLiteral
src/lib/useBoardEvents.ts:38:29
       clearTimeout(timer)
       timer = setTimeout(() => ref.current(), DEBOUNCE_MS)
     }
-    source.addEventListener('board-changed', onChanged)
+    source.addEventListener("", onChanged)
     return () => {
       clearTimeout(timer)
killedBy: useBoardEvents ruft onChange debounced bei einem Event (mehrere Events → ein Refetch)
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/lib/useBoardEvents.ts:39:18
       timer = setTimeout(() => ref.current(), DEBOUNCE_MS)
     }
     source.addEventListener('board-changed', onChanged)
-    return () => {
-      clearTimeout(timer)
-      source.removeEventListener('board-changed', onChanged)
-      source.close()
-    }
+    return () => {}
   }, [boardId])
 }
killedBy: useBoardEvents schließt den Stream beim Unmount und feuert danach nicht mehr
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/lib/useBoardEvents.ts:44:6
       source.removeEventListener('board-changed', onChanged)
       source.close()
     }
-  }, [boardId])
+  }, [])
 }
 
killedBy: useBoardEvents schließt den alten und öffnet einen neuen Stream bei Board-Wechsel
statusReason: expected false to be true // Object.is equality
