[Killed] BlockStatement
src/lib/useBoardRole.ts:13:3
   effectiveRole: string
   canEdit: boolean
   canModerate: boolean
-} {
-  return useProjectRole(board?.projectId ?? null)
-}
+} {}
 
killedBy: BoardListPage zeigt den Breadcrumb-Pfad ab Projekte
statusReason: Cannot destructure property 'canEdit' of 'useBoardRole(...)' as it is undefined.

[Killed] OptionalChaining
src/lib/useBoardRole.ts:14:25
   canEdit: boolean
   canModerate: boolean
 } {
-  return useProjectRole(board?.projectId ?? null)
+  return useProjectRole(board.projectId ?? null)
 }
 
killedBy: BoardListPage zeigt den Breadcrumb-Pfad ab Projekte
statusReason: Cannot read properties of null (reading 'projectId')

[Killed] LogicalOperator
src/lib/useBoardRole.ts:14:25
   canEdit: boolean
   canModerate: boolean
 } {
-  return useProjectRole(board?.projectId ?? null)
+  return useProjectRole(board?.projectId && null)
 }
 
killedBy: BoardListPage zeigt den Breadcrumb-Pfad ab Projekte
statusReason: Cannot read properties of null (reading 'role')
