[Killed] BlockStatement
src/lib/useKeyboardShortcut.ts:10:59
  * Editierbarer Inhalt wird über `closest` statt über `isContentEditable` erkannt: Der Cursor steht
  * meist in einem Kindelement des editierbaren Containers, und jsdom kennt `isContentEditable` nicht.
  */
-function isTextEntry(target: EventTarget | null): boolean {
-  if (!(target instanceof HTMLElement)) {
-    return false
-  }
-  return (
-    ['INPUT', 'TEXTAREA', 'SELECT'].includes(target.tagName) ||
-    target.closest('[contenteditable]:not([contenteditable="false"])') !== null
-  )
-}
+function isTextEntry(target: EventTarget | null): boolean {}
 
 /**
killedBy: AppShell Board-Wechsel löst die Taste b in einem Eingabefeld nicht aus
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/lib/useKeyboardShortcut.ts:11:7
  * meist in einem Kindelement des editierbaren Containers, und jsdom kennt `isContentEditable` nicht.
  */
 function isTextEntry(target: EventTarget | null): boolean {
-  if (!(target instanceof HTMLElement)) {
+  if (target instanceof HTMLElement) {
     return false
   }
killedBy: CardNumberSearch fokussiert das Feld über das Tastenkürzel „/"
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <input
  aria-invalid="false"
  aria-label="Kartennummer suchen"
  class="MuiInputBase-input MuiOutlinedInput-input MuiInputBase-inputSizeSmall MuiInputBase-inputAdornedEnd css-13meb6w-MuiInputBase-input-MuiOutlinedInput-input"
  id=":r2:"

[Killed] BlockStatement
src/lib/useKeyboardShortcut.ts:11:41
  * meist in einem Kindelement des editierbaren Containers, und jsdom kennt `isContentEditable` nicht.
  */
 function isTextEntry(target: EventTarget | null): boolean {
-  if (!(target instanceof HTMLElement)) {
-    return false
-  }
+  if (!(target instanceof HTMLElement)) {}
   return (
     ['INPUT', 'TEXTAREA', 'SELECT'].includes(target.tagName) ||
killedBy: AppShell Board-Wechsel öffnet das Overlay mit der Taste b
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/useKeyboardShortcut.ts:12:12
  */
 function isTextEntry(target: EventTarget | null): boolean {
   if (!(target instanceof HTMLElement)) {
-    return false
+    return true
   }
   return (
killedBy: AppShell Board-Wechsel öffnet das Overlay mit der Taste b
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/useKeyboardShortcut.ts:15:5
     return false
   }
   return (
-    ['INPUT', 'TEXTAREA', 'SELECT'].includes(target.tagName) ||
-    target.closest('[contenteditable]:not([contenteditable="false"])') !== null
+    false
   )
 }
killedBy: BoardView Tastenkürzel „+“ greift nicht, solange der Fokus in einem Eingabefeld steht
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h2
  class="MuiTypography-root MuiTypography-h6 MuiDialogTitle-root css-e6pwpl-MuiTypography-root-MuiDialogTitle-root"
  id="new-card-title"
>
  Neue Karte in „Backlog“
</h2> instead

[Killed] LogicalOperator
src/lib/useKeyboardShortcut.ts:15:5
     return false
   }
   return (
-    ['INPUT', 'TEXTAREA', 'SELECT'].includes(target.tagName) ||
-    target.closest('[contenteditable]:not([contenteditable="false"])') !== null
+    ['INPUT', 'TEXTAREA', 'SELECT'].includes(target.tagName) && target.closest('[contenteditable]:not([contenteditable="false"])') !== null
   )
 }
killedBy: AppShell Board-Wechsel löst die Taste b in einem Eingabefeld nicht aus
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/lib/useKeyboardShortcut.ts:16:5
   }
   return (
     ['INPUT', 'TEXTAREA', 'SELECT'].includes(target.tagName) ||
-    target.closest('[contenteditable]:not([contenteditable="false"])') !== null
+    target.closest('[contenteditable]:not([contenteditable="false"])') === null
   )
 }
killedBy: useKeyboardShortcut ruft den Handler bei der gebundenen Taste auf
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/lib/useKeyboardShortcut.ts:16:5
   }
   return (
     ['INPUT', 'TEXTAREA', 'SELECT'].includes(target.tagName) ||
-    target.closest('[contenteditable]:not([contenteditable="false"])') !== null
+    false
   )
 }
killedBy: useKeyboardShortcut greift nicht in editierbarem Inhalt, auch nicht in dessen Kindelementen
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array []

[Killed] BlockStatement
src/lib/useKeyboardShortcut.ts:42:19
   // Der Handler liegt in einer Ref, damit ein neu erzeugtes Callback je Render den Listener nicht
   // ab- und wieder anmeldet — der Aufruf greift trotzdem stets auf den aktuellen Zustand zu.
   const handler = useRef(onTrigger)
-  useEffect(() => {
-    handler.current = onTrigger
-  })
+  useEffect(() => {})
 
   useEffect(() => {
killedBy: useKeyboardShortcut nutzt die aktuelle Handler-Referenz ohne neu anzumelden
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/lib/useKeyboardShortcut.ts:46:19
     handler.current = onTrigger
   })
 
-  useEffect(() => {
-    if (!enabled) {
-      return
-    }
-    const listener = (event: KeyboardEvent) => {
-      const blocked =
-        event.key !== key ||
-        event.ctrlKey ||
-        event.altKey ||
-        event.metaKey ||
-        isTextEntry(event.target) ||
-        document.querySelector('[role="dialog"]') !== null
-      if (!blocked) {
-        // Greift das Kürzel, darf das Zeichen nicht zusätzlich irgendwo landen: Der Handler setzt
-        // den Fokus mitunter in ein Eingabefeld (Suchfeld, Dialog), und der Browser tippte das
-        // Zeichen sonst genau dort ein, nachdem der Handler gelaufen ist.
-        event.preventDefault()
-        handler.current()
-      }
-    }
-    document.addEventListener('keydown', listener)
-    return () => document.removeEventListener('keydown', listener)
-  }, [key, enabled])
+  useEffect(() => {}, [key, enabled])
 }
 
killedBy: useKeyboardShortcut ruft den Handler bei der gebundenen Taste auf
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/lib/useKeyboardShortcut.ts:47:9
   })
 
   useEffect(() => {
-    if (!enabled) {
+    if (enabled) {
       return
     }
killedBy: useKeyboardShortcut ruft den Handler bei der gebundenen Taste auf
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/lib/useKeyboardShortcut.ts:47:9
   })
 
   useEffect(() => {
-    if (!enabled) {
+    if (true) {
       return
     }
killedBy: useKeyboardShortcut ruft den Handler bei der gebundenen Taste auf
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/lib/useKeyboardShortcut.ts:50:48
     if (!enabled) {
       return
     }
-    const listener = (event: KeyboardEvent) => {
-      const blocked =
-        event.key !== key ||
-        event.ctrlKey ||
-        event.altKey ||
-        event.metaKey ||
-        isTextEntry(event.target) ||
-        document.querySelector('[role="dialog"]') !== null
-      if (!blocked) {
-        // Greift das Kürzel, darf das Zeichen nicht zusätzlich irgendwo landen: Der Handler setzt
-        // den Fokus mitunter in ein Eingabefeld (Suchfeld, Dialog), und der Browser tippte das
-        // Zeichen sonst genau dort ein, nachdem der Handler gelaufen ist.
-        event.preventDefault()
-        handler.current()
-      }
-    }
+    const listener = (event: KeyboardEvent) => {}
     document.addEventListener('keydown', listener)
     return () => document.removeEventListener('keydown', listener)
killedBy: useKeyboardShortcut ruft den Handler bei der gebundenen Taste auf
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] LogicalOperator
src/lib/useKeyboardShortcut.ts:52:9
     }
     const listener = (event: KeyboardEvent) => {
       const blocked =
-        event.key !== key ||
-        event.ctrlKey ||
-        event.altKey ||
+        (event.key !== key || event.ctrlKey) && event.altKey ||
         event.metaKey ||
         isTextEntry(event.target) ||
killedBy: useKeyboardShortcut ignoriert eine andere Taste
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array []

[Killed] EqualityOperator
src/lib/useKeyboardShortcut.ts:52:9
     }
     const listener = (event: KeyboardEvent) => {
       const blocked =
-        event.key !== key ||
+        event.key === key ||
         event.ctrlKey ||
         event.altKey ||
killedBy: useKeyboardShortcut ruft den Handler bei der gebundenen Taste auf
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/lib/useKeyboardShortcut.ts:57:9
         event.altKey ||
         event.metaKey ||
         isTextEntry(event.target) ||
-        document.querySelector('[role="dialog"]') !== null
+        false
       if (!blocked) {
         // Greift das Kürzel, darf das Zeichen nicht zusätzlich irgendwo landen: Der Handler setzt
killedBy: useKeyboardShortcut greift nicht, solange ein Dialog offen ist
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array []

[Killed] EqualityOperator
src/lib/useKeyboardShortcut.ts:57:9
         event.altKey ||
         event.metaKey ||
         isTextEntry(event.target) ||
-        document.querySelector('[role="dialog"]') !== null
+        document.querySelector('[role="dialog"]') === null
       if (!blocked) {
         // Greift das Kürzel, darf das Zeichen nicht zusätzlich irgendwo landen: Der Handler setzt
killedBy: useKeyboardShortcut ruft den Handler bei der gebundenen Taste auf
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/lib/useKeyboardShortcut.ts:58:11
         event.metaKey ||
         isTextEntry(event.target) ||
         document.querySelector('[role="dialog"]') !== null
-      if (!blocked) {
+      if (true) {
         // Greift das Kürzel, darf das Zeichen nicht zusätzlich irgendwo landen: Der Handler setzt
         // den Fokus mitunter in ein Eingabefeld (Suchfeld, Dialog), und der Browser tippte das
killedBy: useKeyboardShortcut lässt die Standardwirkung unangetastet, wenn das Kürzel nicht greift
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/useKeyboardShortcut.ts:58:11
         event.metaKey ||
         isTextEntry(event.target) ||
         document.querySelector('[role="dialog"]') !== null
-      if (!blocked) {
+      if (false) {
         // Greift das Kürzel, darf das Zeichen nicht zusätzlich irgendwo landen: Der Handler setzt
         // den Fokus mitunter in ein Eingabefeld (Suchfeld, Dialog), und der Browser tippte das
killedBy: useKeyboardShortcut ruft den Handler bei der gebundenen Taste auf
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ArrowFunction
src/lib/useKeyboardShortcut.ts:67:12
       }
     }
     document.addEventListener('keydown', listener)
-    return () => document.removeEventListener('keydown', listener)
+    return () => undefined
   }, [key, enabled])
 }
killedBy: useKeyboardShortcut meldet den Listener beim Unmount wieder ab
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array []

[Killed] StringLiteral
src/lib/useKeyboardShortcut.ts:67:47
       }
     }
     document.addEventListener('keydown', listener)
-    return () => document.removeEventListener('keydown', listener)
+    return () => document.removeEventListener("", listener)
   }, [key, enabled])
 }
killedBy: useKeyboardShortcut meldet den Listener beim Unmount wieder ab
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array []
