[Killed] BlockStatement
src/lib/useProjectIdeaEvents.ts:23:85
  * Die aktuelle `onChange`-Referenz wird über ein Ref gehalten, damit der Stream nicht bei jeder
  * Neudefinition der Callback-Funktion neu geöffnet werden muss (nur `projectId` steuert das).
  */
-export function useProjectIdeaEvents(projectId: number, onChange: () => void): void {
-  const ref = useRef(onChange)
-  useEffect(() => {
-    ref.current = onChange
-  })
-
-  useEffect(() => {
-    if (!Number.isInteger(projectId) || projectId <= 0) {
-      return
-    }
-    const source = new EventSource(`/api/projects/${projectId}/ideas/events`)
-    let timer: ReturnType<typeof setTimeout> | undefined
-    const onChanged = () => {
-      clearTimeout(timer)
-      timer = setTimeout(() => ref.current(), DEBOUNCE_MS)
-    }
-    source.addEventListener('project-ideas-changed', onChanged)
-    return () => {
-      clearTimeout(timer)
-      source.removeEventListener('project-ideas-changed', onChanged)
-      source.close()
-    }
-  }, [projectId])
-}
+export function useProjectIdeaEvents(projectId: number, onChange: () => void): void {}
 
killedBy: IdeasPage abonniert den Ideen-Stream und erhöht bei einem Live-Event den Reload-Impuls
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/lib/useProjectIdeaEvents.ts:29:19
     ref.current = onChange
   })
 
-  useEffect(() => {
-    if (!Number.isInteger(projectId) || projectId <= 0) {
-      return
-    }
-    const source = new EventSource(`/api/projects/${projectId}/ideas/events`)
-    let timer: ReturnType<typeof setTimeout> | undefined
-    const onChanged = () => {
-      clearTimeout(timer)
-      timer = setTimeout(() => ref.current(), DEBOUNCE_MS)
-    }
-    source.addEventListener('project-ideas-changed', onChanged)
-    return () => {
-      clearTimeout(timer)
-      source.removeEventListener('project-ideas-changed', onChanged)
-      source.close()
-    }
-  }, [projectId])
+  useEffect(() => {}, [projectId])
 }
 
killedBy: IdeasPage abonniert den Ideen-Stream und erhöht bei einem Live-Event den Reload-Impuls
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
src/lib/useProjectIdeaEvents.ts:30:9
   })
 
   useEffect(() => {
-    if (!Number.isInteger(projectId) || projectId <= 0) {
+    if (Number.isInteger(projectId) || projectId <= 0) {
       return
     }
killedBy: IdeasPage abonniert den Ideen-Stream und erhöht bei einem Live-Event den Reload-Impuls
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/lib/useProjectIdeaEvents.ts:30:57
   })
 
   useEffect(() => {
-    if (!Number.isInteger(projectId) || projectId <= 0) {
-      return
-    }
+    if (!Number.isInteger(projectId) || projectId <= 0) {}
     const source = new EventSource(`/api/projects/${projectId}/ideas/events`)
     let timer: ReturnType<typeof setTimeout> | undefined
killedBy: IdeasPage abonniert keinen Stream bei ungültiger Projekt-ID
statusReason: expected [ MockEventSource{ …(3) } ] to have a length of +0 but got 1

[Killed] StringLiteral
src/lib/useProjectIdeaEvents.ts:33:36
     if (!Number.isInteger(projectId) || projectId <= 0) {
       return
     }
-    const source = new EventSource(`/api/projects/${projectId}/ideas/events`)
+    const source = new EventSource(``)
     let timer: ReturnType<typeof setTimeout> | undefined
     const onChanged = () => {
killedBy: IdeasPage abonniert den Ideen-Stream und erhöht bei einem Live-Event den Reload-Impuls
statusReason: expected '' to be '/api/projects/5/ideas/events' // Object.is equality

[Killed] StringLiteral
src/lib/useProjectIdeaEvents.ts:39:29
       clearTimeout(timer)
       timer = setTimeout(() => ref.current(), DEBOUNCE_MS)
     }
-    source.addEventListener('project-ideas-changed', onChanged)
+    source.addEventListener("", onChanged)
     return () => {
       clearTimeout(timer)
killedBy: useProjectIdeaEvents ruft onChange debounced bei einem Event (mehrere Events → ein Refetch)
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/lib/useProjectIdeaEvents.ts:40:18
       timer = setTimeout(() => ref.current(), DEBOUNCE_MS)
     }
     source.addEventListener('project-ideas-changed', onChanged)
-    return () => {
-      clearTimeout(timer)
-      source.removeEventListener('project-ideas-changed', onChanged)
-      source.close()
-    }
+    return () => {}
   }, [projectId])
 }
killedBy: useProjectIdeaEvents schließt den Stream beim Unmount und feuert danach nicht mehr
statusReason: expected false to be true // Object.is equality
