[Killed] BlockStatement
src/lib/useProjectName.ts:10:73
  * Quelle ist `projectsApi.list()` — dieselbe Liste, aus der die Seiten auch die Projektrolle
  * auflösen.
  */
-export function useProjectName(projectId: number | null): string | null {
-  const [name, setName] = useState<string | null>(null)
-  useEffect(() => {
-    if (projectId == null) {
-      setName(null)
-      return
-    }
-    let active = true
-    void projectsApi.list().then((ps) => {
-      if (active) {
-        setName(ps.find((p) => p.id === projectId)?.name ?? null)
-      }
-    })
-    return () => {
-      active = false
-    }
-  }, [projectId])
-  return name
-}
+export function useProjectName(projectId: number | null): string | null {}
 
killedBy: useProjectName liefert den Namen des passenden Projekts
statusReason: expected undefined to be 'Team' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/lib/useProjectName.ts:12:19
  */
 export function useProjectName(projectId: number | null): string | null {
   const [name, setName] = useState<string | null>(null)
-  useEffect(() => {
-    if (projectId == null) {
-      setName(null)
-      return
-    }
-    let active = true
-    void projectsApi.list().then((ps) => {
-      if (active) {
-        setName(ps.find((p) => p.id === projectId)?.name ?? null)
-      }
-    })
-    return () => {
-      active = false
-    }
-  }, [projectId])
+  useEffect(() => {}, [projectId])
   return name
 }
killedBy: useProjectName liefert den Namen des passenden Projekts
statusReason: expected null to be 'Team' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/lib/useProjectName.ts:13:28
 export function useProjectName(projectId: number | null): string | null {
   const [name, setName] = useState<string | null>(null)
   useEffect(() => {
-    if (projectId == null) {
-      setName(null)
-      return
-    }
+    if (projectId == null) {}
     let active = true
     void projectsApi.list().then((ps) => {
killedBy: NightRunPage — ungültige Projekt-ID meldet eine ungültige Projekt-ID und lädt nichts
statusReason: expected [ { url: '/api/projects', …(2) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/lib/useProjectName.ts:13:9
 export function useProjectName(projectId: number | null): string | null {
   const [name, setName] = useState<string | null>(null)
   useEffect(() => {
-    if (projectId == null) {
+    if (true) {
       setName(null)
       return
killedBy: useProjectName liefert den Namen des passenden Projekts
statusReason: expected null to be 'Team' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/lib/useProjectName.ts:17:18
       setName(null)
       return
     }
-    let active = true
+    let active = false
     void projectsApi.list().then((ps) => {
       if (active) {
killedBy: useProjectName liefert den Namen des passenden Projekts
statusReason: expected null to be 'Team' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/lib/useProjectName.ts:18:42
       return
     }
     let active = true
-    void projectsApi.list().then((ps) => {
-      if (active) {
-        setName(ps.find((p) => p.id === projectId)?.name ?? null)
-      }
-    })
+    void projectsApi.list().then((ps) => {})
     return () => {
       active = false
killedBy: useProjectName liefert den Namen des passenden Projekts
statusReason: expected null to be 'Team' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/lib/useProjectName.ts:19:19
     }
     let active = true
     void projectsApi.list().then((ps) => {
-      if (active) {
-        setName(ps.find((p) => p.id === projectId)?.name ?? null)
-      }
+      if (active) {}
     })
     return () => {
killedBy: useProjectName liefert den Namen des passenden Projekts
statusReason: expected null to be 'Team' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/lib/useProjectName.ts:19:11
     }
     let active = true
     void projectsApi.list().then((ps) => {
-      if (active) {
+      if (false) {
         setName(ps.find((p) => p.id === projectId)?.name ?? null)
       }
killedBy: useProjectName liefert den Namen des passenden Projekts
statusReason: expected null to be 'Team' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] LogicalOperator
src/lib/useProjectName.ts:20:17
     let active = true
     void projectsApi.list().then((ps) => {
       if (active) {
-        setName(ps.find((p) => p.id === projectId)?.name ?? null)
+        setName(ps.find(p => p.id === projectId)?.name && null)
       }
     })
killedBy: useProjectName liefert den Namen des passenden Projekts
statusReason: expected null to be 'Team' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] EqualityOperator
src/lib/useProjectName.ts:20:32
     let active = true
     void projectsApi.list().then((ps) => {
       if (active) {
-        setName(ps.find((p) => p.id === projectId)?.name ?? null)
+        setName(ps.find((p) => p.id !== projectId)?.name ?? null)
       }
     })
killedBy: useProjectName liefert den Namen des passenden Projekts
statusReason: expected null to be 'Team' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] BlockStatement
src/lib/useProjectName.ts:23:18
         setName(ps.find((p) => p.id === projectId)?.name ?? null)
       }
     })
-    return () => {
-      active = false
-    }
+    return () => {}
   }, [projectId])
   return name

[Survived] BooleanLiteral
src/lib/useProjectName.ts:24:16
       }
     })
     return () => {
-      active = false
+      active = true
     }
   }, [projectId])
