[Killed] BlockStatement
src/lib/useRefetchOnFocus.ts:11:63
  * Die aktuelle `callback`-Referenz wird über ein Ref gehalten, damit die Listener nicht bei jeder
  * Neudefinition der Funktion neu registriert werden müssen.
  */
-export function useRefetchOnFocus(callback: () => void): void {
-  const ref = useRef(callback)
-  useEffect(() => {
-    ref.current = callback
-  })
-
-  useEffect(() => {
-    const onVisible = () => {
-      if (document.visibilityState === 'visible') {
-        ref.current()
-      }
-    }
-    const onFocus = () => ref.current()
-    document.addEventListener('visibilitychange', onVisible)
-    window.addEventListener('focus', onFocus)
-    return () => {
-      document.removeEventListener('visibilitychange', onVisible)
-      window.removeEventListener('focus', onFocus)
-    }
-  }, [])
-}
+export function useRefetchOnFocus(callback: () => void): void {}
 
killedBy: ProjectBoardsPage RBAC lädt Boards, Archiv und Rolle beim Fensterfokus neu
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] BlockStatement
src/lib/useRefetchOnFocus.ts:13:19
  */
 export function useRefetchOnFocus(callback: () => void): void {
   const ref = useRef(callback)
-  useEffect(() => {
-    ref.current = callback
-  })
+  useEffect(() => {})
 
   useEffect(() => {
killedBy: IdeaPlanningBoard lädt beim Fensterfokus neu
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] BlockStatement
src/lib/useRefetchOnFocus.ts:17:19
     ref.current = callback
   })
 
-  useEffect(() => {
-    const onVisible = () => {
-      if (document.visibilityState === 'visible') {
-        ref.current()
-      }
-    }
-    const onFocus = () => ref.current()
-    document.addEventListener('visibilitychange', onVisible)
-    window.addEventListener('focus', onFocus)
-    return () => {
-      document.removeEventListener('visibilitychange', onVisible)
-      window.removeEventListener('focus', onFocus)
-    }
-  }, [])
+  useEffect(() => {}, [])
 }
 
killedBy: AppShell lädt Projekt- und Board-Kontext beim Fensterfokus neu
statusReason: expected "spy" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html
  style="--app-content-left: 240px; --app-content-top: 64px;"
>
  <head>
    <meta

[Killed] BlockStatement
src/lib/useRefetchOnFocus.ts:18:29
   })
 
   useEffect(() => {
-    const onVisible = () => {
-      if (document.visibilityState === 'visible') {
-        ref.current()
-      }
-    }
+    const onVisible = () => {}
     const onFocus = () => ref.current()
     document.addEventListener('visibilitychange', onVisible)
killedBy: useRefetchOnFocus ruft den Callback bei Fensterfokus und beim Sichtbarwerden
statusReason: expected "spy" to be called 2 times, but got 1 times

[Killed] BlockStatement
src/lib/useRefetchOnFocus.ts:19:51
 
   useEffect(() => {
     const onVisible = () => {
-      if (document.visibilityState === 'visible') {
-        ref.current()
-      }
+      if (document.visibilityState === 'visible') {}
     }
     const onFocus = () => ref.current()
killedBy: useRefetchOnFocus ruft den Callback bei Fensterfokus und beim Sichtbarwerden
statusReason: expected "spy" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
src/lib/useRefetchOnFocus.ts:19:11
 
   useEffect(() => {
     const onVisible = () => {
-      if (document.visibilityState === 'visible') {
+      if (false) {
         ref.current()
       }
killedBy: useRefetchOnFocus ruft den Callback bei Fensterfokus und beim Sichtbarwerden
statusReason: expected "spy" to be called 2 times, but got 1 times

[Killed] ArrowFunction
src/lib/useRefetchOnFocus.ts:23:21
         ref.current()
       }
     }
-    const onFocus = () => ref.current()
+    const onFocus = () => undefined
     document.addEventListener('visibilitychange', onVisible)
     window.addEventListener('focus', onFocus)
killedBy: AppShell lädt Projekt- und Board-Kontext beim Fensterfokus neu
statusReason: expected "spy" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html
  style="--app-content-left: 240px; --app-content-top: 64px;"
>
  <head>
    <meta

[Killed] BlockStatement
src/lib/useRefetchOnFocus.ts:26:18
     const onFocus = () => ref.current()
     document.addEventListener('visibilitychange', onVisible)
     window.addEventListener('focus', onFocus)
-    return () => {
-      document.removeEventListener('visibilitychange', onVisible)
-      window.removeEventListener('focus', onFocus)
-    }
+    return () => {}
   }, [])
 }
killedBy: useRefetchOnFocus meldet die Listener beim Unmount ab
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array []

[Survived] StringLiteral
src/lib/useRefetchOnFocus.ts:27:36
     document.addEventListener('visibilitychange', onVisible)
     window.addEventListener('focus', onFocus)
     return () => {
-      document.removeEventListener('visibilitychange', onVisible)
+      document.removeEventListener("", onVisible)
       window.removeEventListener('focus', onFocus)
     }
