[Timeout] ArrayDeclaration
src/lib/statusColors.ts:23:75
 const NEUTRAL: StatusColorSet = { bg: '#F1F5F6', text: '#5F7A7F', dot: '#8FA6AB' }
 
 // Reihenfolge nach Namensmuster; erster Treffer gewinnt (keine Überschneidungen).
-const PALETTE: ReadonlyArray<{ match: string; colors: StatusColorSet }> = [
-  { match: 'done', colors: { bg: '#E4F3EC', text: '#14624A', dot: '#2E9E7A' } },
-  { match: 'review', colors: { bg: '#F7EAE4', text: '#8A3F28', dot: '#C46B4E' } },
-  { match: 'progress', colors: { bg: '#FAF3E3', text: '#7A5B12', dot: '#C99A2E' } },
-  { match: 'ready', colors: { bg: '#E1F0F2', text: '#1E5F68', dot: '#2F8C97' } },
-  { match: 'backlog', colors: { bg: '#EDF5F6', text: '#1E5F68', dot: '#5BABB5' } },
-]
+const PALETTE: ReadonlyArray<{ match: string; colors: StatusColorSet }> = []
 
 /** Volles Farbset einer Spalte (Tint-Fläche, Text, Punkt). */

[Timeout] ObjectLiteral
src/lib/statusColors.ts:24:28
 
 // Reihenfolge nach Namensmuster; erster Treffer gewinnt (keine Überschneidungen).
 const PALETTE: ReadonlyArray<{ match: string; colors: StatusColorSet }> = [
-  { match: 'done', colors: { bg: '#E4F3EC', text: '#14624A', dot: '#2E9E7A' } },
+  { match: 'done', colors: {} },
   { match: 'review', colors: { bg: '#F7EAE4', text: '#8A3F28', dot: '#C46B4E' } },
   { match: 'progress', colors: { bg: '#FAF3E3', text: '#7A5B12', dot: '#C99A2E' } },

[Timeout] ObjectLiteral
src/lib/statusColors.ts:24:3
 
 // Reihenfolge nach Namensmuster; erster Treffer gewinnt (keine Überschneidungen).
 const PALETTE: ReadonlyArray<{ match: string; colors: StatusColorSet }> = [
-  { match: 'done', colors: { bg: '#E4F3EC', text: '#14624A', dot: '#2E9E7A' } },
+  {},
   { match: 'review', colors: { bg: '#F7EAE4', text: '#8A3F28', dot: '#C46B4E' } },
   { match: 'progress', colors: { bg: '#FAF3E3', text: '#7A5B12', dot: '#C99A2E' } },

[Timeout] StringLiteral
src/lib/statusColors.ts:25:36
 // Reihenfolge nach Namensmuster; erster Treffer gewinnt (keine Überschneidungen).
 const PALETTE: ReadonlyArray<{ match: string; colors: StatusColorSet }> = [
   { match: 'done', colors: { bg: '#E4F3EC', text: '#14624A', dot: '#2E9E7A' } },
-  { match: 'review', colors: { bg: '#F7EAE4', text: '#8A3F28', dot: '#C46B4E' } },
+  { match: 'review', colors: { bg: "", text: '#8A3F28', dot: '#C46B4E' } },
   { match: 'progress', colors: { bg: '#FAF3E3', text: '#7A5B12', dot: '#C99A2E' } },
   { match: 'ready', colors: { bg: '#E1F0F2', text: '#1E5F68', dot: '#2F8C97' } },

[Timeout] StringLiteral
src/lib/statusColors.ts:25:12
 // Reihenfolge nach Namensmuster; erster Treffer gewinnt (keine Überschneidungen).
 const PALETTE: ReadonlyArray<{ match: string; colors: StatusColorSet }> = [
   { match: 'done', colors: { bg: '#E4F3EC', text: '#14624A', dot: '#2E9E7A' } },
-  { match: 'review', colors: { bg: '#F7EAE4', text: '#8A3F28', dot: '#C46B4E' } },
+  { match: "", colors: { bg: '#F7EAE4', text: '#8A3F28', dot: '#C46B4E' } },
   { match: 'progress', colors: { bg: '#FAF3E3', text: '#7A5B12', dot: '#C99A2E' } },
   { match: 'ready', colors: { bg: '#E1F0F2', text: '#1E5F68', dot: '#2F8C97' } },

[Timeout] ObjectLiteral
src/lib/statusColors.ts:26:3
 const PALETTE: ReadonlyArray<{ match: string; colors: StatusColorSet }> = [
   { match: 'done', colors: { bg: '#E4F3EC', text: '#14624A', dot: '#2E9E7A' } },
   { match: 'review', colors: { bg: '#F7EAE4', text: '#8A3F28', dot: '#C46B4E' } },
-  { match: 'progress', colors: { bg: '#FAF3E3', text: '#7A5B12', dot: '#C99A2E' } },
+  {},
   { match: 'ready', colors: { bg: '#E1F0F2', text: '#1E5F68', dot: '#2F8C97' } },
   { match: 'backlog', colors: { bg: '#EDF5F6', text: '#1E5F68', dot: '#5BABB5' } },

[Timeout] StringLiteral
src/lib/statusColors.ts:26:12
 const PALETTE: ReadonlyArray<{ match: string; colors: StatusColorSet }> = [
   { match: 'done', colors: { bg: '#E4F3EC', text: '#14624A', dot: '#2E9E7A' } },
   { match: 'review', colors: { bg: '#F7EAE4', text: '#8A3F28', dot: '#C46B4E' } },
-  { match: 'progress', colors: { bg: '#FAF3E3', text: '#7A5B12', dot: '#C99A2E' } },
+  { match: "", colors: { bg: '#FAF3E3', text: '#7A5B12', dot: '#C99A2E' } },
   { match: 'ready', colors: { bg: '#E1F0F2', text: '#1E5F68', dot: '#2F8C97' } },
   { match: 'backlog', colors: { bg: '#EDF5F6', text: '#1E5F68', dot: '#5BABB5' } },

[Timeout] StringLiteral
src/lib/statusColors.ts:27:12
   { match: 'done', colors: { bg: '#E4F3EC', text: '#14624A', dot: '#2E9E7A' } },
   { match: 'review', colors: { bg: '#F7EAE4', text: '#8A3F28', dot: '#C46B4E' } },
   { match: 'progress', colors: { bg: '#FAF3E3', text: '#7A5B12', dot: '#C99A2E' } },
-  { match: 'ready', colors: { bg: '#E1F0F2', text: '#1E5F68', dot: '#2F8C97' } },
+  { match: "", colors: { bg: '#E1F0F2', text: '#1E5F68', dot: '#2F8C97' } },
   { match: 'backlog', colors: { bg: '#EDF5F6', text: '#1E5F68', dot: '#5BABB5' } },
 ]

[Timeout] ObjectLiteral
src/lib/statusColors.ts:27:3
   { match: 'done', colors: { bg: '#E4F3EC', text: '#14624A', dot: '#2E9E7A' } },
   { match: 'review', colors: { bg: '#F7EAE4', text: '#8A3F28', dot: '#C46B4E' } },
   { match: 'progress', colors: { bg: '#FAF3E3', text: '#7A5B12', dot: '#C99A2E' } },
-  { match: 'ready', colors: { bg: '#E1F0F2', text: '#1E5F68', dot: '#2F8C97' } },
+  {},
   { match: 'backlog', colors: { bg: '#EDF5F6', text: '#1E5F68', dot: '#5BABB5' } },
 ]

[Killed] StringLiteral
src/lib/statusColors.ts:28:37
   { match: 'review', colors: { bg: '#F7EAE4', text: '#8A3F28', dot: '#C46B4E' } },
   { match: 'progress', colors: { bg: '#FAF3E3', text: '#7A5B12', dot: '#C99A2E' } },
   { match: 'ready', colors: { bg: '#E1F0F2', text: '#1E5F68', dot: '#2F8C97' } },
-  { match: 'backlog', colors: { bg: '#EDF5F6', text: '#1E5F68', dot: '#5BABB5' } },
+  { match: 'backlog', colors: { bg: "", text: '#1E5F68', dot: '#5BABB5' } },
 ]
 
killedBy: BoardListPage lässt dem Status-Chip den Text, nimmt ihm aber die Farbfläche
statusReason: expect(element).not.toHaveStyle()

- Expected

- backgroundColor: ;

[Timeout] ObjectLiteral
src/lib/statusColors.ts:28:3
   { match: 'review', colors: { bg: '#F7EAE4', text: '#8A3F28', dot: '#C46B4E' } },
   { match: 'progress', colors: { bg: '#FAF3E3', text: '#7A5B12', dot: '#C99A2E' } },
   { match: 'ready', colors: { bg: '#E1F0F2', text: '#1E5F68', dot: '#2F8C97' } },
-  { match: 'backlog', colors: { bg: '#EDF5F6', text: '#1E5F68', dot: '#5BABB5' } },
+  {},
 ]
 

[Killed] BlockStatement
src/lib/statusColors.ts:32:60
 ]
 
 /** Volles Farbset einer Spalte (Tint-Fläche, Text, Punkt). */
-export function statusColors(name: string): StatusColorSet {
-  const n = name.toLowerCase()
-  for (const entry of PALETTE) {
-    if (n.includes(entry.match)) {
-      return entry.colors
-    }
-  }
-  return NEUTRAL
-}
+export function statusColors(name: string): StatusColorSet {}
 
 /** Farbe für archivierte Karten (Badges/Listen). */
killedBy: BoardListPage zeigt aktive Karten mit Status-Chip und Body-Vorschau, archivierte erst nach Filter
statusReason: Unable to find an element with the text: Aufgabe. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Timeout] MethodExpression
src/lib/statusColors.ts:33:13
 
 /** Volles Farbset einer Spalte (Tint-Fläche, Text, Punkt). */
 export function statusColors(name: string): StatusColorSet {
-  const n = name.toLowerCase()
+  const n = name.toUpperCase()
   for (const entry of PALETTE) {
     if (n.includes(entry.match)) {

[Timeout] BlockStatement
src/lib/statusColors.ts:34:32
 /** Volles Farbset einer Spalte (Tint-Fläche, Text, Punkt). */
 export function statusColors(name: string): StatusColorSet {
   const n = name.toLowerCase()
-  for (const entry of PALETTE) {
-    if (n.includes(entry.match)) {
-      return entry.colors
-    }
-  }
+  for (const entry of PALETTE) {}
   return NEUTRAL
 }

[Timeout] ConditionalExpression
src/lib/statusColors.ts:35:9
 export function statusColors(name: string): StatusColorSet {
   const n = name.toLowerCase()
   for (const entry of PALETTE) {
-    if (n.includes(entry.match)) {
+    if (true) {
       return entry.colors
     }

[Timeout] ConditionalExpression
src/lib/statusColors.ts:35:9
 export function statusColors(name: string): StatusColorSet {
   const n = name.toLowerCase()
   for (const entry of PALETTE) {
-    if (n.includes(entry.match)) {
+    if (false) {
       return entry.colors
     }

[Killed] ObjectLiteral
src/lib/statusColors.ts:43:54
 }
 
 /** Farbe für archivierte Karten (Badges/Listen). */
-export const ARCHIVED_STATUS_COLOR: StatusColorSet = { bg: '#F0F2F2', text: '#5F7A7F', dot: '#9FB0B4' }
+export const ARCHIVED_STATUS_COLOR: StatusColorSet = {}
 
killedBy: BoardListPage trägt den Status an der linken Kante der Zeile, archivierte in ihrer eigenen Farbe
statusReason: expect(element).toHaveStyle()

- Expected

- borderLeftColor: ;
- borderLeftWidth: 3px;

[Timeout] StringLiteral
src/lib/statusColors.ts:43:60
 }
 
 /** Farbe für archivierte Karten (Badges/Listen). */
-export const ARCHIVED_STATUS_COLOR: StatusColorSet = { bg: '#F0F2F2', text: '#5F7A7F', dot: '#9FB0B4' }
+export const ARCHIVED_STATUS_COLOR: StatusColorSet = { bg: "", text: '#5F7A7F', dot: '#9FB0B4' }
 
