[Killed] LogicalOperator
src/lib/roles.ts:10:3
 
 /** Wer Boards anlegen/löschen darf (BOARD_CREATE/BOARD_DELETE). */
 export const canManageBoards = (role: string, platformAdmin = false): boolean =>
-  platformAdmin || role === 'OWNER' || role === 'ADMIN'
+  platformAdmin && role === 'OWNER' || role === 'ADMIN'
 
 /** Wer das Projekt umbenennen/löschen darf (nur OWNER oder Plattform-Admin). */
killedBy: roles gibt einem Plattform-Admin Vollzugriff
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/roles.ts:10:3
 
 /** Wer Boards anlegen/löschen darf (BOARD_CREATE/BOARD_DELETE). */
 export const canManageBoards = (role: string, platformAdmin = false): boolean =>
-  platformAdmin || role === 'OWNER' || role === 'ADMIN'
+  false
 
 /** Wer das Projekt umbenennen/löschen darf (nur OWNER oder Plattform-Admin). */
killedBy: roles gibt einem Plattform-Admin Vollzugriff
statusReason: expected false to be true // Object.is equality

[NoCoverage] ConditionalExpression
src/lib/roles.ts:18:40
 
 /** Wer Mitglieder verwalten darf (MEMBER_INVITE/MEMBER_REMOVE). */
 export const canManageMembers = (role: string, platformAdmin = false): boolean =>
-  platformAdmin || role === 'OWNER' || role === 'ADMIN'
+  platformAdmin || role === 'OWNER' || false
 
 /** Wer Karten anlegen/verschieben darf (CARD_*). */
