[Killed] ObjectLiteral
src/lib/verbrauchZeitraum.ts:33:48
 /** Ein Zeitraum, der den Erfassungsbeginn schneidet: Zahlen sind da, aber unvollständig. */
 export const TEILWEISE_ERFASST_TEXT = 'teilweise erfasst'
 
-const DATUM = new Intl.DateTimeFormat('de-DE', {
-  day: '2-digit',
-  month: '2-digit',
-  year: 'numeric',
-  timeZone: 'UTC',
-})
+const DATUM = new Intl.DateTimeFormat('de-DE', {})
 
 const MONAT = new Intl.DateTimeFormat('de-DE', { month: 'long', year: 'numeric', timeZone: 'UTC' })
killedBy: zeitraumBeschriftung benennt eine Nacht mit ihrem Beginn und ihrem Folgetag
statusReason: expected 'Schicht vom 15.9.2026 auf den 16.9.20…' to be 'Schicht vom 15.09.2026 auf den 16.09.…' // Object.is equality

[Survived] StringLiteral
src/lib/verbrauchZeitraum.ts:36:9
 const DATUM = new Intl.DateTimeFormat('de-DE', {
   day: '2-digit',
   month: '2-digit',
-  year: 'numeric',
+  year: "",
   timeZone: 'UTC',
 })

[Killed] ObjectLiteral
src/lib/verbrauchZeitraum.ts:40:48
   timeZone: 'UTC',
 })
 
-const MONAT = new Intl.DateTimeFormat('de-DE', { month: 'long', year: 'numeric', timeZone: 'UTC' })
+const MONAT = new Intl.DateTimeFormat('de-DE', {})
 
 /** Tag und Monat ohne Jahr — für die Zeilen der Nächte, wo die Spalte schmal ist. */
killedBy: zeitraumBeschriftung benennt einen Monat mit Name und Jahr
statusReason: expected '1.8.2026' to be 'August 2026' // Object.is equality

[Survived] StringLiteral
src/lib/verbrauchZeitraum.ts:40:92
   timeZone: 'UTC',
 })
 
-const MONAT = new Intl.DateTimeFormat('de-DE', { month: 'long', year: 'numeric', timeZone: 'UTC' })
+const MONAT = new Intl.DateTimeFormat('de-DE', { month: 'long', year: 'numeric', timeZone: "" })
 
 /** Tag und Monat ohne Jahr — für die Zeilen der Nächte, wo die Spalte schmal ist. */

[Killed] ObjectLiteral
src/lib/verbrauchZeitraum.ts:43:52
 const MONAT = new Intl.DateTimeFormat('de-DE', { month: 'long', year: 'numeric', timeZone: 'UTC' })
 
 /** Tag und Monat ohne Jahr — für die Zeilen der Nächte, wo die Spalte schmal ist. */
-const TAG_MONAT = new Intl.DateTimeFormat('de-DE', { day: '2-digit', month: '2-digit', timeZone: 'UTC' })
+const TAG_MONAT = new Intl.DateTimeFormat('de-DE', {})
 
 const WOCHENTAG = new Intl.DateTimeFormat('de-DE', { weekday: 'short', timeZone: 'UTC' })
killedBy: nachtKurz nennt Wochentag, Beginn und Folgetag ohne Jahr
statusReason: expected 'Di 8.9.2026 → 9.9.2026' to be 'Di 08.09. → 09.09.' // Object.is equality

[Survived] StringLiteral
src/lib/verbrauchZeitraum.ts:43:98
 const MONAT = new Intl.DateTimeFormat('de-DE', { month: 'long', year: 'numeric', timeZone: 'UTC' })
 
 /** Tag und Monat ohne Jahr — für die Zeilen der Nächte, wo die Spalte schmal ist. */
-const TAG_MONAT = new Intl.DateTimeFormat('de-DE', { day: '2-digit', month: '2-digit', timeZone: 'UTC' })
+const TAG_MONAT = new Intl.DateTimeFormat('de-DE', { day: '2-digit', month: '2-digit', timeZone: "" })
 
 const WOCHENTAG = new Intl.DateTimeFormat('de-DE', { weekday: 'short', timeZone: 'UTC' })

[Killed] ObjectLiteral
src/lib/verbrauchZeitraum.ts:45:52
 /** Tag und Monat ohne Jahr — für die Zeilen der Nächte, wo die Spalte schmal ist. */
 const TAG_MONAT = new Intl.DateTimeFormat('de-DE', { day: '2-digit', month: '2-digit', timeZone: 'UTC' })
 
-const WOCHENTAG = new Intl.DateTimeFormat('de-DE', { weekday: 'short', timeZone: 'UTC' })
+const WOCHENTAG = new Intl.DateTimeFormat('de-DE', {})
 
 const PROZENT = new Intl.NumberFormat('de-DE', {
killedBy: nachtKurz nennt Wochentag, Beginn und Folgetag ohne Jahr
statusReason: expected '8.9.2026 08.09. → 09.09.' to be 'Di 08.09. → 09.09.' // Object.is equality

[Killed] ArrowFunction
src/lib/verbrauchZeitraum.ts:56:18
  * Ein Kalenderdatum `JJJJ-MM-TT` als Mitternacht UTC. Formatiert wird ebenfalls in UTC — so kann
  * die Zone des Browsers das Datum nie um einen Tag verschieben.
  */
-const alsDatum = (tag: string): Date => new Date(`${tag}T00:00:00Z`)
+const alsDatum = () => undefined
 
 const folgetag = (tag: string): Date => {
killedBy: zeitraumBeschriftung benennt eine Nacht mit ihrem Beginn und ihrem Folgetag
statusReason: Cannot read properties of undefined (reading 'setUTCDate')

[Killed] BlockStatement
src/lib/verbrauchZeitraum.ts:58:41
  */
 const alsDatum = (tag: string): Date => new Date(`${tag}T00:00:00Z`)
 
-const folgetag = (tag: string): Date => {
-  const datum = alsDatum(tag)
-  datum.setUTCDate(datum.getUTCDate() + 1)
-  return datum
-}
+const folgetag = (tag: string): Date => {}
 
 const VORZEITRAUM: Record<VerbrauchZeitraumArt, string> = {
killedBy: zeitraumBeschriftung benennt eine Nacht mit ihrem Beginn und ihrem Folgetag
statusReason: expected 'Schicht vom 15.09.2026 auf den 24.09.…' to be 'Schicht vom 15.09.2026 auf den 16.09.…' // Object.is equality

[Killed] MethodExpression
src/lib/verbrauchZeitraum.ts:60:3
 
 const folgetag = (tag: string): Date => {
   const datum = alsDatum(tag)
-  datum.setUTCDate(datum.getUTCDate() + 1)
+  datum.setTime(datum.getUTCDate() + 1)
   return datum
 }
killedBy: zeitraumBeschriftung benennt eine Nacht mit ihrem Beginn und ihrem Folgetag
statusReason: expected 'Schicht vom 15.09.2026 auf den 01.01.…' to be 'Schicht vom 15.09.2026 auf den 16.09.…' // Object.is equality

[Killed] ArithmeticOperator
src/lib/verbrauchZeitraum.ts:60:20
 
 const folgetag = (tag: string): Date => {
   const datum = alsDatum(tag)
-  datum.setUTCDate(datum.getUTCDate() + 1)
+  datum.setUTCDate(datum.getUTCDate() - 1)
   return datum
 }
killedBy: zeitraumBeschriftung benennt eine Nacht mit ihrem Beginn und ihrem Folgetag
statusReason: expected 'Schicht vom 15.09.2026 auf den 14.09.…' to be 'Schicht vom 15.09.2026 auf den 16.09.…' // Object.is equality

[Killed] StringLiteral
src/lib/verbrauchZeitraum.ts:65:8
 }
 
 const VORZEITRAUM: Record<VerbrauchZeitraumArt, string> = {
-  DAY: 'Vorzyklus',
+  DAY: "",
   WEEK: 'Vorwoche',
   MONTH: 'Vormonat',
killedBy: vorzeitraumName nennt je Art den Vorzeitraum beim Namen
statusReason: expected '' to be 'Vorzyklus' // Object.is equality

[Killed] StringLiteral
src/lib/verbrauchZeitraum.ts:66:9
 
 const VORZEITRAUM: Record<VerbrauchZeitraumArt, string> = {
   DAY: 'Vorzyklus',
-  WEEK: 'Vorwoche',
+  WEEK: "",
   MONTH: 'Vormonat',
 }
killedBy: vorzeitraumName nennt je Art den Vorzeitraum beim Namen
statusReason: expected '' to be 'Vorwoche' // Object.is equality

[Killed] BlockStatement
src/lib/verbrauchZeitraum.ts:74:57
  * Der Name eines Zyklus (Issue #1127): Er läuft von 12:00 bis 12:00 und heißt nach seinem
  * Beginn und dem Folgetag. `tag` ist sein Beginn als Kalendertag `JJJJ-MM-TT`.
  */
-export function zyklusBeschriftung(tag: string): string {
-  return `Schicht ${zyklusSpanne(tag)}`
-}
+export function zyklusBeschriftung(tag: string): string {}
 
 /** Die Spanne eines Zyklus ohne das Wort davor — „vom 21.09.2026 auf den 22.09.2026" (#1135). */
killedBy: zeitraumBeschriftung benennt eine Nacht mit ihrem Beginn und ihrem Folgetag
statusReason: expected undefined to be 'Schicht vom 15.09.2026 auf den 16.09.…' // Object.is equality

[Killed] BlockStatement
src/lib/verbrauchZeitraum.ts:79:51
 }
 
 /** Die Spanne eines Zyklus ohne das Wort davor — „vom 21.09.2026 auf den 22.09.2026" (#1135). */
-export function zyklusSpanne(tag: string): string {
-  return `vom ${DATUM.format(alsDatum(tag))} auf den ${DATUM.format(folgetag(tag))}`
-}
+export function zyklusSpanne(tag: string): string {}
 
 /** Die Teile eines Zeitpunkts in einer Zone — Kalendertag und Stunde, wie die Wanduhr dort sie zeigt. */
killedBy: zeitraumBeschriftung benennt eine Nacht mit ihrem Beginn und ihrem Folgetag
statusReason: expected 'Schicht undefined' to be 'Schicht vom 15.09.2026 auf den 16.09.…' // Object.is equality

[Killed] ArrowFunction
src/lib/verbrauchZeitraum.ts:84:17
 }
 
 /** Die Teile eines Zeitpunkts in einer Zone — Kalendertag und Stunde, wie die Wanduhr dort sie zeigt. */
-const WANDUHR = (zone: string) =>
-  new Intl.DateTimeFormat('en-CA', {
-    timeZone: zone,
-    year: 'numeric',
-    month: '2-digit',
-    day: '2-digit',
-    hour: '2-digit',
-    hourCycle: 'h23',
-  })
+const WANDUHR = () => undefined
 
 /**
killedBy: zyklusDesStarts (Issue #1127) ordnet einen Start ab 12:00 dem Zyklus dieses Tages zu
statusReason: Cannot read properties of undefined (reading 'formatToParts')

[Killed] StringLiteral
src/lib/verbrauchZeitraum.ts:91:16
     month: '2-digit',
     day: '2-digit',
     hour: '2-digit',
-    hourCycle: 'h23',
+    hourCycle: "",
   })
 
killedBy: zyklusDesStarts (Issue #1127) ordnet einen Start ab 12:00 dem Zyklus dieses Tages zu
statusReason: Value  out of range for Intl.DateTimeFormat options property hourCycle

[Killed] BlockStatement
src/lib/verbrauchZeitraum.ts:101:88
  * Verbrauchsauswertung und Plattform-Leitstand ({@link leserZone}). Ein Lauf vor 12:00 gehört zum
  * Zyklus, der am Vortag um 12:00 begann.
  */
-export function zyklusDesStarts(zeitpunkt: string, zone: string = leserZone()): string {
-  const teile = Object.fromEntries(
-    WANDUHR(zone)
-      .formatToParts(new Date(zeitpunkt))
-      .map((teil) => [teil.type, teil.value]),
-  )
-  const tag = `${teile.year}-${teile.month}-${teile.day}`
-  return Number(teile.hour) >= 12 ? tag : zyklusDavor(tag)
-}
+export function zyklusDesStarts(zeitpunkt: string, zone: string = leserZone()): string {}
 
 /** Der Zyklus unmittelbar vor dem genannten (Issue #1134) — Beginn als Kalendertag `JJJJ-MM-TT`. */
killedBy: zyklusDesStarts (Issue #1127) ordnet einen Start ab 12:00 dem Zyklus dieses Tages zu
statusReason: expected undefined to be '2026-09-14' // Object.is equality

[Killed] ArrowFunction
src/lib/verbrauchZeitraum.ts:105:12
   const teile = Object.fromEntries(
     WANDUHR(zone)
       .formatToParts(new Date(zeitpunkt))
-      .map((teil) => [teil.type, teil.value]),
+      .map(() => undefined),
   )
   const tag = `${teile.year}-${teile.month}-${teile.day}`
killedBy: zyklusDesStarts (Issue #1127) ordnet einen Start ab 12:00 dem Zyklus dieses Tages zu
statusReason: Iterator value undefined is not an entry object

[Killed] ConditionalExpression
src/lib/verbrauchZeitraum.ts:108:10
       .map((teil) => [teil.type, teil.value]),
   )
   const tag = `${teile.year}-${teile.month}-${teile.day}`
-  return Number(teile.hour) >= 12 ? tag : zyklusDavor(tag)
+  return true ? tag : zyklusDavor(tag)
 }
 
killedBy: zyklusDesStarts (Issue #1127) ordnet einen Start vor 12:00 dem Zyklus des Vortags zu
statusReason: expected '2026-09-15' to be '2026-09-14' // Object.is equality

[Killed] EqualityOperator
src/lib/verbrauchZeitraum.ts:108:10
       .map((teil) => [teil.type, teil.value]),
   )
   const tag = `${teile.year}-${teile.month}-${teile.day}`
-  return Number(teile.hour) >= 12 ? tag : zyklusDavor(tag)
+  return Number(teile.hour) > 12 ? tag : zyklusDavor(tag)
 }
 
killedBy: zyklusDesStarts (Issue #1127) ordnet einen Start ab 12:00 dem Zyklus dieses Tages zu
statusReason: expected '2026-09-14' to be '2026-09-15' // Object.is equality

[Killed] BlockStatement
src/lib/verbrauchZeitraum.ts:112:50
 }
 
 /** Der Zyklus unmittelbar vor dem genannten (Issue #1134) — Beginn als Kalendertag `JJJJ-MM-TT`. */
-export function zyklusDavor(tag: string): string {
-  const vortag = alsDatum(tag)
-  vortag.setUTCDate(vortag.getUTCDate() - 1)
-  return vortag.toISOString().slice(0, 10)
-}
+export function zyklusDavor(tag: string): string {}
 
 /**
killedBy: zyklusDesStarts (Issue #1127) ordnet einen Start vor 12:00 dem Zyklus des Vortags zu
statusReason: expected undefined to be '2026-09-14' // Object.is equality

[Killed] ArithmeticOperator
src/lib/verbrauchZeitraum.ts:114:21
 /** Der Zyklus unmittelbar vor dem genannten (Issue #1134) — Beginn als Kalendertag `JJJJ-MM-TT`. */
 export function zyklusDavor(tag: string): string {
   const vortag = alsDatum(tag)
-  vortag.setUTCDate(vortag.getUTCDate() - 1)
+  vortag.setUTCDate(vortag.getUTCDate() + 1)
   return vortag.toISOString().slice(0, 10)
 }
killedBy: zyklusDesStarts (Issue #1127) ordnet einen Start vor 12:00 dem Zyklus des Vortags zu
statusReason: expected '2026-09-16' to be '2026-09-14' // Object.is equality

[Killed] MethodExpression
src/lib/verbrauchZeitraum.ts:114:3
 /** Der Zyklus unmittelbar vor dem genannten (Issue #1134) — Beginn als Kalendertag `JJJJ-MM-TT`. */
 export function zyklusDavor(tag: string): string {
   const vortag = alsDatum(tag)
-  vortag.setUTCDate(vortag.getUTCDate() - 1)
+  vortag.setTime(vortag.getUTCDate() - 1)
   return vortag.toISOString().slice(0, 10)
 }
killedBy: zyklusDesStarts (Issue #1127) ordnet einen Start vor 12:00 dem Zyklus des Vortags zu
statusReason: expected '1970-01-01' to be '2026-09-14' // Object.is equality

[Killed] MethodExpression
src/lib/verbrauchZeitraum.ts:115:10
 export function zyklusDavor(tag: string): string {
   const vortag = alsDatum(tag)
   vortag.setUTCDate(vortag.getUTCDate() - 1)
-  return vortag.toISOString().slice(0, 10)
+  return vortag.toISOString()
 }
 
killedBy: zyklusDesStarts (Issue #1127) ordnet einen Start vor 12:00 dem Zyklus des Vortags zu
statusReason: expected '2026-09-14T00:00:00.000Z' to be '2026-09-14' // Object.is equality

[Killed] BlockStatement
src/lib/verbrauchZeitraum.ts:124:11
  */
 export function zeitraumBeschriftung(
   kennzahlen: Pick<VerbrauchKennzahlen, 'type' | 'firstDay' | 'lastDay'>,
-): string {
-  switch (kennzahlen.type) {
-    case 'DAY':
-      return zyklusBeschriftung(kennzahlen.firstDay)
-    case 'WEEK':
-      return `Woche vom ${DATUM.format(alsDatum(kennzahlen.firstDay))} bis ${DATUM.format(alsDatum(kennzahlen.lastDay))}`
-    case 'MONTH':
-      return MONAT.format(alsDatum(kennzahlen.firstDay))
-  }
-}
+): string {}
 
 /** Ein ISO-Zeitpunkt als Kalendertag — für Grenzen wie den Erfassungs- oder Aufbewahrungsbeginn. */
killedBy: zeitraumBeschriftung benennt eine Nacht mit ihrem Beginn und ihrem Folgetag
statusReason: expected undefined to be 'Schicht vom 15.09.2026 auf den 16.09.…' // Object.is equality

[Killed] ConditionalExpression
src/lib/verbrauchZeitraum.ts:126:5
   kennzahlen: Pick<VerbrauchKennzahlen, 'type' | 'firstDay' | 'lastDay'>,
 ): string {
   switch (kennzahlen.type) {
-    case 'DAY':
-      return zyklusBeschriftung(kennzahlen.firstDay)
+    case 'DAY':
     case 'WEEK':
       return `Woche vom ${DATUM.format(alsDatum(kennzahlen.firstDay))} bis ${DATUM.format(alsDatum(kennzahlen.lastDay))}`
killedBy: zeitraumBeschriftung benennt eine Nacht mit ihrem Beginn und ihrem Folgetag
statusReason: expected 'Woche vom 15.09.2026 bis 15.09.2026' to be 'Schicht vom 15.09.2026 auf den 16.09.…' // Object.is equality

[Killed] ConditionalExpression
src/lib/verbrauchZeitraum.ts:128:5
   switch (kennzahlen.type) {
     case 'DAY':
       return zyklusBeschriftung(kennzahlen.firstDay)
-    case 'WEEK':
-      return `Woche vom ${DATUM.format(alsDatum(kennzahlen.firstDay))} bis ${DATUM.format(alsDatum(kennzahlen.lastDay))}`
+    case 'WEEK':
     case 'MONTH':
       return MONAT.format(alsDatum(kennzahlen.firstDay))
killedBy: zeitraumBeschriftung benennt eine Woche mit ihren Naechten von Montag bis Sonntag
statusReason: expected 'September 2026' to be 'Woche vom 07.09.2026 bis 13.09.2026' // Object.is equality

[Killed] StringLiteral
src/lib/verbrauchZeitraum.ts:128:10
   switch (kennzahlen.type) {
     case 'DAY':
       return zyklusBeschriftung(kennzahlen.firstDay)
-    case 'WEEK':
+    case "":
       return `Woche vom ${DATUM.format(alsDatum(kennzahlen.firstDay))} bis ${DATUM.format(alsDatum(kennzahlen.lastDay))}`
     case 'MONTH':
killedBy: zeitraumBeschriftung benennt eine Woche mit ihren Naechten von Montag bis Sonntag
statusReason: expected undefined to be 'Woche vom 07.09.2026 bis 13.09.2026' // Object.is equality

[Killed] ConditionalExpression
src/lib/verbrauchZeitraum.ts:130:5
       return zyklusBeschriftung(kennzahlen.firstDay)
     case 'WEEK':
       return `Woche vom ${DATUM.format(alsDatum(kennzahlen.firstDay))} bis ${DATUM.format(alsDatum(kennzahlen.lastDay))}`
-    case 'MONTH':
-      return MONAT.format(alsDatum(kennzahlen.firstDay))
+    case 'MONTH':
   }
 }
killedBy: zeitraumBeschriftung benennt einen Monat mit Name und Jahr
statusReason: expected undefined to be 'August 2026' // Object.is equality

[NoCoverage] BlockStatement
src/lib/verbrauchZeitraum.ts:136:59
 }
 
 /** Ein ISO-Zeitpunkt als Kalendertag — für Grenzen wie den Erfassungs- oder Aufbewahrungsbeginn. */
-export function zeitpunktDatum(zeitpunkt: string): string {
-  return DATUM.format(new Date(zeitpunkt))
-}
+export function zeitpunktDatum(zeitpunkt: string): string {}
 
 /** Der Vorzeitraum beim Namen seiner Art — der Titel seiner Platte. */

[Killed] BlockStatement
src/lib/verbrauchZeitraum.ts:141:88
 }
 
 /** Der Vorzeitraum beim Namen seiner Art — der Titel seiner Platte. */
-export function vorzeitraumName(kennzahlen: Pick<VerbrauchKennzahlen, 'type'>): string {
-  return VORZEITRAUM[kennzahlen.type]
-}
+export function vorzeitraumName(kennzahlen: Pick<VerbrauchKennzahlen, 'type'>): string {}
 
 /**
killedBy: vorzeitraumName nennt je Art den Vorzeitraum beim Namen
statusReason: expected undefined to be 'Vorzyklus' // Object.is equality

[Killed] BlockStatement
src/lib/verbrauchZeitraum.ts:149:50
  * Eine Nacht in der Kurzform der Nächte-Platte: Wochentag, Beginn und Folgetag ohne Jahr. Die
  * Spalte ist schmal, das Jahr steht schon in der Beschriftung des Zeitraums darüber.
  */
-export function nachtKurz(nacht: string): string {
-  return `${WOCHENTAG.format(alsDatum(nacht))} ${TAG_MONAT.format(alsDatum(nacht))} → ${TAG_MONAT.format(folgetag(nacht))}`
-}
+export function nachtKurz(nacht: string): string {}
 
 /** „1 Run" bzw. „n Runs" — die Zahl steht in Kopfzeilen, Einordnungen und Nächte-Zeilen. */
killedBy: nachtKurz nennt Wochentag, Beginn und Folgetag ohne Jahr
statusReason: expected undefined to be 'Di 08.09. → 09.09.' // Object.is equality

[Killed] StringLiteral
src/lib/verbrauchZeitraum.ts:150:10
  * Spalte ist schmal, das Jahr steht schon in der Beschriftung des Zeitraums darüber.
  */
 export function nachtKurz(nacht: string): string {
-  return `${WOCHENTAG.format(alsDatum(nacht))} ${TAG_MONAT.format(alsDatum(nacht))} → ${TAG_MONAT.format(folgetag(nacht))}`
+  return ``
 }
 
killedBy: nachtKurz nennt Wochentag, Beginn und Folgetag ohne Jahr
statusReason: expected '' to be 'Di 08.09. → 09.09.' // Object.is equality

[Killed] BlockStatement
src/lib/verbrauchZeitraum.ts:154:52
 }
 
 /** „1 Run" bzw. „n Runs" — die Zahl steht in Kopfzeilen, Einordnungen und Nächte-Zeilen. */
-export function laeufeText(anzahl: number): string {
-  return anzahl === 1 ? '1 Run' : `${anzahl} Runs`
-}
+export function laeufeText(anzahl: number): string {}
 
 /** „1 Sitzung" bzw. „n Sitzungen" — der Anteil neben den Läufen (#984 AK 1). */
killedBy: laeufeText, sitzungenText und kartenText setzt den Einzahl- und den Mehrzahlfall
statusReason: expected undefined to be '1 Run' // Object.is equality

[Killed] ConditionalExpression
src/lib/verbrauchZeitraum.ts:155:10
 
 /** „1 Run" bzw. „n Runs" — die Zahl steht in Kopfzeilen, Einordnungen und Nächte-Zeilen. */
 export function laeufeText(anzahl: number): string {
-  return anzahl === 1 ? '1 Run' : `${anzahl} Runs`
+  return true ? '1 Run' : `${anzahl} Runs`
 }
 
killedBy: laeufeText, sitzungenText und kartenText setzt den Einzahl- und den Mehrzahlfall
statusReason: expected '1 Run' to be '0 Runs' // Object.is equality

[Killed] ConditionalExpression
src/lib/verbrauchZeitraum.ts:155:10
 
 /** „1 Run" bzw. „n Runs" — die Zahl steht in Kopfzeilen, Einordnungen und Nächte-Zeilen. */
 export function laeufeText(anzahl: number): string {
-  return anzahl === 1 ? '1 Run' : `${anzahl} Runs`
+  return false ? '1 Run' : `${anzahl} Runs`
 }
 
killedBy: laeufeText, sitzungenText und kartenText setzt den Einzahl- und den Mehrzahlfall
statusReason: expected '1 Runs' to be '1 Run' // Object.is equality

[Killed] BlockStatement
src/lib/verbrauchZeitraum.ts:159:55
 }
 
 /** „1 Sitzung" bzw. „n Sitzungen" — der Anteil neben den Läufen (#984 AK 1). */
-export function sitzungenText(anzahl: number): string {
-  return anzahl === 1 ? '1 Sitzung' : `${anzahl} Sitzungen`
-}
+export function sitzungenText(anzahl: number): string {}
 
 /** „1 Karte" bzw. „n Karten". */
killedBy: laeufeText, sitzungenText und kartenText setzt den Einzahl- und den Mehrzahlfall
statusReason: expected undefined to be '1 Sitzung' // Object.is equality

[Killed] ConditionalExpression
src/lib/verbrauchZeitraum.ts:160:10
 
 /** „1 Sitzung" bzw. „n Sitzungen" — der Anteil neben den Läufen (#984 AK 1). */
 export function sitzungenText(anzahl: number): string {
-  return anzahl === 1 ? '1 Sitzung' : `${anzahl} Sitzungen`
+  return true ? '1 Sitzung' : `${anzahl} Sitzungen`
 }
 
killedBy: laeufeText, sitzungenText und kartenText setzt den Einzahl- und den Mehrzahlfall
statusReason: expected '1 Sitzung' to be '0 Sitzungen' // Object.is equality

[Killed] EqualityOperator
src/lib/verbrauchZeitraum.ts:160:10
 
 /** „1 Sitzung" bzw. „n Sitzungen" — der Anteil neben den Läufen (#984 AK 1). */
 export function sitzungenText(anzahl: number): string {
-  return anzahl === 1 ? '1 Sitzung' : `${anzahl} Sitzungen`
+  return anzahl !== 1 ? '1 Sitzung' : `${anzahl} Sitzungen`
 }
 
killedBy: laeufeText, sitzungenText und kartenText setzt den Einzahl- und den Mehrzahlfall
statusReason: expected '1 Sitzungen' to be '1 Sitzung' // Object.is equality

[Killed] BlockStatement
src/lib/verbrauchZeitraum.ts:164:52
 }
 
 /** „1 Karte" bzw. „n Karten". */
-export function kartenText(anzahl: number): string {
-  return anzahl === 1 ? '1 Karte' : `${anzahl} Karten`
-}
+export function kartenText(anzahl: number): string {}
 
 export type VergleichsRichtung = 'teurer' | 'billiger' | 'unveraendert' | 'nicht-vergleichbar'
killedBy: laeufeText, sitzungenText und kartenText setzt den Einzahl- und den Mehrzahlfall
statusReason: expected undefined to be '1 Karte' // Object.is equality

[Killed] ConditionalExpression
src/lib/verbrauchZeitraum.ts:165:10
 
 /** „1 Karte" bzw. „n Karten". */
 export function kartenText(anzahl: number): string {
-  return anzahl === 1 ? '1 Karte' : `${anzahl} Karten`
+  return true ? '1 Karte' : `${anzahl} Karten`
 }
 
killedBy: laeufeText, sitzungenText und kartenText setzt den Einzahl- und den Mehrzahlfall
statusReason: expected '1 Karte' to be '0 Karten' // Object.is equality

[Killed] EqualityOperator
src/lib/verbrauchZeitraum.ts:165:10
 
 /** „1 Karte" bzw. „n Karten". */
 export function kartenText(anzahl: number): string {
-  return anzahl === 1 ? '1 Karte' : `${anzahl} Karten`
+  return anzahl !== 1 ? '1 Karte' : `${anzahl} Karten`
 }
 
killedBy: laeufeText, sitzungenText und kartenText setzt den Einzahl- und den Mehrzahlfall
statusReason: expected '1 Karten' to be '1 Karte' // Object.is equality

[Killed] BlockStatement
src/lib/verbrauchZeitraum.ts:181:51
 export function vergleichMitVorzeitraum(
   aktuell: VerbrauchAngaben,
   vorher: VerbrauchAngaben,
-): { richtung: VergleichsRichtung; text: string } {
-  if (aktuell.costUsd === null || vorher.costUsd === null) {
-    return {
-      richtung: 'nicht-vergleichbar',
-      text: 'nicht vergleichbar — eine der beiden Kostenangaben fehlt',
-    }
-  }
-  const differenz =
-    Math.round(aktuell.costUsd * MIKRODOLLAR) - Math.round(vorher.costUsd * MIKRODOLLAR)
-  if (differenz === 0) {
-    return { richtung: 'unveraendert', text: 'genauso teuer wie im Vorzeitraum' }
-  }
-  const richtung = differenz > 0 ? 'teurer' : 'billiger'
-  return {
-    richtung,
-    text: `${betrag(Math.abs(differenz) / MIKRODOLLAR)} ${richtung} als im Vorzeitraum`,
-  }
-}
+): { richtung: VergleichsRichtung; text: string } {}
 
 /**
killedBy: vergleichMitVorzeitraum nennt teurer mit dem Unterschied, ohne dass der Leser rechnet
statusReason: Cannot read properties of undefined (reading 'richtung')

[Killed] LogicalOperator
src/lib/verbrauchZeitraum.ts:182:7
   aktuell: VerbrauchAngaben,
   vorher: VerbrauchAngaben,
 ): { richtung: VergleichsRichtung; text: string } {
-  if (aktuell.costUsd === null || vorher.costUsd === null) {
+  if (aktuell.costUsd === null && vorher.costUsd === null) {
     return {
       richtung: 'nicht-vergleichbar',
killedBy: vergleichMitVorzeitraum nennt nicht vergleichbar, wenn eine der beiden Angaben fehlt — in beiden Richtungen
statusReason: expected 'billiger' to be 'nicht-vergleichbar' // Object.is equality

[Killed] BlockStatement
src/lib/verbrauchZeitraum.ts:182:60
   aktuell: VerbrauchAngaben,
   vorher: VerbrauchAngaben,
 ): { richtung: VergleichsRichtung; text: string } {
-  if (aktuell.costUsd === null || vorher.costUsd === null) {
-    return {
-      richtung: 'nicht-vergleichbar',
-      text: 'nicht vergleichbar — eine der beiden Kostenangaben fehlt',
-    }
-  }
+  if (aktuell.costUsd === null || vorher.costUsd === null) {}
   const differenz =
     Math.round(aktuell.costUsd * MIKRODOLLAR) - Math.round(vorher.costUsd * MIKRODOLLAR)
killedBy: vergleichMitVorzeitraum nennt nicht vergleichbar, wenn eine der beiden Angaben fehlt — in beiden Richtungen
statusReason: expected 'billiger' to be 'nicht-vergleichbar' // Object.is equality

[Killed] StringLiteral
src/lib/verbrauchZeitraum.ts:184:17
 ): { richtung: VergleichsRichtung; text: string } {
   if (aktuell.costUsd === null || vorher.costUsd === null) {
     return {
-      richtung: 'nicht-vergleichbar',
+      richtung: "",
       text: 'nicht vergleichbar — eine der beiden Kostenangaben fehlt',
     }
killedBy: vergleichMitVorzeitraum nennt nicht vergleichbar, wenn eine der beiden Angaben fehlt — in beiden Richtungen
statusReason: expected '' to be 'nicht-vergleichbar' // Object.is equality

[Killed] ArithmeticOperator
src/lib/verbrauchZeitraum.ts:189:16
     }
   }
   const differenz =
-    Math.round(aktuell.costUsd * MIKRODOLLAR) - Math.round(vorher.costUsd * MIKRODOLLAR)
+    Math.round(aktuell.costUsd / MIKRODOLLAR) - Math.round(vorher.costUsd * MIKRODOLLAR)
   if (differenz === 0) {
     return { richtung: 'unveraendert', text: 'genauso teuer wie im Vorzeitraum' }
killedBy: vergleichMitVorzeitraum nennt teurer mit dem Unterschied, ohne dass der Leser rechnet
statusReason: expected 'billiger' to be 'teurer' // Object.is equality

[Killed] ArithmeticOperator
src/lib/verbrauchZeitraum.ts:189:5
     }
   }
   const differenz =
-    Math.round(aktuell.costUsd * MIKRODOLLAR) - Math.round(vorher.costUsd * MIKRODOLLAR)
+    Math.round(aktuell.costUsd * MIKRODOLLAR) + Math.round(vorher.costUsd * MIKRODOLLAR)
   if (differenz === 0) {
     return { richtung: 'unveraendert', text: 'genauso teuer wie im Vorzeitraum' }
killedBy: vergleichMitVorzeitraum nennt teurer mit dem Unterschied, ohne dass der Leser rechnet
statusReason: expected '10,50 $ teurer als im Vorzeitraum' to be '2,50 $ teurer als im Vorzeitraum' // Object.is equality

[Killed] ConditionalExpression
src/lib/verbrauchZeitraum.ts:190:7
   }
   const differenz =
     Math.round(aktuell.costUsd * MIKRODOLLAR) - Math.round(vorher.costUsd * MIKRODOLLAR)
-  if (differenz === 0) {
+  if (true) {
     return { richtung: 'unveraendert', text: 'genauso teuer wie im Vorzeitraum' }
   }
killedBy: vergleichMitVorzeitraum nennt teurer mit dem Unterschied, ohne dass der Leser rechnet
statusReason: expected 'unveraendert' to be 'teurer' // Object.is equality

[Killed] ConditionalExpression
src/lib/verbrauchZeitraum.ts:190:7
   }
   const differenz =
     Math.round(aktuell.costUsd * MIKRODOLLAR) - Math.round(vorher.costUsd * MIKRODOLLAR)
-  if (differenz === 0) {
+  if (false) {
     return { richtung: 'unveraendert', text: 'genauso teuer wie im Vorzeitraum' }
   }
killedBy: vergleichMitVorzeitraum unterscheidet unveraendert davon
statusReason: expected 'billiger' to be 'unveraendert' // Object.is equality

[Killed] ConditionalExpression
src/lib/verbrauchZeitraum.ts:193:20
   if (differenz === 0) {
     return { richtung: 'unveraendert', text: 'genauso teuer wie im Vorzeitraum' }
   }
-  const richtung = differenz > 0 ? 'teurer' : 'billiger'
+  const richtung = true ? 'teurer' : 'billiger'
   return {
     richtung,
killedBy: vergleichMitVorzeitraum nennt billiger mit dem Unterschied
statusReason: expected 'teurer' to be 'billiger' // Object.is equality

[Killed] EqualityOperator
src/lib/verbrauchZeitraum.ts:193:20
   if (differenz === 0) {
     return { richtung: 'unveraendert', text: 'genauso teuer wie im Vorzeitraum' }
   }
-  const richtung = differenz > 0 ? 'teurer' : 'billiger'
+  const richtung = differenz <= 0 ? 'teurer' : 'billiger'
   return {
     richtung,
killedBy: vergleichMitVorzeitraum nennt teurer mit dem Unterschied, ohne dass der Leser rechnet
statusReason: expected 'billiger' to be 'teurer' // Object.is equality

[Killed] ArithmeticOperator
src/lib/verbrauchZeitraum.ts:196:21
   const richtung = differenz > 0 ? 'teurer' : 'billiger'
   return {
     richtung,
-    text: `${betrag(Math.abs(differenz) / MIKRODOLLAR)} ${richtung} als im Vorzeitraum`,
+    text: `${betrag(Math.abs(differenz) * MIKRODOLLAR)} ${richtung} als im Vorzeitraum`,
   }
 }
killedBy: vergleichMitVorzeitraum nennt teurer mit dem Unterschied, ohne dass der Leser rechnet
statusReason: expected '2.500.000.000.000,00 $ teurer als im …' to be '2,50 $ teurer als im Vorzeitraum' // Object.is equality

[Killed] StringLiteral
src/lib/verbrauchZeitraum.ts:196:11
   const richtung = differenz > 0 ? 'teurer' : 'billiger'
   return {
     richtung,
-    text: `${betrag(Math.abs(differenz) / MIKRODOLLAR)} ${richtung} als im Vorzeitraum`,
+    text: ``,
   }
 }
killedBy: vergleichMitVorzeitraum nennt teurer mit dem Unterschied, ohne dass der Leser rechnet
statusReason: expected '' to be '2,50 $ teurer als im Vorzeitraum' // Object.is equality
