[Killed] BlockStatement
src/api/attachments.ts:14:71
   createdAt: string
 }
 
-async function listAttachments(cardId: number): Promise<Attachment[]> {
-  const res = await fetch(`/api/cards/${cardId}/attachments`, { credentials: 'include' })
-  if (!res.ok) {
-    notifyUnauthorized(res.status)
-    throw new ApiError(res.status, res.statusText)
-  }
-  return res.json()
-}
+async function listAttachments(cardId: number): Promise<Attachment[]> {}
 
 async function upload(cardId: number, file: File): Promise<Attachment> {
killedBy: attachmentsApi list ruft GET /api/cards/{id}/attachments mit Cookies und liefert die geparste Antwort
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
src/api/attachments.ts:16:7
 
 async function listAttachments(cardId: number): Promise<Attachment[]> {
   const res = await fetch(`/api/cards/${cardId}/attachments`, { credentials: 'include' })
-  if (!res.ok) {
+  if (false) {
     notifyUnauthorized(res.status)
     throw new ApiError(res.status, res.statusText)
killedBy: attachmentsApi list wirft ApiError bei Fehlerantwort
statusReason: promise resolved "{}" instead of rejecting

[Killed] BlockStatement
src/api/attachments.ts:16:16
 
 async function listAttachments(cardId: number): Promise<Attachment[]> {
   const res = await fetch(`/api/cards/${cardId}/attachments`, { credentials: 'include' })
-  if (!res.ok) {
-    notifyUnauthorized(res.status)
-    throw new ApiError(res.status, res.statusText)
-  }
+  if (!res.ok) {}
   return res.json()
 }
killedBy: attachmentsApi list wirft ApiError bei Fehlerantwort
statusReason: promise resolved "{}" instead of rejecting

[Killed] BlockStatement
src/api/attachments.ts:23:72
   return res.json()
 }
 
-async function upload(cardId: number, file: File): Promise<Attachment> {
-  const form = new FormData()
-  form.append('file', file)
-  const res = await fetch(`/api/cards/${cardId}/attachments`, {
-    method: 'POST',
-    credentials: 'include',
-    body: form, // KEIN Content-Type setzen -> Browser setzt multipart-Boundary
-  })
-  if (!res.ok) {
-    notifyUnauthorized(res.status)
-    throw new ApiError(res.status, res.statusText)
-  }
-  return res.json()
-}
+async function upload(cardId: number, file: File): Promise<Attachment> {}
 
 async function remove(id: number): Promise<void> {
killedBy: attachmentsApi upload ruft POST mit FormData-Body ohne explizites Content-Type
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] StringLiteral
src/api/attachments.ts:25:15
 
 async function upload(cardId: number, file: File): Promise<Attachment> {
   const form = new FormData()
-  form.append('file', file)
+  form.append("", file)
   const res = await fetch(`/api/cards/${cardId}/attachments`, {
     method: 'POST',
killedBy: attachmentsApi upload ruft POST mit FormData-Body ohne explizites Content-Type
statusReason: expected null to be File{ …(1) } // Object.is equality

[Killed] ConditionalExpression
src/api/attachments.ts:31:7
     credentials: 'include',
     body: form, // KEIN Content-Type setzen -> Browser setzt multipart-Boundary
   })
-  if (!res.ok) {
+  if (false) {
     notifyUnauthorized(res.status)
     throw new ApiError(res.status, res.statusText)
killedBy: attachmentsApi upload wirft ApiError bei Fehlerantwort (z. B. Anhangslimit)
statusReason: promise resolved "{}" instead of rejecting

[Killed] BooleanLiteral
src/api/attachments.ts:31:7
     credentials: 'include',
     body: form, // KEIN Content-Type setzen -> Browser setzt multipart-Boundary
   })
-  if (!res.ok) {
+  if (res.ok) {
     notifyUnauthorized(res.status)
     throw new ApiError(res.status, res.statusText)
killedBy: attachmentsApi upload ruft POST mit FormData-Body ohne explizites Content-Type
statusReason: OK

[Killed] BlockStatement
src/api/attachments.ts:38:50
   return res.json()
 }
 
-async function remove(id: number): Promise<void> {
-  const res = await fetch(`/api/attachments/${id}`, { method: 'DELETE', credentials: 'include' })
-  if (!res.ok) {
-    notifyUnauthorized(res.status)
-    throw new ApiError(res.status, res.statusText)
-  }
-}
+async function remove(id: number): Promise<void> {}
 
 /** Lädt den Blob (für die Inline-Vorschau; der Download-Endpunkt liefert Content-Disposition: attachment). */
killedBy: attachmentsApi remove ruft DELETE /api/attachments/{id}
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BooleanLiteral
src/api/attachments.ts:40:7
 
 async function remove(id: number): Promise<void> {
   const res = await fetch(`/api/attachments/${id}`, { method: 'DELETE', credentials: 'include' })
-  if (!res.ok) {
+  if (res.ok) {
     notifyUnauthorized(res.status)
     throw new ApiError(res.status, res.statusText)
killedBy: attachmentsApi remove ruft DELETE /api/attachments/{id}
statusReason: OK

[Killed] ConditionalExpression
src/api/attachments.ts:40:7
 
 async function remove(id: number): Promise<void> {
   const res = await fetch(`/api/attachments/${id}`, { method: 'DELETE', credentials: 'include' })
-  if (!res.ok) {
+  if (true) {
     notifyUnauthorized(res.status)
     throw new ApiError(res.status, res.statusText)
killedBy: attachmentsApi remove ruft DELETE /api/attachments/{id}
statusReason: OK

[Killed] BlockStatement
src/api/attachments.ts:47:53
 }
 
 /** Lädt den Blob (für die Inline-Vorschau; der Download-Endpunkt liefert Content-Disposition: attachment). */
-async function fetchBlob(id: number): Promise<Blob> {
-  const res = await fetch(`/api/attachments/${id}`, { credentials: 'include' })
-  if (!res.ok) {
-    notifyUnauthorized(res.status)
-    throw new ApiError(res.status, res.statusText)
-  }
-  return res.blob()
-}
+async function fetchBlob(id: number): Promise<Blob> {}
 
 export const attachmentsApi = { list: listAttachments, upload, remove, fetchBlob }
killedBy: attachmentsApi fetchBlob ruft GET /api/attachments/{id} und liefert einen Blob
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
src/api/attachments.ts:49:7
 /** Lädt den Blob (für die Inline-Vorschau; der Download-Endpunkt liefert Content-Disposition: attachment). */
 async function fetchBlob(id: number): Promise<Blob> {
   const res = await fetch(`/api/attachments/${id}`, { credentials: 'include' })
-  if (!res.ok) {
+  if (false) {
     notifyUnauthorized(res.status)
     throw new ApiError(res.status, res.statusText)
killedBy: attachmentsApi fetchBlob wirft ApiError bei Fehlerantwort
statusReason: promise resolved "Blob{ …(1) }" instead of rejecting

[Killed] ConditionalExpression
src/api/attachments.ts:49:7
 /** Lädt den Blob (für die Inline-Vorschau; der Download-Endpunkt liefert Content-Disposition: attachment). */
 async function fetchBlob(id: number): Promise<Blob> {
   const res = await fetch(`/api/attachments/${id}`, { credentials: 'include' })
-  if (!res.ok) {
+  if (true) {
     notifyUnauthorized(res.status)
     throw new ApiError(res.status, res.statusText)
killedBy: attachmentsApi fetchBlob ruft GET /api/attachments/{id} und liefert einen Blob
statusReason: OK
