[Killed] ArrowFunction
src/api/backup.ts:50:14
 }
 
 export const backupApi = {
-  getStatus: () => apiFetch<BackupStatus>('/api/admin/backup/status'),
+  getStatus: () => undefined,
 }
 
killedBy: backupApi getStatus ruft GET /api/admin/backup/status und liefert den Stand
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] StringLiteral
src/api/backup.ts:50:43
 }
 
 export const backupApi = {
-  getStatus: () => apiFetch<BackupStatus>('/api/admin/backup/status'),
+  getStatus: () => apiFetch<BackupStatus>(""),
 }
 
killedBy: backupApi getStatus ruft GET /api/admin/backup/status und liefert den Stand
statusReason: expected '' to be '/api/admin/backup/status' // Object.is equality
