[Killed] BlockStatement
src/api/nightRunUsage.ts:185:37
 }
 
 /** Die Zone des Lesers: „die letzte Nacht" ist seine Nacht, nicht die des Servers (Plan E4). */
-export function leserZone(): string {
-  return Intl.DateTimeFormat().resolvedOptions().timeZone
-}
+export function leserZone(): string {}
 
 export const nightRunUsageApi = {
killedBy: nightRunUsageApi schickt ohne ausdrueckliche Zone die Zone des Lesers mit
statusReason: expected 'undefined' to be 'Europe/Berlin' // Object.is equality

[Killed] ArrowFunction
src/api/nightRunUsage.ts:190:10
 }
 
 export const nightRunUsageApi = {
-  night: (projectId: number, date: string, zone: string = leserZone()) =>
-    apiFetch<VerbrauchNacht>(
-      `/api/projects/${projectId}/night-run-usage/night?${new URLSearchParams({ date, zone })}`,
-    ),
+  night: () => undefined,
   period: (
     projectId: number,
killedBy: nightRunUsageApi night ruft GET /api/projects/{id}/night-run-usage/night mit Datum und Zone
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] StringLiteral
src/api/nightRunUsage.ts:192:7
 export const nightRunUsageApi = {
   night: (projectId: number, date: string, zone: string = leserZone()) =>
     apiFetch<VerbrauchNacht>(
-      `/api/projects/${projectId}/night-run-usage/night?${new URLSearchParams({ date, zone })}`,
+      ``,
     ),
   period: (
killedBy: nightRunUsageApi night ruft GET /api/projects/{id}/night-run-usage/night mit Datum und Zone
statusReason: expected '/' to be '/api/projects/4/night-run-usage/night' // Object.is equality

[Killed] ArrowFunction
src/api/nightRunUsage.ts:194:11
     apiFetch<VerbrauchNacht>(
       `/api/projects/${projectId}/night-run-usage/night?${new URLSearchParams({ date, zone })}`,
     ),
-  period: (
-    projectId: number,
-    type: VerbrauchZeitraumArt,
-    stepsBack: number,
-    zone: string = leserZone(),
-  ) =>
-    apiFetch<VerbrauchZeitraum>(
-      `/api/projects/${projectId}/night-run-usage?${new URLSearchParams({
-        type,
-        stepsBack: String(stepsBack),
-        zone,
-      })}`,
-    ),
+  period: () => undefined,
   /**
    * Die Lebenszeit-Summe (Issue #1014). Ohne Parameter: Eine Lebenszeit hat keinen ersten Tag,
killedBy: nightRunUsageApi period ruft GET /api/projects/{id}/night-run-usage mit Art, Rueckschritt und Zone
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ObjectLiteral
src/api/nightRunUsage.ts:201:73
     zone: string = leserZone(),
   ) =>
     apiFetch<VerbrauchZeitraum>(
-      `/api/projects/${projectId}/night-run-usage?${new URLSearchParams({
-        type,
-        stepsBack: String(stepsBack),
-        zone,
-      })}`,
+      `/api/projects/${projectId}/night-run-usage?${new URLSearchParams({})}`,
     ),
   /**
killedBy: nightRunUsageApi period ruft GET /api/projects/{id}/night-run-usage mit Art, Rueckschritt und Zone
statusReason: expected null to be 'WEEK' // Object.is equality

[Killed] ArrowFunction
src/api/nightRunUsage.ts:211:10
    * Die Lebenszeit-Summe (Issue #1014). Ohne Parameter: Eine Lebenszeit hat keinen ersten Tag,
    * keinen Vorzeitraum und keine Zone, nach der sie sich gruppieren ließe.
    */
-  total: (projectId: number) =>
-    apiFetch<VerbrauchGesamt>(`/api/projects/${projectId}/night-run-usage/total`),
+  total: () => undefined,
 }
 
killedBy: nightRunUsageApi total ruft GET /api/projects/{id}/night-run-usage/total ohne einen einzigen Parameter
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] StringLiteral
src/api/nightRunUsage.ts:212:31
    * keinen Vorzeitraum und keine Zone, nach der sie sich gruppieren ließe.
    */
   total: (projectId: number) =>
-    apiFetch<VerbrauchGesamt>(`/api/projects/${projectId}/night-run-usage/total`),
+    apiFetch<VerbrauchGesamt>(``),
 }
 
killedBy: nightRunUsageApi total ruft GET /api/projects/{id}/night-run-usage/total ohne einen einzigen Parameter
statusReason: expected '/' to be '/api/projects/4/night-run-usage/total' // Object.is equality
