[Killed] ArrowFunction
src/api/nightRuns.ts:304:21
   errorClassCounts: (projectId: number) =>
     apiFetch<NightRunErrorClassCounts>(`/api/projects/${projectId}/night-runs/error-class-counts`),
   /** Die Anläufe einer Karte über alle Läufe, jüngster zuerst (Issue #967). */
-  anlaeufeDerKarte: (projectId: number, cardNumber: number) =>
-    apiFetch<NightRunAnlauf[]>(
-      `/api/projects/${projectId}/night-runs/items?cardNumber=${encodeURIComponent(cardNumber)}`,
-    ),
+  anlaeufeDerKarte: () => undefined,
 }
 
killedBy: nightRunsApi anlaeufeDerKarte ruft GET /api/projects/{id}/night-runs/items?cardNumber={n}
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] StringLiteral
src/api/nightRuns.ts:306:7
   /** Die Anläufe einer Karte über alle Läufe, jüngster zuerst (Issue #967). */
   anlaeufeDerKarte: (projectId: number, cardNumber: number) =>
     apiFetch<NightRunAnlauf[]>(
-      `/api/projects/${projectId}/night-runs/items?cardNumber=${encodeURIComponent(cardNumber)}`,
+      ``,
     ),
 }
killedBy: nightRunsApi anlaeufeDerKarte ruft GET /api/projects/{id}/night-runs/items?cardNumber={n}
statusReason: expected '' to be '/api/projects/4/night-runs/items?card…' // Object.is equality
