[Killed] BlockStatement
src/lib/boardHiddenEpics.ts:30:72
  *
  * @param boardId Board, dessen Ausblendungen gemeint sind
  */
-export function leseAusgeblendet(boardId: number): ReadonlySet<number> {
-  try {
-    const raw = localStorage.getItem(hiddenEpicsStorageKey(boardId))
-    return raw ? new Set<number>(JSON.parse(raw) as number[]) : new Set<number>()
-  } catch {
-    return new Set<number>()
-  }
-}
+export function leseAusgeblendet(boardId: number): ReadonlySet<number> {}
 
 /**
killedBy: leseAusgeblendet liefert ohne Eintrag die leere Menge
statusReason: leseAusgeblendet is not a function or its return value is not iterable

[Killed] BlockStatement
src/lib/boardHiddenEpics.ts:31:7
  * @param boardId Board, dessen Ausblendungen gemeint sind
  */
 export function leseAusgeblendet(boardId: number): ReadonlySet<number> {
-  try {
-    const raw = localStorage.getItem(hiddenEpicsStorageKey(boardId))
-    return raw ? new Set<number>(JSON.parse(raw) as number[]) : new Set<number>()
-  } catch {
+  try {} catch {
     return new Set<number>()
   }
killedBy: leseAusgeblendet liefert ohne Eintrag die leere Menge
statusReason: leseAusgeblendet is not a function or its return value is not iterable

[Killed] BlockStatement
src/lib/boardHiddenEpics.ts:34:11
   try {
     const raw = localStorage.getItem(hiddenEpicsStorageKey(boardId))
     return raw ? new Set<number>(JSON.parse(raw) as number[]) : new Set<number>()
-  } catch {
-    return new Set<number>()
-  }
+  } catch {}
 }
 
killedBy: leseAusgeblendet liefert die leere Menge, wenn localStorage nicht verfügbar ist
statusReason: leseAusgeblendet is not a function or its return value is not iterable

[Killed] BlockStatement
src/lib/boardHiddenEpics.ts:50:87
  * @param boardId Board, dessen Ausblendungen gemeint sind
  * @param ids IDs der ausgeblendeten Vorhaben (`Epic.id`)
  */
-export function schreibeAusgeblendet(boardId: number, ids: ReadonlySet<number>): void {
-  try {
-    if (ids.size === 0) {
-      localStorage.removeItem(hiddenEpicsStorageKey(boardId))
-    } else {
-      localStorage.setItem(hiddenEpicsStorageKey(boardId), JSON.stringify([...ids]))
-    }
-  } catch {
-    // localStorage nicht verfügbar
-  }
-}
+export function schreibeAusgeblendet(boardId: number, ids: ReadonlySet<number>): void {}
 
killedBy: schreibeAusgeblendet schreibt eine nicht-leere Menge als JSON-Array
statusReason: expected [] to deeply equal [ 9, 8 ]

[Killed] BlockStatement
src/lib/boardHiddenEpics.ts:51:7
  * @param ids IDs der ausgeblendeten Vorhaben (`Epic.id`)
  */
 export function schreibeAusgeblendet(boardId: number, ids: ReadonlySet<number>): void {
-  try {
-    if (ids.size === 0) {
-      localStorage.removeItem(hiddenEpicsStorageKey(boardId))
-    } else {
-      localStorage.setItem(hiddenEpicsStorageKey(boardId), JSON.stringify([...ids]))
-    }
-  } catch {
+  try {} catch {
     // localStorage nicht verfügbar
   }
killedBy: schreibeAusgeblendet schreibt eine nicht-leere Menge als JSON-Array
statusReason: expected [] to deeply equal [ 9, 8 ]

[Killed] ConditionalExpression
src/lib/boardHiddenEpics.ts:52:9
  */
 export function schreibeAusgeblendet(boardId: number, ids: ReadonlySet<number>): void {
   try {
-    if (ids.size === 0) {
+    if (false) {
       localStorage.removeItem(hiddenEpicsStorageKey(boardId))
     } else {
killedBy: schreibeAusgeblendet löscht den Schlüssel bei leerer Menge, statt ein leeres Array zu hinterlassen
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/boardHiddenEpics.ts:52:9
  */
 export function schreibeAusgeblendet(boardId: number, ids: ReadonlySet<number>): void {
   try {
-    if (ids.size === 0) {
+    if (true) {
       localStorage.removeItem(hiddenEpicsStorageKey(boardId))
     } else {
killedBy: schreibeAusgeblendet schreibt eine nicht-leere Menge als JSON-Array
statusReason: expected [] to deeply equal [ 9, 8 ]

[Killed] BlockStatement
src/lib/boardHiddenEpics.ts:54:12
   try {
     if (ids.size === 0) {
       localStorage.removeItem(hiddenEpicsStorageKey(boardId))
-    } else {
-      localStorage.setItem(hiddenEpicsStorageKey(boardId), JSON.stringify([...ids]))
-    }
+    } else {}
   } catch {
     // localStorage nicht verfügbar
killedBy: schreibeAusgeblendet schreibt eine nicht-leere Menge als JSON-Array
statusReason: expected [] to deeply equal [ 9, 8 ]
