[Killed] BlockStatement
src/lib/boardOps.ts:25:26
 export function spaltenAuswahl(
   angezeigteIds: number[],
   auswahl: ReadonlySet<number>,
-): SpaltenAuswahlZustand {
-  const treffer = angezeigteIds.filter((id) => auswahl.has(id)).length
-  if (treffer === 0) return 'keine'
-  return treffer === angezeigteIds.length ? 'alle' : 'einige'
-}
+): SpaltenAuswahlZustand {}
 
 /**
killedBy: boardOps spaltenAuswahl meldet alle, einige und keine
statusReason: expected undefined to be 'alle' // Object.is equality

[Killed] ArrowFunction
src/lib/boardOps.ts:26:40
   angezeigteIds: number[],
   auswahl: ReadonlySet<number>,
 ): SpaltenAuswahlZustand {
-  const treffer = angezeigteIds.filter((id) => auswahl.has(id)).length
+  const treffer = angezeigteIds.filter(() => undefined).length
   if (treffer === 0) return 'keine'
   return treffer === angezeigteIds.length ? 'alle' : 'einige'
killedBy: boardOps spaltenAuswahl meldet alle, einige und keine
statusReason: expected 'keine' to be 'alle' // Object.is equality

[Killed] MethodExpression
src/lib/boardOps.ts:26:19
   angezeigteIds: number[],
   auswahl: ReadonlySet<number>,
 ): SpaltenAuswahlZustand {
-  const treffer = angezeigteIds.filter((id) => auswahl.has(id)).length
+  const treffer = angezeigteIds.length
   if (treffer === 0) return 'keine'
   return treffer === angezeigteIds.length ? 'alle' : 'einige'
killedBy: boardOps spaltenAuswahl meldet alle, einige und keine
statusReason: expected 'alle' to be 'einige' // Object.is equality

[Killed] ConditionalExpression
src/lib/boardOps.ts:27:7
   auswahl: ReadonlySet<number>,
 ): SpaltenAuswahlZustand {
   const treffer = angezeigteIds.filter((id) => auswahl.has(id)).length
-  if (treffer === 0) return 'keine'
+  if (true) return 'keine'
   return treffer === angezeigteIds.length ? 'alle' : 'einige'
 }
killedBy: boardOps spaltenAuswahl meldet alle, einige und keine
statusReason: expected 'keine' to be 'alle' // Object.is equality

[Killed] ConditionalExpression
src/lib/boardOps.ts:27:7
   auswahl: ReadonlySet<number>,
 ): SpaltenAuswahlZustand {
   const treffer = angezeigteIds.filter((id) => auswahl.has(id)).length
-  if (treffer === 0) return 'keine'
+  if (false) return 'keine'
   return treffer === angezeigteIds.length ? 'alle' : 'einige'
 }
killedBy: boardOps spaltenAuswahl meldet alle, einige und keine
statusReason: expected 'einige' to be 'keine' // Object.is equality

[Killed] EqualityOperator
src/lib/boardOps.ts:28:10
 ): SpaltenAuswahlZustand {
   const treffer = angezeigteIds.filter((id) => auswahl.has(id)).length
   if (treffer === 0) return 'keine'
-  return treffer === angezeigteIds.length ? 'alle' : 'einige'
+  return treffer !== angezeigteIds.length ? 'alle' : 'einige'
 }
 
killedBy: boardOps spaltenAuswahl meldet alle, einige und keine
statusReason: expected 'einige' to be 'alle' // Object.is equality

[Killed] ConditionalExpression
src/lib/boardOps.ts:28:10
 ): SpaltenAuswahlZustand {
   const treffer = angezeigteIds.filter((id) => auswahl.has(id)).length
   if (treffer === 0) return 'keine'
-  return treffer === angezeigteIds.length ? 'alle' : 'einige'
+  return false ? 'alle' : 'einige'
 }
 
killedBy: boardOps spaltenAuswahl meldet alle, einige und keine
statusReason: expected 'einige' to be 'alle' // Object.is equality

[Killed] BlockStatement
src/lib/boardOps.ts:40:16
 export function spaltenAuswahlUmschalten(
   angezeigteIds: number[],
   auswahl: ReadonlySet<number>,
-): Set<number> {
-  const next = new Set(auswahl)
-  const abwaehlen = spaltenAuswahl(angezeigteIds, auswahl) === 'alle'
-  for (const id of angezeigteIds) {
-    if (abwaehlen) next.delete(id)
-    else next.add(id)
-  }
-  return next
-}
+): Set<number> {}
 
 /**
killedBy: boardOps spaltenAuswahlUmschalten ergänzt die fehlenden Karten der Spalte
statusReason: spaltenAuswahlUmschalten is not a function or its return value is not iterable

[Killed] EqualityOperator
src/lib/boardOps.ts:42:21
   auswahl: ReadonlySet<number>,
 ): Set<number> {
   const next = new Set(auswahl)
-  const abwaehlen = spaltenAuswahl(angezeigteIds, auswahl) === 'alle'
+  const abwaehlen = spaltenAuswahl(angezeigteIds, auswahl) !== 'alle'
   for (const id of angezeigteIds) {
     if (abwaehlen) next.delete(id)
killedBy: boardOps spaltenAuswahlUmschalten ergänzt die fehlenden Karten der Spalte
statusReason: expected [ 9 ] to deeply equal [ 1, 9, 2 ]

[Killed] ConditionalExpression
src/lib/boardOps.ts:42:21
   auswahl: ReadonlySet<number>,
 ): Set<number> {
   const next = new Set(auswahl)
-  const abwaehlen = spaltenAuswahl(angezeigteIds, auswahl) === 'alle'
+  const abwaehlen = true
   for (const id of angezeigteIds) {
     if (abwaehlen) next.delete(id)
killedBy: boardOps spaltenAuswahlUmschalten ergänzt die fehlenden Karten der Spalte
statusReason: expected [ 9 ] to deeply equal [ 1, 9, 2 ]

[Killed] BlockStatement
src/lib/boardOps.ts:43:35
 ): Set<number> {
   const next = new Set(auswahl)
   const abwaehlen = spaltenAuswahl(angezeigteIds, auswahl) === 'alle'
-  for (const id of angezeigteIds) {
-    if (abwaehlen) next.delete(id)
-    else next.add(id)
-  }
+  for (const id of angezeigteIds) {}
   return next
 }
killedBy: boardOps spaltenAuswahlUmschalten ergänzt die fehlenden Karten der Spalte
statusReason: expected [ 1, 9 ] to deeply equal [ 1, 9, 2 ]

[Killed] ConditionalExpression
src/lib/boardOps.ts:44:9
   const next = new Set(auswahl)
   const abwaehlen = spaltenAuswahl(angezeigteIds, auswahl) === 'alle'
   for (const id of angezeigteIds) {
-    if (abwaehlen) next.delete(id)
+    if (true) next.delete(id)
     else next.add(id)
   }
killedBy: boardOps spaltenAuswahlUmschalten ergänzt die fehlenden Karten der Spalte
statusReason: expected [ 9 ] to deeply equal [ 1, 9, 2 ]

[Killed] ConditionalExpression
src/lib/boardOps.ts:44:9
   const next = new Set(auswahl)
   const abwaehlen = spaltenAuswahl(angezeigteIds, auswahl) === 'alle'
   for (const id of angezeigteIds) {
-    if (abwaehlen) next.delete(id)
+    if (false) next.delete(id)
     else next.add(id)
   }
killedBy: boardOps spaltenAuswahlUmschalten nimmt bei voller Spalte nur deren Karten heraus
statusReason: expected [ 1, 2, 9 ] to deeply equal [ 9 ]

[Killed] BlockStatement
src/lib/boardOps.ts:56:46
  */
 export function applyMove(cards: Card[], cardId: number, toColumnId: number): Card[] {
   const card = cards.find((c) => c.id === cardId)
-  if (!card || card.columnId === toColumnId) {
-    return cards
-  }
+  if (!card || card.columnId === toColumnId) {}
   const endPosition = activeCardsInColumn(cards, toColumnId).length
   return cards.map((c) => (c.id === cardId ? { ...c, columnId: toColumnId, positionInColumn: endPosition } : c))
killedBy: boardOps applyMove in dieselbe Spalte liefert unveränderte Referenz
statusReason: expected [ { id: 1, boardId: 1, …(17) } ] to be [ { id: 1, boardId: 1, …(17) } ] // Object.is equality

[Killed] ConditionalExpression
src/lib/boardOps.ts:56:16
  */
 export function applyMove(cards: Card[], cardId: number, toColumnId: number): Card[] {
   const card = cards.find((c) => c.id === cardId)
-  if (!card || card.columnId === toColumnId) {
+  if (!card || false) {
     return cards
   }
killedBy: boardOps applyMove in dieselbe Spalte liefert unveränderte Referenz
statusReason: expected [ { id: 1, boardId: 1, …(17) } ] to be [ { id: 1, boardId: 1, …(17) } ] // Object.is equality
