[Killed] BlockStatement
src/lib/cardEpic.ts:26:82
  * @param epics Vorhaben des Boards
  * @returns das Vorhaben oder `undefined`, wenn die Karte in keinem steht
  */
-export function epicOfCard(card: Card, epics: readonly Epic[]): Epic | undefined {
-  const kandidaten = epics.filter((epic) => epic.memberNumbers.includes(card.number))
-  // 0 = über die Herkunft erreicht, 1 = ausdrücklich zugeordnet; kleinerer Rang gewinnt.
-  const rang = (epic: Epic) => (epic.rootNumbers.includes(card.number) ? 1 : 0)
-  kandidaten.sort((a, b) => rang(a) - rang(b) || a.number - b.number)
-  return kandidaten[0]
-}
+export function epicOfCard(card: Card, epics: readonly Epic[]): Epic | undefined {}
 
 /** Was der Kartendialog über das Vorhaben-Feld wissen muss (Plan #1042, E11). */
killedBy: sortCards — Vorhaben sortiert nach dem Kürzel aufsteigend, Karten ohne Vorhaben ans Ende
statusReason: expected [ 1, 2, 3 ] to deeply equal [ 2, 1, 3 ]

[Killed] ConditionalExpression
src/lib/cardEpic.ts:30:29
   const kandidaten = epics.filter((epic) => epic.memberNumbers.includes(card.number))
   // 0 = über die Herkunft erreicht, 1 = ausdrücklich zugeordnet; kleinerer Rang gewinnt.
   const rang = (epic: Epic) => (epic.rootNumbers.includes(card.number) ? 1 : 0)
-  kandidaten.sort((a, b) => rang(a) - rang(b) || a.number - b.number)
+  kandidaten.sort((a, b) => false)
   return kandidaten[0]
 }
killedBy: epicOfCard gibt der Herkunft den Vorrang vor der ausdrücklichen Zuordnung
statusReason: expected 70 to be 80 // Object.is equality

[Killed] ConditionalExpression
src/lib/cardEpic.ts:30:29
   const kandidaten = epics.filter((epic) => epic.memberNumbers.includes(card.number))
   // 0 = über die Herkunft erreicht, 1 = ausdrücklich zugeordnet; kleinerer Rang gewinnt.
   const rang = (epic: Epic) => (epic.rootNumbers.includes(card.number) ? 1 : 0)
-  kandidaten.sort((a, b) => rang(a) - rang(b) || a.number - b.number)
+  kandidaten.sort((a, b) => true)
   return kandidaten[0]
 }
killedBy: epicOfCard gibt der Herkunft den Vorrang vor der ausdrücklichen Zuordnung
statusReason: expected 70 to be 80 // Object.is equality

[Killed] BlockStatement
src/lib/cardEpic.ts:76:46
   parentId,
   selectableEpics,
   epics,
-}: VorhabenFeldEingabe): VorhabenFeldAnsicht {
-  const epicOptionen = selectableEpics ?? epics
-  const epicLesend =
-    !canEditEpic || (parentId !== null && !epicOptionen.some((e) => e.id === parentId))
-  const zugeordnetesVorhaben = epics.find((e) => e.id === parentId)
-  const epicLesendText = zugeordnetesVorhaben
-    ? `${epicShortcode(zugeordnetesVorhaben.title, zugeordnetesVorhaben.shortcode)} – ${zugeordnetesVorhaben.title}`
-    : undefined
-  return { epicOptionen, epicLesend, epicLesendText }
-}
+}: VorhabenFeldEingabe): VorhabenFeldAnsicht {}
 
killedBy: vorhabenFeld nimmt ohne eigenen Optionsvorrat die volle Vorhaben-Liste
statusReason: Cannot read properties of undefined (reading 'epicOptionen')

[Killed] LogicalOperator
src/lib/cardEpic.ts:77:24
   selectableEpics,
   epics,
 }: VorhabenFeldEingabe): VorhabenFeldAnsicht {
-  const epicOptionen = selectableEpics ?? epics
+  const epicOptionen = selectableEpics && epics
   const epicLesend =
     !canEditEpic || (parentId !== null && !epicOptionen.some((e) => e.id === parentId))
killedBy: vorhabenFeld nimmt ohne eigenen Optionsvorrat die volle Vorhaben-Liste
statusReason: expected undefined to deeply equal [ { id: 700, number: 70, …(8) }, …(1) ]

[Killed] ArrowFunction
src/lib/cardEpic.ts:79:62
 }: VorhabenFeldEingabe): VorhabenFeldAnsicht {
   const epicOptionen = selectableEpics ?? epics
   const epicLesend =
-    !canEditEpic || (parentId !== null && !epicOptionen.some((e) => e.id === parentId))
+    !canEditEpic || (parentId !== null && !epicOptionen.some(() => undefined))
   const zugeordnetesVorhaben = epics.find((e) => e.id === parentId)
   const epicLesendText = zugeordnetesVorhaben
killedBy: vorhabenFeld bleibt bearbeitbar, wenn das zugeordnete Vorhaben zur Auswahl steht
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/lib/cardEpic.ts:79:5
 }: VorhabenFeldEingabe): VorhabenFeldAnsicht {
   const epicOptionen = selectableEpics ?? epics
   const epicLesend =
-    !canEditEpic || (parentId !== null && !epicOptionen.some((e) => e.id === parentId))
+    !canEditEpic && parentId !== null && !epicOptionen.some(e => e.id === parentId)
   const zugeordnetesVorhaben = epics.find((e) => e.id === parentId)
   const epicLesendText = zugeordnetesVorhaben
killedBy: vorhabenFeld ist lesend, wenn der Aufrufer die Zuordnung nicht ändern darf
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/cardEpic.ts:80:50
   const epicOptionen = selectableEpics ?? epics
   const epicLesend =
     !canEditEpic || (parentId !== null && !epicOptionen.some((e) => e.id === parentId))
-  const zugeordnetesVorhaben = epics.find((e) => e.id === parentId)
+  const zugeordnetesVorhaben = epics.find((e) => true)
   const epicLesendText = zugeordnetesVorhaben
     ? `${epicShortcode(zugeordnetesVorhaben.title, zugeordnetesVorhaben.shortcode)} – ${zugeordnetesVorhaben.title}`
killedBy: vorhabenFeld bleibt bearbeitbar und ohne Lesetext, solange keine Zuordnung besteht
statusReason: expected 'V70 – Vorhaben 70' to be undefined

[Killed] ArrowFunction
src/lib/cardEpic.ts:80:43
   const epicOptionen = selectableEpics ?? epics
   const epicLesend =
     !canEditEpic || (parentId !== null && !epicOptionen.some((e) => e.id === parentId))
-  const zugeordnetesVorhaben = epics.find((e) => e.id === parentId)
+  const zugeordnetesVorhaben = epics.find(() => undefined)
   const epicLesendText = zugeordnetesVorhaben
     ? `${epicShortcode(zugeordnetesVorhaben.title, zugeordnetesVorhaben.shortcode)} – ${zugeordnetesVorhaben.title}`
killedBy: vorhabenFeld bleibt bearbeitbar, wenn das zugeordnete Vorhaben zur Auswahl steht
statusReason: expected undefined to be 'V70 – Vorhaben 70' // Object.is equality

[Killed] ObjectLiteral
src/lib/cardEpic.ts:84:10
   const epicLesendText = zugeordnetesVorhaben
     ? `${epicShortcode(zugeordnetesVorhaben.title, zugeordnetesVorhaben.shortcode)} – ${zugeordnetesVorhaben.title}`
     : undefined
-  return { epicOptionen, epicLesend, epicLesendText }
+  return {}
 }
 
killedBy: vorhabenFeld nimmt ohne eigenen Optionsvorrat die volle Vorhaben-Liste
statusReason: expected undefined to deeply equal [ { id: 700, number: 70, …(8) }, …(1) ]
