[Killed] ObjectLiteral
src/lib/columnMeta.ts:9:65
 /** Die fünf kanonischen Kanban-Zustände. */
 export type CanonicalState = 'BACKLOG' | 'READY' | 'IN_PROGRESS' | 'IN_REVIEW' | 'DONE'
 
-const CANONICAL_BY_NORMALIZED: Record<string, CanonicalState> = {
-  backlog: 'BACKLOG',
-  ready: 'READY',
-  inprogress: 'IN_PROGRESS',
-  inreview: 'IN_REVIEW',
-  done: 'DONE',
-}
+const CANONICAL_BY_NORMALIZED: Record<string, CanonicalState> = {}
 
 /**
killedBy: canonicalColumnKey bildet Backlog auf BACKLOG ab
statusReason: expected undefined to be 'BACKLOG' // Object.is equality

[Killed] StringLiteral
src/lib/columnMeta.ts:11:10
 
 const CANONICAL_BY_NORMALIZED: Record<string, CanonicalState> = {
   backlog: 'BACKLOG',
-  ready: 'READY',
+  ready: "",
   inprogress: 'IN_PROGRESS',
   inreview: 'IN_REVIEW',
killedBy: canonicalColumnKey bildet Ready auf READY ab
statusReason: expected '' to be 'READY' // Object.is equality

[Killed] StringLiteral
src/lib/columnMeta.ts:12:15
 const CANONICAL_BY_NORMALIZED: Record<string, CanonicalState> = {
   backlog: 'BACKLOG',
   ready: 'READY',
-  inprogress: 'IN_PROGRESS',
+  inprogress: "",
   inreview: 'IN_REVIEW',
   done: 'DONE',
killedBy: canonicalColumnKey bildet In Progress auf IN_PROGRESS ab
statusReason: expected '' to be 'IN_PROGRESS' // Object.is equality

[Killed] BlockStatement
src/lib/columnMeta.ts:25:78
  * (`[^a-z]` statt `\p{L}`). Beide Stellen müssen stets gemeinsam geändert werden, sonst laufen
  * Frontend-Anzeige und Kanban-kompatibler Ingest auseinander.
  */
-export function canonicalColumnKey(name: string): CanonicalState | undefined {
-  return CANONICAL_BY_NORMALIZED[name.toLowerCase().replace(/[^a-z]/g, '')]
-}
+export function canonicalColumnKey(name: string): CanonicalState | undefined {}
 
 /**
killedBy: canonicalColumnKey bildet Backlog auf BACKLOG ab
statusReason: expected undefined to be 'BACKLOG' // Object.is equality

[Killed] MethodExpression
src/lib/columnMeta.ts:26:34
  * Frontend-Anzeige und Kanban-kompatibler Ingest auseinander.
  */
 export function canonicalColumnKey(name: string): CanonicalState | undefined {
-  return CANONICAL_BY_NORMALIZED[name.toLowerCase().replace(/[^a-z]/g, '')]
+  return CANONICAL_BY_NORMALIZED[name.toUpperCase().replace(/[^a-z]/g, '')]
 }
 
killedBy: canonicalColumnKey bildet Backlog auf BACKLOG ab
statusReason: expected undefined to be 'BACKLOG' // Object.is equality

[Killed] Regex
src/lib/columnMeta.ts:26:61
  * Frontend-Anzeige und Kanban-kompatibler Ingest auseinander.
  */
 export function canonicalColumnKey(name: string): CanonicalState | undefined {
-  return CANONICAL_BY_NORMALIZED[name.toLowerCase().replace(/[^a-z]/g, '')]
+  return CANONICAL_BY_NORMALIZED[name.toLowerCase().replace(/[a-z]/g, '')]
 }
 
killedBy: canonicalColumnKey bildet Backlog auf BACKLOG ab
statusReason: expected undefined to be 'BACKLOG' // Object.is equality

[Killed] BlockStatement
src/lib/columnMeta.ts:38:18
 export function otherCanonicalColumns(
   columns: BoardColumn[],
   currentColumnId: number,
-): BoardColumn[] {
-  return [...columns]
-    .sort((a, b) => a.position - b.position)
-    .filter((c) => c.id !== currentColumnId && canonicalColumnKey(c.name) !== undefined)
-}
+): BoardColumn[] {}
 
 /**
killedBy: otherCanonicalColumns schließt die aktuelle Spalte aus
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] MethodExpression
src/lib/columnMeta.ts:39:10
   columns: BoardColumn[],
   currentColumnId: number,
 ): BoardColumn[] {
-  return [...columns]
-    .sort((a, b) => a.position - b.position)
+  return [...columns]
     .filter((c) => c.id !== currentColumnId && canonicalColumnKey(c.name) !== undefined)
 }
killedBy: otherCanonicalColumns sortiert unabhängig von der Eingabereihenfolge nach position
statusReason: expected [ 'Done', 'Backlog', 'Ready' ] to deeply equal [ 'Backlog', 'Ready', 'Done' ]

[Killed] MethodExpression
src/lib/columnMeta.ts:39:10
   columns: BoardColumn[],
   currentColumnId: number,
 ): BoardColumn[] {
-  return [...columns]
-    .sort((a, b) => a.position - b.position)
-    .filter((c) => c.id !== currentColumnId && canonicalColumnKey(c.name) !== undefined)
+  return [...columns].sort((a, b) => a.position - b.position)
 }
 
killedBy: otherCanonicalColumns schließt die aktuelle Spalte aus
statusReason: expected [ 1, 2, 3 ] to deeply equal [ 1, 3 ]

[Killed] ArrowFunction
src/lib/columnMeta.ts:40:11
   currentColumnId: number,
 ): BoardColumn[] {
   return [...columns]
-    .sort((a, b) => a.position - b.position)
+    .sort(() => undefined)
     .filter((c) => c.id !== currentColumnId && canonicalColumnKey(c.name) !== undefined)
 }
killedBy: otherCanonicalColumns sortiert unabhängig von der Eingabereihenfolge nach position
statusReason: expected [ 'Done', 'Backlog', 'Ready' ] to deeply equal [ 'Backlog', 'Ready', 'Done' ]

[Killed] ArithmeticOperator
src/lib/columnMeta.ts:40:21
   currentColumnId: number,
 ): BoardColumn[] {
   return [...columns]
-    .sort((a, b) => a.position - b.position)
+    .sort((a, b) => a.position + b.position)
     .filter((c) => c.id !== currentColumnId && canonicalColumnKey(c.name) !== undefined)
 }
killedBy: otherCanonicalColumns sortiert unabhängig von der Eingabereihenfolge nach position
statusReason: expected [ 'Done', 'Backlog', 'Ready' ] to deeply equal [ 'Backlog', 'Ready', 'Done' ]

[Killed] EqualityOperator
src/lib/columnMeta.ts:41:20
 ): BoardColumn[] {
   return [...columns]
     .sort((a, b) => a.position - b.position)
-    .filter((c) => c.id !== currentColumnId && canonicalColumnKey(c.name) !== undefined)
+    .filter((c) => c.id === currentColumnId && canonicalColumnKey(c.name) !== undefined)
 }
 
killedBy: otherCanonicalColumns schließt die aktuelle Spalte aus
statusReason: expected [ 2 ] to deeply equal [ 1, 3 ]

[Killed] EqualityOperator
src/lib/columnMeta.ts:41:48
 ): BoardColumn[] {
   return [...columns]
     .sort((a, b) => a.position - b.position)
-    .filter((c) => c.id !== currentColumnId && canonicalColumnKey(c.name) !== undefined)
+    .filter((c) => c.id !== currentColumnId && canonicalColumnKey(c.name) === undefined)
 }
 
killedBy: otherCanonicalColumns schließt die aktuelle Spalte aus
statusReason: expected [] to deeply equal [ 1, 3 ]

[Killed] ArrowFunction
src/lib/columnMeta.ts:53:35
   columns: BoardColumn[],
   columnId: number,
 ): { left: BoardColumn | null; right: BoardColumn | null } {
-  const index = columns.findIndex((c) => c.id === columnId)
+  const index = columns.findIndex(() => undefined)
   if (index < 0) {
     return { left: null, right: null }
killedBy: neighbourColumns liefert für eine mittlere Spalte beide Nachbarn
statusReason: expected { left: null, right: null } to deeply equal { left: { id: 10, …(3) }, …(1) }

[Killed] EqualityOperator
src/lib/columnMeta.ts:54:7
   columnId: number,
 ): { left: BoardColumn | null; right: BoardColumn | null } {
   const index = columns.findIndex((c) => c.id === columnId)
-  if (index < 0) {
+  if (index >= 0) {
     return { left: null, right: null }
   }
killedBy: neighbourColumns liefert für eine mittlere Spalte beide Nachbarn
statusReason: expected { left: null, right: null } to deeply equal { left: { id: 10, …(3) }, …(1) }

[Killed] ConditionalExpression
src/lib/columnMeta.ts:58:11
     return { left: null, right: null }
   }
   return {
-    left: index > 0 ? columns[index - 1] : null,
+    left: false ? columns[index - 1] : null,
     right: index < columns.length - 1 ? columns[index + 1] : null,
   }
killedBy: neighbourColumns liefert für eine mittlere Spalte beide Nachbarn
statusReason: expected { left: null, right: { id: 30, …(3) } } to deeply equal { left: { id: 10, …(3) }, …(1) }

[Killed] ConditionalExpression
src/lib/columnMeta.ts:58:11
     return { left: null, right: null }
   }
   return {
-    left: index > 0 ? columns[index - 1] : null,
+    left: true ? columns[index - 1] : null,
     right: index < columns.length - 1 ? columns[index + 1] : null,
   }
killedBy: neighbourColumns liefert für die erste Spalte keinen linken Nachbarn
statusReason: expected { left: undefined, …(1) } to deeply equal { left: null, right: { id: 20, …(3) } }

[Killed] ConditionalExpression
src/lib/columnMeta.ts:59:12
   }
   return {
     left: index > 0 ? columns[index - 1] : null,
-    right: index < columns.length - 1 ? columns[index + 1] : null,
+    right: true ? columns[index + 1] : null,
   }
 }
killedBy: neighbourColumns liefert für die letzte Spalte keinen rechten Nachbarn
statusReason: expected { left: { id: 20, …(3) }, …(1) } to deeply equal { left: { id: 20, …(3) }, right: null }

[Killed] ConditionalExpression
src/lib/columnMeta.ts:59:12
   }
   return {
     left: index > 0 ? columns[index - 1] : null,
-    right: index < columns.length - 1 ? columns[index + 1] : null,
+    right: false ? columns[index + 1] : null,
   }
 }
killedBy: neighbourColumns liefert für eine mittlere Spalte beide Nachbarn
statusReason: expected { left: { id: 10, …(3) }, right: null } to deeply equal { left: { id: 10, …(3) }, …(1) }
