[Killed] Regex
src/lib/designGuard.ts:179:22
 const ELEVATION = /elevation=\{\s*(?!0\s*\})/
 const NUMERIC_SHADOW = /boxShadow\s*:\s*[1-9]/
 /** Ein Schatten mit schwarzem Anteil, auch als Zeichenkette geschrieben. */
-const BLACK_SHADOW = /boxShadow[^,}\n]*(?:rgba?\(\s*0\s*,\s*0\s*,\s*0|#000)/i
+const BLACK_SHADOW = /boxShadow[,}\n]*(?:rgba?\(\s*0\s*,\s*0\s*,\s*0|#000)/i
 
 /**
killedBy: scanSource: was gemeldet wird meldet einen schwarzen Schatten auch als Zeichenkette
statusReason: expected [] to deeply equal [ 'boxShadow' ]

[Killed] ConditionalExpression
src/lib/designGuard.ts:200:11
 
       if (HEX.test(styleText)) push('hex')
       if (ELEVATION.test(line)) push('elevation')
-      if (NUMERIC_SHADOW.test(line) || BLACK_SHADOW.test(line)) push('boxShadow')
+      if (false) push('boxShadow')
     })
 
killedBy: scanSource: was gemeldet wird meldet Hex-Farben, positive elevation und numerischen boxShadow
statusReason: expected [ 'elevation', 'hex' ] to deeply equal [ 'boxShadow', 'elevation', 'hex' ]

[Killed] ConditionalExpression
src/lib/designGuard.ts:207:3
 }
 
 const covers = (violation: DesignViolation, entry: DesignAllowance) =>
-  entry.file === violation.file && entry.rule === violation.rule
+  false
 
 /** Verstoesse, die keine Ausnahme deckt — sie machen die Leitplanke rot. */
killedBy: Ausnahmeliste laesst genau die gedeckten Verstoesse durch
statusReason: expected [ { …(4) }, { …(4) } ] to deeply equal [ Array(1) ]

[Killed] MethodExpression
src/lib/designGuard.ts:214:10
   violations: readonly DesignViolation[],
   allowlist: readonly DesignAllowance[],
 ): DesignViolation[] {
-  return violations.filter((violation) => !allowlist.some((entry) => covers(violation, entry)))
+  return violations
 }
 
killedBy: Ausnahmeliste laesst genau die gedeckten Verstoesse durch
statusReason: expected [ { …(4) }, { …(4) } ] to deeply equal [ Array(1) ]

[Killed] ArrowFunction
src/lib/designGuard.ts:226:55
   violations: readonly DesignViolation[],
   allowlist: readonly DesignAllowance[],
 ): DesignAllowance[] {
-  return allowlist.filter((entry) => !violations.some((violation) => covers(violation, entry)))
+  return allowlist.filter((entry) => !violations.some(() => undefined))
 }
 
killedBy: Ausnahmeliste meldet einen Eintrag, der keinen Verstoss mehr deckt
statusReason: expected [ { …(3) }, { …(3) } ] to deeply equal [ Array(1) ]
