[Killed] BlockStatement
src/lib/epicMeta.ts:27:58
  * **Der Tint ist ein eigener Wert, keine Rechnung auf dem Farbton.** Auf einem Variablen-Verweis
  * ergäbe `${hue}22` ungültiges CSS, und die Fläche verschwände still.
  */
-const tint = (hex: string, deckkraft: number): string => {
-  const [r, g, b] = [1, 3, 5].map((i) => Number.parseInt(hex.slice(i, i + 2), 16))
-  return `rgba(${r},${g},${b},${deckkraft})`
-}
+const tint = (hex: string, deckkraft: number): string => {}
 
 const HELL = ['#935327', '#2A63B3', '#25713E', '#835C10']
killedBy: EPIC_FARBWERTE führt in beiden Erscheinungsbildern die vier Schild-Töne des Entwurfs mit Farbton und Tint
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] ArrowFunction
src/lib/epicMeta.ts:28:35
  * ergäbe `${hue}22` ungültiges CSS, und die Fläche verschwände still.
  */
 const tint = (hex: string, deckkraft: number): string => {
-  const [r, g, b] = [1, 3, 5].map((i) => Number.parseInt(hex.slice(i, i + 2), 16))
+  const [r, g, b] = [1, 3, 5].map(() => undefined)
   return `rgba(${r},${g},${b},${deckkraft})`
 }
killedBy: EPIC_FARBWERTE führt in beiden Erscheinungsbildern die vier Schild-Töne des Entwurfs mit Farbton und Tint
statusReason: expected 'rgba(undefined,undefined,undefined,0.…' to match /^rgba\(\d+,\d+,\d+,0\.\d+\)$/

[Killed] MethodExpression
src/lib/epicMeta.ts:28:58
  * ergäbe `${hue}22` ungültiges CSS, und die Fläche verschwände still.
  */
 const tint = (hex: string, deckkraft: number): string => {
-  const [r, g, b] = [1, 3, 5].map((i) => Number.parseInt(hex.slice(i, i + 2), 16))
+  const [r, g, b] = [1, 3, 5].map((i) => Number.parseInt(hex, 16))
   return `rgba(${r},${g},${b},${deckkraft})`
 }
killedBy: EPIC_FARBWERTE führt in beiden Erscheinungsbildern die vier Schild-Töne des Entwurfs mit Farbton und Tint
statusReason: expected 'rgba(NaN,NaN,NaN,0.13)' to match /^rgba\(\d+,\d+,\d+,0\.\d+\)$/

[Killed] StringLiteral
src/lib/epicMeta.ts:32:15
   return `rgba(${r},${g},${b},${deckkraft})`
 }
 
-const HELL = ['#935327', '#2A63B3', '#25713E', '#835C10']
+const HELL = ["", '#2A63B3', '#25713E', '#835C10']
 const DUNKEL = ['#D08A52', '#629BF1', '#46C46F', '#E0AE49']
 
killedBy: EPIC_FARBWERTE führt in beiden Erscheinungsbildern die vier Schild-Töne des Entwurfs mit Farbton und Tint
statusReason: expected '' to match /^#[0-9A-F]{6}$/

[Killed] StringLiteral
src/lib/epicMeta.ts:32:26
   return `rgba(${r},${g},${b},${deckkraft})`
 }
 
-const HELL = ['#935327', '#2A63B3', '#25713E', '#835C10']
+const HELL = ['#935327', "", '#25713E', '#835C10']
 const DUNKEL = ['#D08A52', '#629BF1', '#46C46F', '#E0AE49']
 
killedBy: EPIC_FARBWERTE führt in beiden Erscheinungsbildern die vier Schild-Töne des Entwurfs mit Farbton und Tint
statusReason: expected '' to match /^#[0-9A-F]{6}$/

[Killed] StringLiteral
src/lib/epicMeta.ts:33:17
 }
 
 const HELL = ['#935327', '#2A63B3', '#25713E', '#835C10']
-const DUNKEL = ['#D08A52', '#629BF1', '#46C46F', '#E0AE49']
+const DUNKEL = ["", '#629BF1', '#46C46F', '#E0AE49']
 
 export const EPIC_FARBWERTE: Readonly<Record<'light' | 'dark', ReadonlyArray<EpicFarbe>>> = {
killedBy: EPIC_FARBWERTE führt in beiden Erscheinungsbildern die vier Schild-Töne des Entwurfs mit Farbton und Tint
statusReason: expected '' to match /^#[0-9A-F]{6}$/

[Killed] ArrayDeclaration
src/lib/epicMeta.ts:33:16
 }
 
 const HELL = ['#935327', '#2A63B3', '#25713E', '#835C10']
-const DUNKEL = ['#D08A52', '#629BF1', '#46C46F', '#E0AE49']
+const DUNKEL = []
 
 export const EPIC_FARBWERTE: Readonly<Record<'light' | 'dark', ReadonlyArray<EpicFarbe>>> = {
killedBy: EPIC_FARBWERTE führt in beiden Erscheinungsbildern die vier Schild-Töne des Entwurfs mit Farbton und Tint
statusReason: expected [] to have a length of 4 but got +0

[Killed] ObjectLiteral
src/lib/epicMeta.ts:35:93
 const HELL = ['#935327', '#2A63B3', '#25713E', '#835C10']
 const DUNKEL = ['#D08A52', '#629BF1', '#46C46F', '#E0AE49']
 
-export const EPIC_FARBWERTE: Readonly<Record<'light' | 'dark', ReadonlyArray<EpicFarbe>>> = {
-  light: HELL.map((hue) => ({ hue, tint: tint(hue, 0.13) })),
-  dark: DUNKEL.map((hue) => ({ hue, tint: tint(hue, 0.13) })),
-}
+export const EPIC_FARBWERTE: Readonly<Record<'light' | 'dark', ReadonlyArray<EpicFarbe>>> = {}
 
 function hashId(id: number): number {
killedBy: epicColor ist stabil pro Epic-ID
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/lib/epicMeta.ts:36:19
 const DUNKEL = ['#D08A52', '#629BF1', '#46C46F', '#E0AE49']
 
 export const EPIC_FARBWERTE: Readonly<Record<'light' | 'dark', ReadonlyArray<EpicFarbe>>> = {
-  light: HELL.map((hue) => ({ hue, tint: tint(hue, 0.13) })),
+  light: HELL.map(() => undefined),
   dark: DUNKEL.map((hue) => ({ hue, tint: tint(hue, 0.13) })),
 }
killedBy: EPIC_FARBWERTE führt in beiden Erscheinungsbildern die vier Schild-Töne des Entwurfs mit Farbton und Tint
statusReason: Cannot read properties of undefined (reading 'hue')

[Killed] ObjectLiteral
src/lib/epicMeta.ts:36:29
 const DUNKEL = ['#D08A52', '#629BF1', '#46C46F', '#E0AE49']
 
 export const EPIC_FARBWERTE: Readonly<Record<'light' | 'dark', ReadonlyArray<EpicFarbe>>> = {
-  light: HELL.map((hue) => ({ hue, tint: tint(hue, 0.13) })),
+  light: HELL.map((hue) => ({})),
   dark: DUNKEL.map((hue) => ({ hue, tint: tint(hue, 0.13) })),
 }
killedBy: EPIC_FARBWERTE führt in beiden Erscheinungsbildern die vier Schild-Töne des Entwurfs mit Farbton und Tint
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] ArrowFunction
src/lib/epicMeta.ts:37:20
 
 export const EPIC_FARBWERTE: Readonly<Record<'light' | 'dark', ReadonlyArray<EpicFarbe>>> = {
   light: HELL.map((hue) => ({ hue, tint: tint(hue, 0.13) })),
-  dark: DUNKEL.map((hue) => ({ hue, tint: tint(hue, 0.13) })),
+  dark: DUNKEL.map(() => undefined),
 }
 
killedBy: EPIC_FARBWERTE führt in beiden Erscheinungsbildern die vier Schild-Töne des Entwurfs mit Farbton und Tint
statusReason: Cannot read properties of undefined (reading 'hue')

[Killed] ObjectLiteral
src/lib/epicMeta.ts:37:30
 
 export const EPIC_FARBWERTE: Readonly<Record<'light' | 'dark', ReadonlyArray<EpicFarbe>>> = {
   light: HELL.map((hue) => ({ hue, tint: tint(hue, 0.13) })),
-  dark: DUNKEL.map((hue) => ({ hue, tint: tint(hue, 0.13) })),
+  dark: DUNKEL.map((hue) => ({})),
 }
 
killedBy: EPIC_FARBWERTE führt in beiden Erscheinungsbildern die vier Schild-Töne des Entwurfs mit Farbton und Tint
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] EqualityOperator
src/lib/epicMeta.ts:43:19
 function hashId(id: number): number {
   const s = String(id)
   let h = 0
-  for (let i = 0; i < s.length; i++) {
+  for (let i = 0; i <= s.length; i++) {
     // codePointAt(i) ist hier immer definiert (i < s.length) — das Non-null-`!` vermeidet den
     // unerreichbaren `?? 0`-Zweig (100 % Branch) und hält zugleich codePointAt (Sonar S7758).
killedBy: epicColor verteilt verschiedene Vorhaben auf verschiedene Plätze
statusReason: expected 1 to be 4 // Object.is equality

[Killed] BlockStatement
src/lib/epicMeta.ts:52:36
 }
 
 /** Palettenplatz eines Vorhabens: stabil anhand seiner ID. */
-function platz(id: number): number {
-  return hashId(id) % EPIC_FARBWERTE.light.length
-}
+function platz(id: number): number {}
 
 /**
killedBy: epicColor liefert einen Verweis auf den Farbton eines Palettenplatzes
statusReason: expected 'var(--mb-palette-epic-undefined-hue)' to match /^var\(--mb-palette-epic-[0-3]-hue\)$/

[Killed] ArithmeticOperator
src/lib/epicMeta.ts:53:10
 
 /** Palettenplatz eines Vorhabens: stabil anhand seiner ID. */
 function platz(id: number): number {
-  return hashId(id) % EPIC_FARBWERTE.light.length
+  return hashId(id) * EPIC_FARBWERTE.light.length
 }
 
killedBy: epicColor liefert einen Verweis auf den Farbton eines Palettenplatzes
statusReason: expected 'var(--mb-palette-epic-220-hue)' to match /^var\(--mb-palette-epic-[0-3]-hue\)$/

[Killed] BlockStatement
src/lib/epicMeta.ts:61:47
  * die **linke Kante** der zugehörigen Karten (Designsprache „Kante", #648); die Oberkante trägt den
  * Status.
  */
-export function epicColor(id: number): string {
-  return `var(--mb-palette-epic-${platz(id)}-hue)`
-}
+export function epicColor(id: number): string {}
 
 /** Getönte Fläche eines Vorhabens, aus demselben Palettenplatz wie {@link epicColor}. */
killedBy: epicColor liefert einen Verweis auf den Farbton eines Palettenplatzes
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] StringLiteral
src/lib/epicMeta.ts:62:10
  * Status.
  */
 export function epicColor(id: number): string {
-  return `var(--mb-palette-epic-${platz(id)}-hue)`
+  return ``
 }
 
killedBy: epicColor liefert einen Verweis auf den Farbton eines Palettenplatzes
statusReason: expected '' to match /^var\(--mb-palette-epic-[0-3]-hue\)$/

[Killed] BlockStatement
src/lib/epicMeta.ts:66:46
 }
 
 /** Getönte Fläche eines Vorhabens, aus demselben Palettenplatz wie {@link epicColor}. */
-export function epicTint(id: number): string {
-  return `var(--mb-palette-epic-${platz(id)}-tint)`
-}
+export function epicTint(id: number): string {}
 
 /**
killedBy: epicTint liefert für dieselbe ID den Tint-Verweis desselben Palettenplatzes
statusReason: expected undefined to be 'var(--mb-palette-epic-1-tint)' // Object.is equality
