[Killed] BlockStatement
src/lib/epicToCard.ts:4:63
 import type { Card } from '../api/cards'
 import type { Epic } from '../api/epics'
 
-export function epicToCard(epic: Epic, boardId: number): Card {
-  return {
-    id: epic.id, boardId, columnId: 0, number: epic.number, title: epic.title,
-    description: epic.description, excerpt: null, positionInColumn: 0, archived: false, ideaStored: false, movedToDoneAt: null,
-    dependencies: [], type: 'EPIC', parentId: null, shortcode: epic.shortcode, assignees: [], dueDate: null, labels: [],
-    // Vorhaben tragen keine Herkunft (Issue #607): der Anlege-Endpunkt lehnt sie fuer EPIC ab.
-    derivedFrom: null,
-  }
-}
+export function epicToCard(epic: Epic, boardId: number): Card {}
 
killedBy: epicToCard uebernimmt Titel, Nummer und ID des Vorhabens
statusReason: Cannot read properties of undefined (reading 'title')

[Killed] ObjectLiteral
src/lib/epicToCard.ts:5:10
 import type { Epic } from '../api/epics'
 
 export function epicToCard(epic: Epic, boardId: number): Card {
-  return {
-    id: epic.id, boardId, columnId: 0, number: epic.number, title: epic.title,
-    description: epic.description, excerpt: null, positionInColumn: 0, archived: false, ideaStored: false, movedToDoneAt: null,
-    dependencies: [], type: 'EPIC', parentId: null, shortcode: epic.shortcode, assignees: [], dueDate: null, labels: [],
-    // Vorhaben tragen keine Herkunft (Issue #607): der Anlege-Endpunkt lehnt sie fuer EPIC ab.
-    derivedFrom: null,
-  }
+  return {}
 }
 
killedBy: epicToCard uebernimmt Titel, Nummer und ID des Vorhabens
statusReason: expected undefined to be 'Vorhaben Kuerzel' // Object.is equality

[Survived] BooleanLiteral
src/lib/epicToCard.ts:7:82
 export function epicToCard(epic: Epic, boardId: number): Card {
   return {
     id: epic.id, boardId, columnId: 0, number: epic.number, title: epic.title,
-    description: epic.description, excerpt: null, positionInColumn: 0, archived: false, ideaStored: false, movedToDoneAt: null,
+    description: epic.description, excerpt: null, positionInColumn: 0, archived: true, ideaStored: false, movedToDoneAt: null,
     dependencies: [], type: 'EPIC', parentId: null, shortcode: epic.shortcode, assignees: [], dueDate: null, labels: [],
     // Vorhaben tragen keine Herkunft (Issue #607): der Anlege-Endpunkt lehnt sie fuer EPIC ab.

[Survived] BooleanLiteral
src/lib/epicToCard.ts:7:101
 export function epicToCard(epic: Epic, boardId: number): Card {
   return {
     id: epic.id, boardId, columnId: 0, number: epic.number, title: epic.title,
-    description: epic.description, excerpt: null, positionInColumn: 0, archived: false, ideaStored: false, movedToDoneAt: null,
+    description: epic.description, excerpt: null, positionInColumn: 0, archived: false, ideaStored: true, movedToDoneAt: null,
     dependencies: [], type: 'EPIC', parentId: null, shortcode: epic.shortcode, assignees: [], dueDate: null, labels: [],
     // Vorhaben tragen keine Herkunft (Issue #607): der Anlege-Endpunkt lehnt sie fuer EPIC ab.

[Killed] StringLiteral
src/lib/epicToCard.ts:8:29
   return {
     id: epic.id, boardId, columnId: 0, number: epic.number, title: epic.title,
     description: epic.description, excerpt: null, positionInColumn: 0, archived: false, ideaStored: false, movedToDoneAt: null,
-    dependencies: [], type: 'EPIC', parentId: null, shortcode: epic.shortcode, assignees: [], dueDate: null, labels: [],
+    dependencies: [], type: "", parentId: null, shortcode: epic.shortcode, assignees: [], dueDate: null, labels: [],
     // Vorhaben tragen keine Herkunft (Issue #607): der Anlege-Endpunkt lehnt sie fuer EPIC ab.
     derivedFrom: null,
killedBy: epicToCard erzeugt eine Karte vom Typ Vorhaben
statusReason: expected '' to be 'EPIC' // Object.is equality

[Survived] ArrayDeclaration
src/lib/epicToCard.ts:8:19
   return {
     id: epic.id, boardId, columnId: 0, number: epic.number, title: epic.title,
     description: epic.description, excerpt: null, positionInColumn: 0, archived: false, ideaStored: false, movedToDoneAt: null,
-    dependencies: [], type: 'EPIC', parentId: null, shortcode: epic.shortcode, assignees: [], dueDate: null, labels: [],
+    dependencies: ["Stryker was here"], type: 'EPIC', parentId: null, shortcode: epic.shortcode, assignees: [], dueDate: null, labels: [],
     // Vorhaben tragen keine Herkunft (Issue #607): der Anlege-Endpunkt lehnt sie fuer EPIC ab.
     derivedFrom: null,
