[Killed] BlockStatement
src/lib/kettenErzeugnisse.ts:27:110
  * Anlagezeitpunkt ({@link imFenster}) — die Herkunft allein nennt auch einen Plan aus einer
  * früheren Nacht.
  */
-export function kandidaten(karten: readonly Card[], anforderung: number): { plaene: Card[]; pakete: Card[] } {
-  const plaene = karten.filter((karte) => karte.derivedFrom === anforderung)
-  const planNummern = new Set(plaene.map((karte) => karte.number))
-  const pakete = karten.filter((karte) => karte.derivedFrom !== null && planNummern.has(karte.derivedFrom))
-  return { plaene, pakete }
-}
+export function kandidaten(karten: readonly Card[], anforderung: number): { plaene: Card[]; pakete: Card[] } {}
 
 /** Der Anlagezeitpunkt einer Karte aus ihrem Verlauf; `undefined`, wo der Verlauf keinen führt. */
killedBy: kandidaten nimmt Pläne mit der Anforderung als Herkunft und Pakete unter diesen Plänen
statusReason: Cannot destructure property 'plaene' of 'kandidaten(...)' as it is undefined.

[Killed] MethodExpression
src/lib/kettenErzeugnisse.ts:28:18
  * früheren Nacht.
  */
 export function kandidaten(karten: readonly Card[], anforderung: number): { plaene: Card[]; pakete: Card[] } {
-  const plaene = karten.filter((karte) => karte.derivedFrom === anforderung)
+  const plaene = karten
   const planNummern = new Set(plaene.map((karte) => karte.number))
   const pakete = karten.filter((karte) => karte.derivedFrom !== null && planNummern.has(karte.derivedFrom))
killedBy: kandidaten nimmt Pläne mit der Anforderung als Herkunft und Pakete unter diesen Plänen
statusReason: expected [ 10, 11, 12, 13 ] to deeply equal [ 10 ]

[Killed] ConditionalExpression
src/lib/kettenErzeugnisse.ts:28:43
  * früheren Nacht.
  */
 export function kandidaten(karten: readonly Card[], anforderung: number): { plaene: Card[]; pakete: Card[] } {
-  const plaene = karten.filter((karte) => karte.derivedFrom === anforderung)
+  const plaene = karten.filter((karte) => true)
   const planNummern = new Set(plaene.map((karte) => karte.number))
   const pakete = karten.filter((karte) => karte.derivedFrom !== null && planNummern.has(karte.derivedFrom))
killedBy: kandidaten nimmt Pläne mit der Anforderung als Herkunft und Pakete unter diesen Plänen
statusReason: expected [ 10, 11, 12, 13 ] to deeply equal [ 10 ]

[Killed] ArrowFunction
src/lib/kettenErzeugnisse.ts:29:42
  */
 export function kandidaten(karten: readonly Card[], anforderung: number): { plaene: Card[]; pakete: Card[] } {
   const plaene = karten.filter((karte) => karte.derivedFrom === anforderung)
-  const planNummern = new Set(plaene.map((karte) => karte.number))
+  const planNummern = new Set(plaene.map(() => undefined))
   const pakete = karten.filter((karte) => karte.derivedFrom !== null && planNummern.has(karte.derivedFrom))
   return { plaene, pakete }
killedBy: kandidaten nimmt Pläne mit der Anforderung als Herkunft und Pakete unter diesen Plänen
statusReason: expected [] to deeply equal [ 11 ]

[Killed] ConditionalExpression
src/lib/kettenErzeugnisse.ts:30:43
 export function kandidaten(karten: readonly Card[], anforderung: number): { plaene: Card[]; pakete: Card[] } {
   const plaene = karten.filter((karte) => karte.derivedFrom === anforderung)
   const planNummern = new Set(plaene.map((karte) => karte.number))
-  const pakete = karten.filter((karte) => karte.derivedFrom !== null && planNummern.has(karte.derivedFrom))
+  const pakete = karten.filter((karte) => true)
   return { plaene, pakete }
 }
killedBy: kandidaten nimmt Pläne mit der Anforderung als Herkunft und Pakete unter diesen Plänen
statusReason: expected [ 10, 11, 12, 13 ] to deeply equal [ 11 ]

[Killed] ArrowFunction
src/lib/kettenErzeugnisse.ts:30:32
 export function kandidaten(karten: readonly Card[], anforderung: number): { plaene: Card[]; pakete: Card[] } {
   const plaene = karten.filter((karte) => karte.derivedFrom === anforderung)
   const planNummern = new Set(plaene.map((karte) => karte.number))
-  const pakete = karten.filter((karte) => karte.derivedFrom !== null && planNummern.has(karte.derivedFrom))
+  const pakete = karten.filter(() => undefined)
   return { plaene, pakete }
 }
killedBy: kandidaten nimmt Pläne mit der Anforderung als Herkunft und Pakete unter diesen Plänen
statusReason: expected [] to deeply equal [ 11 ]

[Killed] BlockStatement
src/lib/kettenErzeugnisse.ts:35:82
 }
 
 /** Der Anlagezeitpunkt einer Karte aus ihrem Verlauf; `undefined`, wo der Verlauf keinen führt. */
-export function anlagezeit(verlauf: readonly CardActivity[]): number | undefined {
-  const angelegt = verlauf.find((eintrag) => eintrag.type === 'CREATED')
-  if (angelegt === undefined) {
-    return undefined
-  }
-  const zeit = Date.parse(angelegt.createdAt)
-  return Number.isNaN(zeit) ? undefined : zeit
-}
+export function anlagezeit(verlauf: readonly CardActivity[]): number | undefined {}
 
 /** Liegt ein Anlagezeitpunkt im Fenster des Laufs? Eine Karte ohne bekannten Zeitpunkt zählt nicht. */
killedBy: anlagezeit liest den Zeitpunkt des Anlegens aus dem Verlauf
statusReason: expected undefined to be 1788253200000 // Object.is equality

[Killed] ArrowFunction
src/lib/kettenErzeugnisse.ts:36:33
 
 /** Der Anlagezeitpunkt einer Karte aus ihrem Verlauf; `undefined`, wo der Verlauf keinen führt. */
 export function anlagezeit(verlauf: readonly CardActivity[]): number | undefined {
-  const angelegt = verlauf.find((eintrag) => eintrag.type === 'CREATED')
+  const angelegt = verlauf.find(() => undefined)
   if (angelegt === undefined) {
     return undefined
killedBy: anlagezeit liest den Zeitpunkt des Anlegens aus dem Verlauf
statusReason: expected undefined to be 1788253200000 // Object.is equality

[Killed] ConditionalExpression
src/lib/kettenErzeugnisse.ts:36:46
 
 /** Der Anlagezeitpunkt einer Karte aus ihrem Verlauf; `undefined`, wo der Verlauf keinen führt. */
 export function anlagezeit(verlauf: readonly CardActivity[]): number | undefined {
-  const angelegt = verlauf.find((eintrag) => eintrag.type === 'CREATED')
+  const angelegt = verlauf.find((eintrag) => false)
   if (angelegt === undefined) {
     return undefined
killedBy: anlagezeit liest den Zeitpunkt des Anlegens aus dem Verlauf
statusReason: expected undefined to be 1788253200000 // Object.is equality

[Killed] EqualityOperator
src/lib/kettenErzeugnisse.ts:37:7
 /** Der Anlagezeitpunkt einer Karte aus ihrem Verlauf; `undefined`, wo der Verlauf keinen führt. */
 export function anlagezeit(verlauf: readonly CardActivity[]): number | undefined {
   const angelegt = verlauf.find((eintrag) => eintrag.type === 'CREATED')
-  if (angelegt === undefined) {
+  if (angelegt !== undefined) {
     return undefined
   }
killedBy: anlagezeit liest den Zeitpunkt des Anlegens aus dem Verlauf
statusReason: expected undefined to be 1788253200000 // Object.is equality

[Killed] ConditionalExpression
src/lib/kettenErzeugnisse.ts:37:7
 /** Der Anlagezeitpunkt einer Karte aus ihrem Verlauf; `undefined`, wo der Verlauf keinen führt. */
 export function anlagezeit(verlauf: readonly CardActivity[]): number | undefined {
   const angelegt = verlauf.find((eintrag) => eintrag.type === 'CREATED')
-  if (angelegt === undefined) {
+  if (true) {
     return undefined
   }
killedBy: anlagezeit liest den Zeitpunkt des Anlegens aus dem Verlauf
statusReason: expected undefined to be 1788253200000 // Object.is equality

[Killed] BlockStatement
src/lib/kettenErzeugnisse.ts:45:83
 }
 
 /** Liegt ein Anlagezeitpunkt im Fenster des Laufs? Eine Karte ohne bekannten Zeitpunkt zählt nicht. */
-export function imFenster(zeit: number | undefined, fenster: Laufenster): boolean {
-  return zeit !== undefined && zeit >= fenster.von && zeit <= fenster.bis
-}
+export function imFenster(zeit: number | undefined, fenster: Laufenster): boolean {}
 
 /** Die Nummern aufsteigend und ohne Doppel. */
killedBy: imFenster zählt die Ränder mit und eine unbekannte Zeit nie
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/kettenErzeugnisse.ts:46:10
 
 /** Liegt ein Anlagezeitpunkt im Fenster des Laufs? Eine Karte ohne bekannten Zeitpunkt zählt nicht. */
 export function imFenster(zeit: number | undefined, fenster: Laufenster): boolean {
-  return zeit !== undefined && zeit >= fenster.von && zeit <= fenster.bis
+  return true
 }
 
killedBy: imFenster zählt die Ränder mit und eine unbekannte Zeit nie
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/kettenErzeugnisse.ts:46:10
 
 /** Liegt ein Anlagezeitpunkt im Fenster des Laufs? Eine Karte ohne bekannten Zeitpunkt zählt nicht. */
 export function imFenster(zeit: number | undefined, fenster: Laufenster): boolean {
-  return zeit !== undefined && zeit >= fenster.von && zeit <= fenster.bis
+  return true && zeit <= fenster.bis
 }
 
killedBy: imFenster zählt die Ränder mit und eine unbekannte Zeit nie
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/lib/kettenErzeugnisse.ts:50:21
 }
 
 /** Die Nummern aufsteigend und ohne Doppel. */
-const aufsteigend = (karten: readonly Card[]): number[] =>
-  [...new Set(karten.map((karte) => karte.number))].sort((a, b) => a - b)
+const aufsteigend = () => undefined
 
 /**
killedBy: ermittleErzeugnisse liefert je Anforderung die im Lauf angelegten Pläne und Pakete, über alle Boards
statusReason: expected { plaene: undefined, …(2) } to deeply equal { plaene: [ 773 ], …(2) }

[Killed] ArithmeticOperator
src/lib/kettenErzeugnisse.ts:51:68
 
 /** Die Nummern aufsteigend und ohne Doppel. */
 const aufsteigend = (karten: readonly Card[]): number[] =>
-  [...new Set(karten.map((karte) => karte.number))].sort((a, b) => a - b)
+  [...new Set(karten.map((karte) => karte.number))].sort((a, b) => a + b)
 
 /**
killedBy: ermittleErzeugnisse liefert je Anforderung die im Lauf angelegten Pläne und Pakete, über alle Boards
statusReason: expected { plaene: [ 773 ], …(2) } to deeply equal { plaene: [ 773 ], …(2) }

[Killed] ArrowFunction
src/lib/kettenErzeugnisse.ts:51:26
 
 /** Die Nummern aufsteigend und ohne Doppel. */
 const aufsteigend = (karten: readonly Card[]): number[] =>
-  [...new Set(karten.map((karte) => karte.number))].sort((a, b) => a - b)
+  [...new Set(karten.map(() => undefined))].sort((a, b) => a - b)
 
 /**
killedBy: ermittleErzeugnisse liefert je Anforderung die im Lauf angelegten Pläne und Pakete, über alle Boards
statusReason: expected { plaene: [ undefined ], …(2) } to deeply equal { plaene: [ 773 ], …(2) }

[Killed] ArrowFunction
src/lib/kettenErzeugnisse.ts:70:48
   fenster: Laufenster,
 ): Promise<Map<number, Erzeugnisse>> {
   const boards = await boardsApi.list(projektId)
-  const karten = (await Promise.all(boards.map((board) => cardsApi.list(board.id)))).flat()
+  const karten = (await Promise.all(boards.map(() => undefined))).flat()
 
   const je = anforderungen.map((anforderung) => ({ anforderung, ...kandidaten(karten, anforderung) }))
killedBy: ermittleErzeugnisse liefert je Anforderung die im Lauf angelegten Pläne und Pakete, über alle Boards
statusReason: Cannot read properties of undefined (reading 'derivedFrom')

[Killed] ArrowFunction
src/lib/kettenErzeugnisse.ts:72:32
   const boards = await boardsApi.list(projektId)
   const karten = (await Promise.all(boards.map((board) => cardsApi.list(board.id)))).flat()
 
-  const je = anforderungen.map((anforderung) => ({ anforderung, ...kandidaten(karten, anforderung) }))
+  const je = anforderungen.map(() => undefined)
   const alle = [...new Map(je.flatMap(({ plaene, pakete }) => [...plaene, ...pakete]).map((k) => [k.id, k])).values()]
   const zeiten = new Map(
killedBy: ermittleErzeugnisse liefert je Anforderung die im Lauf angelegten Pläne und Pakete, über alle Boards
statusReason: Cannot destructure property 'plaene' of 'undefined' as it is undefined.

[Killed] ArrowFunction
src/lib/kettenErzeugnisse.ts:73:39
   const karten = (await Promise.all(boards.map((board) => cardsApi.list(board.id)))).flat()
 
   const je = anforderungen.map((anforderung) => ({ anforderung, ...kandidaten(karten, anforderung) }))
-  const alle = [...new Map(je.flatMap(({ plaene, pakete }) => [...plaene, ...pakete]).map((k) => [k.id, k])).values()]
+  const alle = [...new Map(je.flatMap(() => undefined).map((k) => [k.id, k])).values()]
   const zeiten = new Map(
     await Promise.all(alle.map(async (karte) => [karte.id, anlagezeit(await cardsApi.getActivity(karte.id))] as const)),
killedBy: ermittleErzeugnisse liefert je Anforderung die im Lauf angelegten Pläne und Pakete, über alle Boards
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ArrowFunction
src/lib/kettenErzeugnisse.ts:73:91
   const karten = (await Promise.all(boards.map((board) => cardsApi.list(board.id)))).flat()
 
   const je = anforderungen.map((anforderung) => ({ anforderung, ...kandidaten(karten, anforderung) }))
-  const alle = [...new Map(je.flatMap(({ plaene, pakete }) => [...plaene, ...pakete]).map((k) => [k.id, k])).values()]
+  const alle = [...new Map(je.flatMap(({ plaene, pakete }) => [...plaene, ...pakete]).map(() => undefined)).values()]
   const zeiten = new Map(
     await Promise.all(alle.map(async (karte) => [karte.id, anlagezeit(await cardsApi.getActivity(karte.id))] as const)),
killedBy: ermittleErzeugnisse liefert je Anforderung die im Lauf angelegten Pläne und Pakete, über alle Boards
statusReason: Iterator value undefined is not an entry object

[Killed] ArrowFunction
src/lib/kettenErzeugnisse.ts:75:32
   const je = anforderungen.map((anforderung) => ({ anforderung, ...kandidaten(karten, anforderung) }))
   const alle = [...new Map(je.flatMap(({ plaene, pakete }) => [...plaene, ...pakete]).map((k) => [k.id, k])).values()]
   const zeiten = new Map(
-    await Promise.all(alle.map(async (karte) => [karte.id, anlagezeit(await cardsApi.getActivity(karte.id))] as const)),
+    await Promise.all(alle.map(() => undefined)),
   )
   const neu = (karte: Card) => imFenster(zeiten.get(karte.id), fenster)
killedBy: ermittleErzeugnisse liefert je Anforderung die im Lauf angelegten Pläne und Pakete, über alle Boards
statusReason: Iterator value undefined is not an entry object

[Killed] ArrowFunction
src/lib/kettenErzeugnisse.ts:77:15
   const zeiten = new Map(
     await Promise.all(alle.map(async (karte) => [karte.id, anlagezeit(await cardsApi.getActivity(karte.id))] as const)),
   )
-  const neu = (karte: Card) => imFenster(zeiten.get(karte.id), fenster)
+  const neu = () => undefined
 
   return new Map(
killedBy: ermittleErzeugnisse liefert je Anforderung die im Lauf angelegten Pläne und Pakete, über alle Boards
statusReason: expected { plaene: [], pakete: [], …(1) } to deeply equal { plaene: [ 773 ], …(2) }

[Killed] BlockStatement
src/lib/kettenErzeugnisse.ts:80:49
   const neu = (karte: Card) => imFenster(zeiten.get(karte.id), fenster)
 
   return new Map(
-    je.map(({ anforderung, plaene, pakete }) => {
-      // Ein Paket zählt nur unter einem Plan, der selbst in diesem Lauf entstand: Ein älterer Plan
-      // mit einem neuen Paket wäre nicht die Arbeit dieser Kette.
-      const neuePlaene = plaene.filter(neu)
-      const planJePaket: Record<number, number> = {}
-      const neuePakete = neuePlaene.flatMap((plan) => {
-        const darunter = pakete.filter((karte) => karte.derivedFrom === plan.number && neu(karte))
-        for (const karte of darunter) planJePaket[karte.number] = plan.number
-        return darunter
-      })
-      return [
-        anforderung,
-        { plaene: aufsteigend(neuePlaene), pakete: aufsteigend(neuePakete), planJePaket },
-      ] as const
-    }),
+    je.map(({ anforderung, plaene, pakete }) => {}),
   )
 }
killedBy: ermittleErzeugnisse liefert je Anforderung die im Lauf angelegten Pläne und Pakete, über alle Boards
statusReason: Iterator value undefined is not an entry object

[Killed] MethodExpression
src/lib/kettenErzeugnisse.ts:83:26
     je.map(({ anforderung, plaene, pakete }) => {
       // Ein Paket zählt nur unter einem Plan, der selbst in diesem Lauf entstand: Ein älterer Plan
       // mit einem neuen Paket wäre nicht die Arbeit dieser Kette.
-      const neuePlaene = plaene.filter(neu)
+      const neuePlaene = plaene
       const planJePaket: Record<number, number> = {}
       const neuePakete = neuePlaene.flatMap((plan) => {
killedBy: ermittleErzeugnisse liefert je Anforderung die im Lauf angelegten Pläne und Pakete, über alle Boards
statusReason: expected { plaene: [ 600, 773 ], …(2) } to deeply equal { plaene: [ 773 ], …(2) }

[Killed] BlockStatement
src/lib/kettenErzeugnisse.ts:85:55
       // mit einem neuen Paket wäre nicht die Arbeit dieser Kette.
       const neuePlaene = plaene.filter(neu)
       const planJePaket: Record<number, number> = {}
-      const neuePakete = neuePlaene.flatMap((plan) => {
-        const darunter = pakete.filter((karte) => karte.derivedFrom === plan.number && neu(karte))
-        for (const karte of darunter) planJePaket[karte.number] = plan.number
-        return darunter
-      })
+      const neuePakete = neuePlaene.flatMap((plan) => {})
       return [
         anforderung,
killedBy: ermittleErzeugnisse liefert je Anforderung die im Lauf angelegten Pläne und Pakete, über alle Boards
statusReason: Cannot read properties of undefined (reading 'number')

[Killed] MethodExpression
src/lib/kettenErzeugnisse.ts:86:26
       const neuePlaene = plaene.filter(neu)
       const planJePaket: Record<number, number> = {}
       const neuePakete = neuePlaene.flatMap((plan) => {
-        const darunter = pakete.filter((karte) => karte.derivedFrom === plan.number && neu(karte))
+        const darunter = pakete
         for (const karte of darunter) planJePaket[karte.number] = plan.number
         return darunter
killedBy: ermittleErzeugnisse liefert je Anforderung die im Lauf angelegten Pläne und Pakete, über alle Boards
statusReason: expected { plaene: [ 773 ], …(2) } to deeply equal { plaene: [ 773 ], …(2) }

[Killed] EqualityOperator
src/lib/kettenErzeugnisse.ts:86:51
       const neuePlaene = plaene.filter(neu)
       const planJePaket: Record<number, number> = {}
       const neuePakete = neuePlaene.flatMap((plan) => {
-        const darunter = pakete.filter((karte) => karte.derivedFrom === plan.number && neu(karte))
+        const darunter = pakete.filter((karte) => karte.derivedFrom !== plan.number && neu(karte))
         for (const karte of darunter) planJePaket[karte.number] = plan.number
         return darunter
killedBy: ermittleErzeugnisse liefert je Anforderung die im Lauf angelegten Pläne und Pakete, über alle Boards
statusReason: expected { plaene: [ 773 ], …(2) } to deeply equal { plaene: [ 773 ], …(2) }
