[Killed] Regex
src/lib/kontrast.ts:7:13
  * Rechenvorschrift laufen auseinander, ohne dass ein Test es merkt.
  */
 
-const HEX = /^#(?:[0-9a-f]{3}|[0-9a-f]{6})$/i
+const HEX = /^#(?:[0-9a-f]{3}|[^0-9a-f]{6})$/i
 
 /** Normiert `#abc` und `#aabbcc` (beliebige Schreibung) auf sechs Stellen; alles andere wirft. */
killedBy: leuchtdichte liegt für Schwarz bei 0 und für Weiß bei 1
statusReason: Kein Hexwert der Form #rgb oder #rrggbb: "#000000"

[Killed] BlockStatement
src/lib/kontrast.ts:10:44
 const HEX = /^#(?:[0-9a-f]{3}|[0-9a-f]{6})$/i
 
 /** Normiert `#abc` und `#aabbcc` (beliebige Schreibung) auf sechs Stellen; alles andere wirft. */
-function sechsStellen(hex: string): string {
-  if (!HEX.test(hex)) {
-    throw new Error(`Kein Hexwert der Form #rgb oder #rrggbb: ${JSON.stringify(hex)}`)
-  }
-  const ziffern = hex.slice(1)
-  return ziffern.length === 3
-    ? [...ziffern].map((z) => z + z).join('')
-    : ziffern
-}
+function sechsStellen(hex: string): string {}
 
 /** Linearisierter Farbkanal aus zwei Hexziffern. */
killedBy: leuchtdichte liegt für Schwarz bei 0 und für Weiß bei 1
statusReason: Cannot read properties of undefined (reading 'slice')

[Killed] BlockStatement
src/lib/kontrast.ts:11:23
 
 /** Normiert `#abc` und `#aabbcc` (beliebige Schreibung) auf sechs Stellen; alles andere wirft. */
 function sechsStellen(hex: string): string {
-  if (!HEX.test(hex)) {
-    throw new Error(`Kein Hexwert der Form #rgb oder #rrggbb: ${JSON.stringify(hex)}`)
-  }
+  if (!HEX.test(hex)) {}
   const ziffern = hex.slice(1)
   return ziffern.length === 3
killedBy: leuchtdichte weist den unbrauchbaren Wert "" ab, statt still zu rechnen
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/kontrast.ts:11:7
 
 /** Normiert `#abc` und `#aabbcc` (beliebige Schreibung) auf sechs Stellen; alles andere wirft. */
 function sechsStellen(hex: string): string {
-  if (!HEX.test(hex)) {
+  if (false) {
     throw new Error(`Kein Hexwert der Form #rgb oder #rrggbb: ${JSON.stringify(hex)}`)
   }
killedBy: leuchtdichte weist den unbrauchbaren Wert "" ab, statt still zu rechnen
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/lib/kontrast.ts:12:21
 /** Normiert `#abc` und `#aabbcc` (beliebige Schreibung) auf sechs Stellen; alles andere wirft. */
 function sechsStellen(hex: string): string {
   if (!HEX.test(hex)) {
-    throw new Error(`Kein Hexwert der Form #rgb oder #rrggbb: ${JSON.stringify(hex)}`)
+    throw new Error(``)
   }
   const ziffern = hex.slice(1)
killedBy: leuchtdichte weist den unbrauchbaren Wert "" ab, statt still zu rechnen
statusReason: expected [Function] to throw error matching /Hexwert/ but got ''

[Killed] MethodExpression
src/lib/kontrast.ts:14:19
   if (!HEX.test(hex)) {
     throw new Error(`Kein Hexwert der Form #rgb oder #rrggbb: ${JSON.stringify(hex)}`)
   }
-  const ziffern = hex.slice(1)
+  const ziffern = hex
   return ziffern.length === 3
     ? [...ziffern].map((z) => z + z).join('')
killedBy: leuchtdichte liegt für Schwarz bei 0 und für Weiß bei 1
statusReason: expected NaN to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/kontrast.ts:15:10
     throw new Error(`Kein Hexwert der Form #rgb oder #rrggbb: ${JSON.stringify(hex)}`)
   }
   const ziffern = hex.slice(1)
-  return ziffern.length === 3
+  return false
     ? [...ziffern].map((z) => z + z).join('')
     : ziffern
killedBy: leuchtdichte liest die Kurzform #abc als #aabbcc
statusReason: expected NaN to be 0.4844632879252147 // Object.is equality

[Killed] EqualityOperator
src/lib/kontrast.ts:15:10
     throw new Error(`Kein Hexwert der Form #rgb oder #rrggbb: ${JSON.stringify(hex)}`)
   }
   const ziffern = hex.slice(1)
-  return ziffern.length === 3
+  return ziffern.length !== 3
     ? [...ziffern].map((z) => z + z).join('')
     : ziffern
killedBy: leuchtdichte liest die Kurzform #abc als #aabbcc
statusReason: expected NaN to be 0.4088335463717061 // Object.is equality

[Killed] ArrowFunction
src/lib/kontrast.ts:16:24
   }
   const ziffern = hex.slice(1)
   return ziffern.length === 3
-    ? [...ziffern].map((z) => z + z).join('')
+    ? [...ziffern].map(() => undefined).join('')
     : ziffern
 }
killedBy: leuchtdichte liest die Kurzform #abc als #aabbcc
statusReason: expected NaN to be 0.4844632879252147 // Object.is equality

[Killed] ArithmeticOperator
src/lib/kontrast.ts:16:31
   }
   const ziffern = hex.slice(1)
   return ziffern.length === 3
-    ? [...ziffern].map((z) => z + z).join('')
+    ? [...ziffern].map((z) => z - z).join('')
     : ziffern
 }
killedBy: leuchtdichte liest die Kurzform #abc als #aabbcc
statusReason: expected NaN to be 0.4844632879252147 // Object.is equality

[Killed] BlockStatement
src/lib/kontrast.ts:21:38
 }
 
 /** Linearisierter Farbkanal aus zwei Hexziffern. */
-function kanal(paar: string): number {
-  const v = Number.parseInt(paar, 16) / 255
-  return v <= 0.03928 ? v / 12.92 : ((v + 0.055) / 1.055) ** 2.4
-}
+function kanal(paar: string): number {}
 
 /** Relative Leuchtdichte (0 für Schwarz bis 1 für Weiß) eines Hexwerts `#rgb` oder `#rrggbb`. */
killedBy: leuchtdichte liegt für Schwarz bei 0 und für Weiß bei 1
statusReason: expected NaN to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/lib/kontrast.ts:22:13
 
 /** Linearisierter Farbkanal aus zwei Hexziffern. */
 function kanal(paar: string): number {
-  const v = Number.parseInt(paar, 16) / 255
+  const v = Number.parseInt(paar, 16) * 255
   return v <= 0.03928 ? v / 12.92 : ((v + 0.055) / 1.055) ** 2.4
 }
killedBy: leuchtdichte liegt für Schwarz bei 0 und für Weiß bei 1
statusReason: expected 313031357483.1584 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/kontrast.ts:23:10
 /** Linearisierter Farbkanal aus zwei Hexziffern. */
 function kanal(paar: string): number {
   const v = Number.parseInt(paar, 16) / 255
-  return v <= 0.03928 ? v / 12.92 : ((v + 0.055) / 1.055) ** 2.4
+  return true ? v / 12.92 : ((v + 0.055) / 1.055) ** 2.4
 }
 
killedBy: leuchtdichte liegt für Schwarz bei 0 und für Weiß bei 1
statusReason: expected 0.07739938080495357 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/lib/kontrast.ts:23:38
 /** Linearisierter Farbkanal aus zwei Hexziffern. */
 function kanal(paar: string): number {
   const v = Number.parseInt(paar, 16) / 255
-  return v <= 0.03928 ? v / 12.92 : ((v + 0.055) / 1.055) ** 2.4
+  return v <= 0.03928 ? v / 12.92 : ((v + 0.055) * 1.055) ** 2.4
 }
 
killedBy: leuchtdichte liegt für Schwarz bei 0 und für Weiß bei 1
statusReason: expected 1.2930395424386452 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/kontrast.ts:27:51
 }
 
 /** Relative Leuchtdichte (0 für Schwarz bis 1 für Weiß) eines Hexwerts `#rgb` oder `#rrggbb`. */
-export function leuchtdichte(hex: string): number {
-  const z = sechsStellen(hex)
-  return 0.2126 * kanal(z.slice(0, 2)) + 0.7152 * kanal(z.slice(2, 4)) + 0.0722 * kanal(z.slice(4, 6))
-}
+export function leuchtdichte(hex: string): number {}
 
 /** Kontrastverhältnis zweier Hexwerte, von 1 (gleich) bis 21 (Schwarz gegen Weiß); symmetrisch. */
killedBy: leuchtdichte liegt für Schwarz bei 0 und für Weiß bei 1
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/lib/kontrast.ts:29:42
 /** Relative Leuchtdichte (0 für Schwarz bis 1 für Weiß) eines Hexwerts `#rgb` oder `#rrggbb`. */
 export function leuchtdichte(hex: string): number {
   const z = sechsStellen(hex)
-  return 0.2126 * kanal(z.slice(0, 2)) + 0.7152 * kanal(z.slice(2, 4)) + 0.0722 * kanal(z.slice(4, 6))
+  return 0.2126 * kanal(z.slice(0, 2)) + 0.7152 / kanal(z.slice(2, 4)) + 0.0722 * kanal(z.slice(4, 6))
 }
 
killedBy: leuchtdichte liegt für Schwarz bei 0 und für Weiß bei 1
statusReason: expected Infinity to be +0 // Object.is equality

[Killed] MethodExpression
src/lib/kontrast.ts:29:25
 /** Relative Leuchtdichte (0 für Schwarz bis 1 für Weiß) eines Hexwerts `#rgb` oder `#rrggbb`. */
 export function leuchtdichte(hex: string): number {
   const z = sechsStellen(hex)
-  return 0.2126 * kanal(z.slice(0, 2)) + 0.7152 * kanal(z.slice(2, 4)) + 0.0722 * kanal(z.slice(4, 6))
+  return 0.2126 * kanal(z) + 0.7152 * kanal(z.slice(2, 4)) + 0.0722 * kanal(z.slice(4, 6))
 }
 
killedBy: leuchtdichte liegt für Schwarz bei 0 und für Weiß bei 1
statusReason: expected 68452526723.83549 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/kontrast.ts:33:62
 }
 
 /** Kontrastverhältnis zweier Hexwerte, von 1 (gleich) bis 21 (Schwarz gegen Weiß); symmetrisch. */
-export function kontrast(hexA: string, hexB: string): number {
-  const a = leuchtdichte(hexA)
-  const b = leuchtdichte(hexB)
-  return (Math.max(a, b) + 0.05) / (Math.min(a, b) + 0.05)
-}
+export function kontrast(hexA: string, hexB: string): number {}
 
killedBy: kontrast ergibt für Schwarz gegen Weiß 21:1
statusReason: expected undefined to be 21 // Object.is equality

[Killed] ArithmeticOperator
src/lib/kontrast.ts:36:10
 export function kontrast(hexA: string, hexB: string): number {
   const a = leuchtdichte(hexA)
   const b = leuchtdichte(hexB)
-  return (Math.max(a, b) + 0.05) / (Math.min(a, b) + 0.05)
+  return (Math.max(a, b) + 0.05) * (Math.min(a, b) + 0.05)
 }
 
killedBy: kontrast ergibt für Schwarz gegen Weiß 21:1
statusReason: expected 0.052500000000000005 to be 21 // Object.is equality

[Killed] ArithmeticOperator
src/lib/kontrast.ts:36:11
 export function kontrast(hexA: string, hexB: string): number {
   const a = leuchtdichte(hexA)
   const b = leuchtdichte(hexB)
-  return (Math.max(a, b) + 0.05) / (Math.min(a, b) + 0.05)
+  return (Math.max(a, b) - 0.05) / (Math.min(a, b) + 0.05)
 }
 
killedBy: kontrast ergibt für Schwarz gegen Weiß 21:1
statusReason: expected 18.999999999999996 to be 21 // Object.is equality
