[Killed] ConditionalExpression
src/lib/leitstand.ts:211:7
   const letzter = lauf.items.at(-1)
   const beginn = new Date(lauf.startedAt)
   let titel: string
-  if (lauf.abortReason != null) {
+  if (true) {
     // Der Abbruchgrund steht vor allem anderen (Issue #1144, Plan #1139 E6): Er verdraengt den
     // Rueckfalltext „Nichts abgearbeitet — Grund unbekannt" ebenso wie die Zahl der Vorgaenge —
killedBy: leitstand Laufband (#979) nennt einen laufenden Lauf mit Vorgang n von m, gezählt ohne graue Pakete
statusReason: expected null to be 'Kette läuft — Vorgang 2 von 3' // Object.is equality

[Killed] ConditionalExpression
src/lib/leitstand.ts:211:7
   const letzter = lauf.items.at(-1)
   const beginn = new Date(lauf.startedAt)
   let titel: string
-  if (lauf.abortReason != null) {
+  if (false) {
     // Der Abbruchgrund steht vor allem anderen (Issue #1144, Plan #1139 E6): Er verdraengt den
     // Rueckfalltext „Nichts abgearbeitet — Grund unbekannt" ebenso wie die Zahl der Vorgaenge —
killedBy: Der abgebrochene Lauf im Browser (#1144) traegt den Abbruchgrund als Titel des Laufbands und nie „Grund unbekannt"
statusReason: expected 'Nichts abgearbeitet — Grund unbekannt' to be 'Harter Stopp (dirty-tree): der Workin…' // Object.is equality

[Killed] ConditionalExpression
src/lib/leitstand.ts:216:14
     // Rueckfalltext „Nichts abgearbeitet — Grund unbekannt" ebenso wie die Zahl der Vorgaenge —
     // die sagt an einem abgebrochenen Lauf nicht, woran er starb.
     titel = lauf.abortReason
-  } else if (lauf.complete && lauf.noWorkReason != null) {
+  } else if (true) {
     // Der Grund steht statt „abgeschlossen — 0 Vorgaenge": Die Zahl sagt dasselbe noch einmal,
     // der Grund sagt, warum.
killedBy: leitstand Laufband (#979) nennt einen laufenden Lauf mit Vorgang n von m, gezählt ohne graue Pakete
statusReason: expected null to be 'Kette läuft — Vorgang 2 von 3' // Object.is equality

[Killed] LogicalOperator
src/lib/leitstand.ts:216:14
     // Rueckfalltext „Nichts abgearbeitet — Grund unbekannt" ebenso wie die Zahl der Vorgaenge —
     // die sagt an einem abgebrochenen Lauf nicht, woran er starb.
     titel = lauf.abortReason
-  } else if (lauf.complete && lauf.noWorkReason != null) {
+  } else if (lauf.complete || lauf.noWorkReason != null) {
     // Der Grund steht statt „abgeschlossen — 0 Vorgaenge": Die Zahl sagt dasselbe noch einmal,
     // der Grund sagt, warum.
killedBy: leitstand Laufband (#979) nennt einen abgeschlossenen Lauf mit Zahl der Vorgänge, Dauer in Minuten und Kosten
statusReason: expected null to be 'Prüfung abgeschlossen — 1 Vorgang' // Object.is equality

[Killed] ConditionalExpression
src/lib/leitstand.ts:220:14
     // Der Grund steht statt „abgeschlossen — 0 Vorgaenge": Die Zahl sagt dasselbe noch einmal,
     // der Grund sagt, warum.
     titel = lauf.noWorkReason
-  } else if (lauf.complete) {
+  } else if (true) {
     titel = `${modus} abgeschlossen — ${vorgaenge(gesamt)}`
   } else if (gesamt === 0) {
killedBy: leitstand Laufband (#979) nennt einen laufenden Lauf mit Vorgang n von m, gezählt ohne graue Pakete
statusReason: expected 'Kette abgeschlossen — 3 Vorgänge' to be 'Kette läuft — Vorgang 2 von 3' // Object.is equality

[Killed] BlockStatement
src/lib/leitstand.ts:220:29
     // Der Grund steht statt „abgeschlossen — 0 Vorgaenge": Die Zahl sagt dasselbe noch einmal,
     // der Grund sagt, warum.
     titel = lauf.noWorkReason
-  } else if (lauf.complete) {
-    titel = `${modus} abgeschlossen — ${vorgaenge(gesamt)}`
-  } else if (gesamt === 0) {
+  } else if (lauf.complete) {} else if (gesamt === 0) {
     titel = `${modus} läuft`
   } else {
killedBy: leitstand Laufband (#979) nennt einen abgeschlossenen Lauf mit Zahl der Vorgänge, Dauer in Minuten und Kosten
statusReason: expected undefined to be 'Prüfung abgeschlossen — 1 Vorgang' // Object.is equality

[Killed] ConditionalExpression
src/lib/leitstand.ts:222:14
     titel = lauf.noWorkReason
   } else if (lauf.complete) {
     titel = `${modus} abgeschlossen — ${vorgaenge(gesamt)}`
-  } else if (gesamt === 0) {
+  } else if (true) {
     titel = `${modus} läuft`
   } else {
killedBy: leitstand Laufband (#979) nennt einen laufenden Lauf mit Vorgang n von m, gezählt ohne graue Pakete
statusReason: expected 'Kette läuft' to be 'Kette läuft — Vorgang 2 von 3' // Object.is equality

[Killed] ConditionalExpression
src/lib/leitstand.ts:222:14
     titel = lauf.noWorkReason
   } else if (lauf.complete) {
     titel = `${modus} abgeschlossen — ${vorgaenge(gesamt)}`
-  } else if (gesamt === 0) {
+  } else if (false) {
     titel = `${modus} läuft`
   } else {
killedBy: leitstand Laufband (#979) nennt einen laufenden Lauf ohne gemeldeten Vorgang schlicht als laufend
statusReason: expected 'Umsetzung läuft — Vorgang 0 von 0' to be 'Umsetzung läuft' // Object.is equality

[Killed] BlockStatement
src/lib/leitstand.ts:224:10
     titel = `${modus} abgeschlossen — ${vorgaenge(gesamt)}`
   } else if (gesamt === 0) {
     titel = `${modus} läuft`
-  } else {
-    const bearbeitet = lauf.items.filter((item) => item.state !== 'GREY').length
-    titel = `${modus} läuft — Vorgang ${bearbeitet} von ${gesamt}`
-  }
+  } else {}
   // Puls und Zeitpunkt kommen aus dem Befund, nicht aus `complete` (#1092): Ein verstummter Lauf
   // pulste sonst gruen mit „seit HH:MM" weiter, waehrend der Plattform-Leitstand ihn als nicht
killedBy: leitstand Laufband (#979) nennt einen laufenden Lauf mit Vorgang n von m, gezählt ohne graue Pakete
statusReason: expected undefined to be 'Kette läuft — Vorgang 2 von 3' // Object.is equality

[Killed] MethodExpression
src/lib/leitstand.ts:225:24
   } else if (gesamt === 0) {
     titel = `${modus} läuft`
   } else {
-    const bearbeitet = lauf.items.filter((item) => item.state !== 'GREY').length
+    const bearbeitet = lauf.items.length
     titel = `${modus} läuft — Vorgang ${bearbeitet} von ${gesamt}`
   }
killedBy: leitstand Laufband (#979) nennt einen laufenden Lauf mit Vorgang n von m, gezählt ohne graue Pakete
statusReason: expected 'Kette läuft — Vorgang 3 von 3' to be 'Kette läuft — Vorgang 2 von 3' // Object.is equality

[Killed] ConditionalExpression
src/lib/leitstand.ts:225:52
   } else if (gesamt === 0) {
     titel = `${modus} läuft`
   } else {
-    const bearbeitet = lauf.items.filter((item) => item.state !== 'GREY').length
+    const bearbeitet = lauf.items.filter((item) => true).length
     titel = `${modus} läuft — Vorgang ${bearbeitet} von ${gesamt}`
   }
killedBy: leitstand Laufband (#979) nennt einen laufenden Lauf mit Vorgang n von m, gezählt ohne graue Pakete
statusReason: expected 'Kette läuft — Vorgang 3 von 3' to be 'Kette läuft — Vorgang 2 von 3' // Object.is equality

[Killed] StringLiteral
src/lib/leitstand.ts:237:25
     melder: laufMelder(lauf, lauf.noWorkReason),
     laeuft,
     vorgang: letzter ? { nummer: letzter.cardNumber, titel: letzter.title } : null,
-    zeitpunkt: laeuft ? `seit ${uhrzeit(lauf.startedAt)}` : `Beginn ${TAG_ZEIT.format(beginn)}`,
+    zeitpunkt: laeuft ? `` : `Beginn ${TAG_ZEIT.format(beginn)}`,
     minuten: Math.round(lauf.durationMs / 60_000),
     kosten: lauf.usage?.costUsd == null ? null : dollar(lauf.usage.costUsd),
killedBy: leitstand Laufband (#979) nennt einen laufenden Lauf mit Vorgang n von m, gezählt ohne graue Pakete
statusReason: expected '' to match /^seit \d\d:\d\d$/

[Killed] ArithmeticOperator
src/lib/leitstand.ts:238:25
     laeuft,
     vorgang: letzter ? { nummer: letzter.cardNumber, titel: letzter.title } : null,
     zeitpunkt: laeuft ? `seit ${uhrzeit(lauf.startedAt)}` : `Beginn ${TAG_ZEIT.format(beginn)}`,
-    minuten: Math.round(lauf.durationMs / 60_000),
+    minuten: Math.round(lauf.durationMs * 60_000),
     kosten: lauf.usage?.costUsd == null ? null : dollar(lauf.usage.costUsd),
   }
killedBy: leitstand Laufband (#979) nennt einen abgeschlossenen Lauf mit Zahl der Vorgänge, Dauer in Minuten und Kosten
statusReason: expected 907200000000 to be 252 // Object.is equality

[Killed] ConditionalExpression
src/lib/leitstand.ts:239:13
     vorgang: letzter ? { nummer: letzter.cardNumber, titel: letzter.title } : null,
     zeitpunkt: laeuft ? `seit ${uhrzeit(lauf.startedAt)}` : `Beginn ${TAG_ZEIT.format(beginn)}`,
     minuten: Math.round(lauf.durationMs / 60_000),
-    kosten: lauf.usage?.costUsd == null ? null : dollar(lauf.usage.costUsd),
+    kosten: true ? null : dollar(lauf.usage.costUsd),
   }
 }
killedBy: leitstand Laufband (#979) nennt einen abgeschlossenen Lauf mit Zahl der Vorgänge, Dauer in Minuten und Kosten
statusReason: expected null to be '12,40' // Object.is equality

[Killed] ConditionalExpression
src/lib/leitstand.ts:239:13
     vorgang: letzter ? { nummer: letzter.cardNumber, titel: letzter.title } : null,
     zeitpunkt: laeuft ? `seit ${uhrzeit(lauf.startedAt)}` : `Beginn ${TAG_ZEIT.format(beginn)}`,
     minuten: Math.round(lauf.durationMs / 60_000),
-    kosten: lauf.usage?.costUsd == null ? null : dollar(lauf.usage.costUsd),
+    kosten: false ? null : dollar(lauf.usage.costUsd),
   }
 }
killedBy: leitstand Laufband (#979) nennt einen laufenden Lauf mit Vorgang n von m, gezählt ohne graue Pakete
statusReason: Cannot read properties of null (reading 'costUsd')

[Killed] BlockStatement
src/lib/leitstand.ts:244:45
 }
 
 /** Ein Dollarbetrag mit zwei Nachkommastellen, ohne Einheit. */
-export function dollar(usd: number): string {
-  return ZAHL_2.format(usd)
-}
+export function dollar(usd: number): string {}
 
 /** Dollar mit zwei Nachkommastellen und Einheit; `null` bleibt `null` — nicht gemessen ist nicht 0. */
killedBy: leitstand Laufband (#979) nennt einen abgeschlossenen Lauf mit Zahl der Vorgänge, Dauer in Minuten und Kosten
statusReason: expected undefined to be '12,40' // Object.is equality

[Killed] BlockStatement
src/lib/leitstand.ts:249:63
 }
 
 /** Dollar mit zwei Nachkommastellen und Einheit; `null` bleibt `null` — nicht gemessen ist nicht 0. */
-export function kostenText(usd: number | null): string | null {
-  return usd === null ? null : `${dollar(usd)} $`
-}
+export function kostenText(usd: number | null): string | null {}
 
 /** Dauer eines Arbeitspakets wie im Entwurf: `mm:ss`, ab einer Stunde `h:mm:ss`; ohne Messung `—`. */
killedBy: leitstand Laufband (#979) lässt nicht gemessene Kosten weg, statt 0 zu zeigen
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/lib/leitstand.ts:250:10
 
 /** Dollar mit zwei Nachkommastellen und Einheit; `null` bleibt `null` — nicht gemessen ist nicht 0. */
 export function kostenText(usd: number | null): string | null {
-  return usd === null ? null : `${dollar(usd)} $`
+  return false ? null : `${dollar(usd)} $`
 }
 
killedBy: leitstand Laufband (#979) lässt nicht gemessene Kosten weg, statt 0 zu zeigen
statusReason: expected '0,00 $' to be null

[Killed] EqualityOperator
src/lib/leitstand.ts:250:10
 
 /** Dollar mit zwei Nachkommastellen und Einheit; `null` bleibt `null` — nicht gemessen ist nicht 0. */
 export function kostenText(usd: number | null): string | null {
-  return usd === null ? null : `${dollar(usd)} $`
+  return usd !== null ? null : `${dollar(usd)} $`
 }
 
killedBy: leitstand Laufband (#979) lässt nicht gemessene Kosten weg, statt 0 zu zeigen
statusReason: expected '0,00 $' to be null

[Killed] BlockStatement
src/lib/leitstand.ts:254:55
 }
 
 /** Dauer eines Arbeitspakets wie im Entwurf: `mm:ss`, ab einer Stunde `h:mm:ss`; ohne Messung `—`. */
-export function paketDauer(ms: number | null): string {
-  if (ms === null) {
-    return '—'
-  }
-  const sekunden = Math.round(ms / 1000)
-  const h = Math.floor(sekunden / 3600)
-  const m = Math.floor((sekunden % 3600) / 60)
-  const s = String(sekunden % 60).padStart(2, '0')
-  return h > 0 ? `${h}:${String(m).padStart(2, '0')}:${s}` : `${String(m).padStart(2, '0')}:${s}`
-}
+export function paketDauer(ms: number | null): string {}
 
 /** Dauer eines Laufs als „4 h 12 min" bzw. „12 min". */
killedBy: leitstand Letzter Run formatiert Paketdauern wie der Entwurf
statusReason: expected undefined to be '—' // Object.is equality

[Killed] ConditionalExpression
src/lib/leitstand.ts:255:7
 
 /** Dauer eines Arbeitspakets wie im Entwurf: `mm:ss`, ab einer Stunde `h:mm:ss`; ohne Messung `—`. */
 export function paketDauer(ms: number | null): string {
-  if (ms === null) {
+  if (false) {
     return '—'
   }
killedBy: leitstand Letzter Run formatiert Paketdauern wie der Entwurf
statusReason: expected '00:00' to be '—' // Object.is equality

[Killed] BlockStatement
src/lib/leitstand.ts:255:20
 
 /** Dauer eines Arbeitspakets wie im Entwurf: `mm:ss`, ab einer Stunde `h:mm:ss`; ohne Messung `—`. */
 export function paketDauer(ms: number | null): string {
-  if (ms === null) {
-    return '—'
-  }
+  if (ms === null) {}
   const sekunden = Math.round(ms / 1000)
   const h = Math.floor(sekunden / 3600)
killedBy: leitstand Letzter Run formatiert Paketdauern wie der Entwurf
statusReason: expected '00:00' to be '—' // Object.is equality

[Killed] StringLiteral
src/lib/leitstand.ts:256:12
 /** Dauer eines Arbeitspakets wie im Entwurf: `mm:ss`, ab einer Stunde `h:mm:ss`; ohne Messung `—`. */
 export function paketDauer(ms: number | null): string {
   if (ms === null) {
-    return '—'
+    return ""
   }
   const sekunden = Math.round(ms / 1000)
killedBy: leitstand Letzter Run formatiert Paketdauern wie der Entwurf
statusReason: expected '' to be '—' // Object.is equality

[Killed] ArithmeticOperator
src/lib/leitstand.ts:258:31
   if (ms === null) {
     return '—'
   }
-  const sekunden = Math.round(ms / 1000)
+  const sekunden = Math.round(ms * 1000)
   const h = Math.floor(sekunden / 3600)
   const m = Math.floor((sekunden % 3600) / 60)
killedBy: leitstand Letzter Run formatiert Paketdauern wie der Entwurf
statusReason: expected '108611:06:40' to be '06:31' // Object.is equality

[Killed] ArithmeticOperator
src/lib/leitstand.ts:259:24
     return '—'
   }
   const sekunden = Math.round(ms / 1000)
-  const h = Math.floor(sekunden / 3600)
+  const h = Math.floor(sekunden * 3600)
   const m = Math.floor((sekunden % 3600) / 60)
   const s = String(sekunden % 60).padStart(2, '0')
killedBy: leitstand Letzter Run formatiert Paketdauern wie der Entwurf
statusReason: expected '1407600:06:31' to be '06:31' // Object.is equality

[Killed] ArithmeticOperator
src/lib/leitstand.ts:260:24
   }
   const sekunden = Math.round(ms / 1000)
   const h = Math.floor(sekunden / 3600)
-  const m = Math.floor((sekunden % 3600) / 60)
+  const m = Math.floor(sekunden % 3600 * 60)
   const s = String(sekunden % 60).padStart(2, '0')
   return h > 0 ? `${h}:${String(m).padStart(2, '0')}:${s}` : `${String(m).padStart(2, '0')}:${s}`
killedBy: leitstand Letzter Run formatiert Paketdauern wie der Entwurf
statusReason: expected '23460:31' to be '06:31' // Object.is equality

[Killed] ArithmeticOperator
src/lib/leitstand.ts:260:25
   }
   const sekunden = Math.round(ms / 1000)
   const h = Math.floor(sekunden / 3600)
-  const m = Math.floor((sekunden % 3600) / 60)
+  const m = Math.floor((sekunden * 3600) / 60)
   const s = String(sekunden % 60).padStart(2, '0')
   return h > 0 ? `${h}:${String(m).padStart(2, '0')}:${s}` : `${String(m).padStart(2, '0')}:${s}`
killedBy: leitstand Letzter Run formatiert Paketdauern wie der Entwurf
statusReason: expected '23460:31' to be '06:31' // Object.is equality

[Killed] ArithmeticOperator
src/lib/leitstand.ts:261:20
   const sekunden = Math.round(ms / 1000)
   const h = Math.floor(sekunden / 3600)
   const m = Math.floor((sekunden % 3600) / 60)
-  const s = String(sekunden % 60).padStart(2, '0')
+  const s = String(sekunden * 60).padStart(2, '0')
   return h > 0 ? `${h}:${String(m).padStart(2, '0')}:${s}` : `${String(m).padStart(2, '0')}:${s}`
 }
killedBy: leitstand Letzter Run formatiert Paketdauern wie der Entwurf
statusReason: expected '06:23460' to be '06:31' // Object.is equality

[Killed] EqualityOperator
src/lib/leitstand.ts:262:10
   const h = Math.floor(sekunden / 3600)
   const m = Math.floor((sekunden % 3600) / 60)
   const s = String(sekunden % 60).padStart(2, '0')
-  return h > 0 ? `${h}:${String(m).padStart(2, '0')}:${s}` : `${String(m).padStart(2, '0')}:${s}`
+  return h >= 0 ? `${h}:${String(m).padStart(2, '0')}:${s}` : `${String(m).padStart(2, '0')}:${s}`
 }
 
killedBy: leitstand Letzter Run formatiert Paketdauern wie der Entwurf
statusReason: expected '0:06:31' to be '06:31' // Object.is equality

[Killed] EqualityOperator
src/lib/leitstand.ts:262:10
   const h = Math.floor(sekunden / 3600)
   const m = Math.floor((sekunden % 3600) / 60)
   const s = String(sekunden % 60).padStart(2, '0')
-  return h > 0 ? `${h}:${String(m).padStart(2, '0')}:${s}` : `${String(m).padStart(2, '0')}:${s}`
+  return h <= 0 ? `${h}:${String(m).padStart(2, '0')}:${s}` : `${String(m).padStart(2, '0')}:${s}`
 }
 
killedBy: leitstand Letzter Run formatiert Paketdauern wie der Entwurf
statusReason: expected '0:06:31' to be '06:31' // Object.is equality

[Killed] BlockStatement
src/lib/leitstand.ts:266:47
 }
 
 /** Dauer eines Laufs als „4 h 12 min" bzw. „12 min". */
-export function laufDauer(ms: number): string {
-  const minuten = Math.round(ms / 60_000)
-  const h = Math.floor(minuten / 60)
-  return h > 0 ? `${h} h ${minuten % 60} min` : `${minuten} min`
-}
+export function laufDauer(ms: number): string {}
 
 /**
killedBy: leitstand Letzter Run formatiert Laufdauern und die Notiz im Plattenkopf
statusReason: expected undefined to be '12 min' // Object.is equality

[Killed] ArithmeticOperator
src/lib/leitstand.ts:267:30
 
 /** Dauer eines Laufs als „4 h 12 min" bzw. „12 min". */
 export function laufDauer(ms: number): string {
-  const minuten = Math.round(ms / 60_000)
+  const minuten = Math.round(ms * 60_000)
   const h = Math.floor(minuten / 60)
   return h > 0 ? `${h} h ${minuten % 60} min` : `${minuten} min`
killedBy: leitstand Letzter Run formatiert Laufdauern und die Notiz im Plattenkopf
statusReason: expected '720000000 h 0 min' to be '12 min' // Object.is equality

[Killed] ArithmeticOperator
src/lib/leitstand.ts:268:24
 /** Dauer eines Laufs als „4 h 12 min" bzw. „12 min". */
 export function laufDauer(ms: number): string {
   const minuten = Math.round(ms / 60_000)
-  const h = Math.floor(minuten / 60)
+  const h = Math.floor(minuten * 60)
   return h > 0 ? `${h} h ${minuten % 60} min` : `${minuten} min`
 }
killedBy: leitstand Letzter Run formatiert Laufdauern und die Notiz im Plattenkopf
statusReason: expected '720 h 12 min' to be '12 min' // Object.is equality

[Killed] ArithmeticOperator
src/lib/leitstand.ts:269:28
 export function laufDauer(ms: number): string {
   const minuten = Math.round(ms / 60_000)
   const h = Math.floor(minuten / 60)
-  return h > 0 ? `${h} h ${minuten % 60} min` : `${minuten} min`
+  return h > 0 ? `${h} h ${minuten * 60} min` : `${minuten} min`
 }
 
killedBy: leitstand Letzter Run formatiert Laufdauern und die Notiz im Plattenkopf
statusReason: expected '4 h 15120 min' to be '4 h 12 min' // Object.is equality

[Killed] EqualityOperator
src/lib/leitstand.ts:269:10
 export function laufDauer(ms: number): string {
   const minuten = Math.round(ms / 60_000)
   const h = Math.floor(minuten / 60)
-  return h > 0 ? `${h} h ${minuten % 60} min` : `${minuten} min`
+  return h <= 0 ? `${h} h ${minuten % 60} min` : `${minuten} min`
 }
 
killedBy: leitstand Letzter Run formatiert Laufdauern und die Notiz im Plattenkopf
statusReason: expected '0 h 12 min' to be '12 min' // Object.is equality

[Killed] BlockStatement
src/lib/leitstand.ts:279:81
  * teilen. Nicht {@link paketDauer}: Die zählt Sekunden mit, und über vier Stunden sagt „4:12:00"
  * nichts, was „4:12 h" nicht kürzer sagte.
  */
-export function laufDauerGeteilt(ms: number): { wert: string; einheit: string } {
-  const minuten = Math.round(ms / 60_000)
-  const h = Math.floor(minuten / 60)
-  return h > 0
-    ? { wert: `${h}:${String(minuten % 60).padStart(2, '0')}`, einheit: 'h' }
-    : { wert: String(minuten), einheit: 'min' }
-}
+export function laufDauerGeteilt(ms: number): { wert: string; einheit: string } {}
 
 /** Ein Zeitpunkt als Tag und Uhrzeit („14.09. 23:10") — Beginn eines Laufs in Notiz und Metazeile. */
killedBy: leitstand Instrumente eines Laufs (#988) teilt die Laufdauer in Wert und Einheit — ab einer Stunde als h:mm
statusReason: expected undefined to deeply equal { wert: '4:12', einheit: 'h' }

[Killed] ArithmeticOperator
src/lib/leitstand.ts:280:30
  * nichts, was „4:12 h" nicht kürzer sagte.
  */
 export function laufDauerGeteilt(ms: number): { wert: string; einheit: string } {
-  const minuten = Math.round(ms / 60_000)
+  const minuten = Math.round(ms * 60_000)
   const h = Math.floor(minuten / 60)
   return h > 0
killedBy: leitstand Instrumente eines Laufs (#988) teilt die Laufdauer in Wert und Einheit — ab einer Stunde als h:mm
statusReason: expected { Object (wert, einheit) } to deeply equal { wert: '4:12', einheit: 'h' }

[Killed] ConditionalExpression
src/lib/leitstand.ts:282:10
 export function laufDauerGeteilt(ms: number): { wert: string; einheit: string } {
   const minuten = Math.round(ms / 60_000)
   const h = Math.floor(minuten / 60)
-  return h > 0
+  return false
     ? { wert: `${h}:${String(minuten % 60).padStart(2, '0')}`, einheit: 'h' }
     : { wert: String(minuten), einheit: 'min' }
killedBy: leitstand Instrumente eines Laufs (#988) teilt die Laufdauer in Wert und Einheit — ab einer Stunde als h:mm
statusReason: expected { wert: '252', einheit: 'min' } to deeply equal { wert: '4:12', einheit: 'h' }

[Killed] ConditionalExpression
src/lib/leitstand.ts:282:10
 export function laufDauerGeteilt(ms: number): { wert: string; einheit: string } {
   const minuten = Math.round(ms / 60_000)
   const h = Math.floor(minuten / 60)
-  return h > 0
+  return true
     ? { wert: `${h}:${String(minuten % 60).padStart(2, '0')}`, einheit: 'h' }
     : { wert: String(minuten), einheit: 'min' }
killedBy: leitstand Instrumente eines Laufs (#988) teilt die Laufdauer in Wert und Einheit — ab einer Stunde als h:mm
statusReason: expected { wert: '0:42', einheit: 'h' } to deeply equal { wert: '42', einheit: 'min' }

[Killed] ArithmeticOperator
src/lib/leitstand.ts:283:30
   const minuten = Math.round(ms / 60_000)
   const h = Math.floor(minuten / 60)
   return h > 0
-    ? { wert: `${h}:${String(minuten % 60).padStart(2, '0')}`, einheit: 'h' }
+    ? { wert: `${h}:${String(minuten * 60).padStart(2, '0')}`, einheit: 'h' }
     : { wert: String(minuten), einheit: 'min' }
 }
killedBy: leitstand Instrumente eines Laufs (#988) teilt die Laufdauer in Wert und Einheit — ab einer Stunde als h:mm
statusReason: expected { wert: '4:15120', einheit: 'h' } to deeply equal { wert: '4:12', einheit: 'h' }

[Killed] BlockStatement
src/lib/leitstand.ts:288:46
 }
 
 /** Ein Zeitpunkt als Tag und Uhrzeit („14.09. 23:10") — Beginn eines Laufs in Notiz und Metazeile. */
-export function tagZeit(iso: string): string {
-  return TAG_ZEIT.format(new Date(iso))
-}
+export function tagZeit(iso: string): string {}
 
 /**
killedBy: leitstand Letzter Run formatiert Laufdauern und die Notiz im Plattenkopf
statusReason: expected 'undefined · 4 h 12 min · 1 Paket' to match /^\d\d\.\d\d\., \d\d:\d\d · 4 h 12 min…/

[Killed] BlockStatement
src/lib/leitstand.ts:300:46
  * HH:MM" und {@link laufband} sagt „seit HH:MM" — zwei Stellen, ein Format. Ein zweiter
  * `Intl.DateTimeFormat` daneben liefe beim naechsten Feinschliff auseinander.
  */
-export function uhrzeit(iso: string): string {
-  return ZEIT.format(new Date(iso))
-}
+export function uhrzeit(iso: string): string {}
 
 /** Die Notiz im Kopf der Platte „Letzter Run": Beginn, Dauer, Zahl der Pakete. */
killedBy: leitstand Laufband (#979) nennt einen laufenden Lauf mit Vorgang n von m, gezählt ohne graue Pakete
statusReason: expected 'seit undefined' to match /^seit \d\d:\d\d$/

[Killed] BlockStatement
src/lib/leitstand.ts:305:55
 }
 
 /** Die Notiz im Kopf der Platte „Letzter Run": Beginn, Dauer, Zahl der Pakete. */
-export function laufNotiz(lauf: NightRunView): string {
-  const pakete = lauf.items.length === 1 ? '1 Paket' : `${lauf.items.length} Pakete`
-  const stand = `${tagZeit(lauf.startedAt)} · ${laufDauer(lauf.durationMs)} · ${pakete}`
-  // Der Abbruchgrund haengt an derselben Stelle wie der Grund eines Laufs ohne Arbeit und hat
-  // Vorrang vor ihm (Issue #1144, Plan #1139 E6) — beide zugleich gibt es nicht.
-  const grund = lauf.abortReason ?? lauf.noWorkReason
-  return grund == null ? stand : `${stand} · ${grund}`
-}
+export function laufNotiz(lauf: NightRunView): string {}
 
 /**
killedBy: leitstand Letzter Run formatiert Laufdauern und die Notiz im Plattenkopf
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] ConditionalExpression
src/lib/leitstand.ts:306:18
 
 /** Die Notiz im Kopf der Platte „Letzter Run": Beginn, Dauer, Zahl der Pakete. */
 export function laufNotiz(lauf: NightRunView): string {
-  const pakete = lauf.items.length === 1 ? '1 Paket' : `${lauf.items.length} Pakete`
+  const pakete = true ? '1 Paket' : `${lauf.items.length} Pakete`
   const stand = `${tagZeit(lauf.startedAt)} · ${laufDauer(lauf.durationMs)} · ${pakete}`
   // Der Abbruchgrund haengt an derselben Stelle wie der Grund eines Laufs ohne Arbeit und hat
killedBy: leitstand Letzter Run formatiert Laufdauern und die Notiz im Plattenkopf
statusReason: expected '14.09., 23:10 · 4 h 12 min · 1 Paket' to match / · 2 Pakete$/

[Killed] ConditionalExpression
src/lib/leitstand.ts:306:18
 
 /** Die Notiz im Kopf der Platte „Letzter Run": Beginn, Dauer, Zahl der Pakete. */
 export function laufNotiz(lauf: NightRunView): string {
-  const pakete = lauf.items.length === 1 ? '1 Paket' : `${lauf.items.length} Pakete`
+  const pakete = false ? '1 Paket' : `${lauf.items.length} Pakete`
   const stand = `${tagZeit(lauf.startedAt)} · ${laufDauer(lauf.durationMs)} · ${pakete}`
   // Der Abbruchgrund haengt an derselben Stelle wie der Grund eines Laufs ohne Arbeit und hat
killedBy: leitstand Letzter Run formatiert Laufdauern und die Notiz im Plattenkopf
statusReason: expected '14.09., 23:10 · 4 h 12 min · 1 Pakete' to match /^\d\d\.\d\d\., \d\d:\d\d · 4 h 12 min…/

[Killed] StringLiteral
src/lib/leitstand.ts:307:17
 /** Die Notiz im Kopf der Platte „Letzter Run": Beginn, Dauer, Zahl der Pakete. */
 export function laufNotiz(lauf: NightRunView): string {
   const pakete = lauf.items.length === 1 ? '1 Paket' : `${lauf.items.length} Pakete`
-  const stand = `${tagZeit(lauf.startedAt)} · ${laufDauer(lauf.durationMs)} · ${pakete}`
+  const stand = ``
   // Der Abbruchgrund haengt an derselben Stelle wie der Grund eines Laufs ohne Arbeit und hat
   // Vorrang vor ihm (Issue #1144, Plan #1139 E6) — beide zugleich gibt es nicht.
killedBy: leitstand Letzter Run formatiert Laufdauern und die Notiz im Plattenkopf
statusReason: expected '' to match /^\d\d\.\d\d\., \d\d:\d\d · 4 h 12 min…/

[Killed] LogicalOperator
src/lib/leitstand.ts:310:17
   const stand = `${tagZeit(lauf.startedAt)} · ${laufDauer(lauf.durationMs)} · ${pakete}`
   // Der Abbruchgrund haengt an derselben Stelle wie der Grund eines Laufs ohne Arbeit und hat
   // Vorrang vor ihm (Issue #1144, Plan #1139 E6) — beide zugleich gibt es nicht.
-  const grund = lauf.abortReason ?? lauf.noWorkReason
+  const grund = lauf.abortReason && lauf.noWorkReason
   return grund == null ? stand : `${stand} · ${grund}`
 }
killedBy: leitstand Lauf ohne Arbeit (#1069) laufNotiz haengt den Grund an und laesst ihn ohne Grund weg
statusReason: expected '14.09., 23:10 · 4 h 12 min · 0 Pakete' to contain 'Kein Eintrag trug das Label kit:night…'

[Killed] EqualityOperator
src/lib/leitstand.ts:311:10
   // Der Abbruchgrund haengt an derselben Stelle wie der Grund eines Laufs ohne Arbeit und hat
   // Vorrang vor ihm (Issue #1144, Plan #1139 E6) — beide zugleich gibt es nicht.
   const grund = lauf.abortReason ?? lauf.noWorkReason
-  return grund == null ? stand : `${stand} · ${grund}`
+  return grund != null ? stand : `${stand} · ${grund}`
 }
 
killedBy: leitstand Letzter Run formatiert Laufdauern und die Notiz im Plattenkopf
statusReason: expected '14.09., 23:10 · 4 h 12 min · 1 Paket …' to match /^\d\d\.\d\d\., \d\d:\d\d · 4 h 12 min…/

[Killed] ConditionalExpression
src/lib/leitstand.ts:311:10
   // Der Abbruchgrund haengt an derselben Stelle wie der Grund eines Laufs ohne Arbeit und hat
   // Vorrang vor ihm (Issue #1144, Plan #1139 E6) — beide zugleich gibt es nicht.
   const grund = lauf.abortReason ?? lauf.noWorkReason
-  return grund == null ? stand : `${stand} · ${grund}`
+  return true ? stand : `${stand} · ${grund}`
 }
 
killedBy: leitstand Lauf ohne Arbeit (#1069) laufNotiz haengt den Grund an und laesst ihn ohne Grund weg
statusReason: expected '14.09., 23:10 · 4 h 12 min · 0 Pakete' to contain 'Kein Eintrag trug das Label kit:night…'

[Killed] BlockStatement
src/lib/leitstand.ts:328:100
  * nicht gibt. Eine gemessene Null im Zwischenspeicher ist dagegen ein Wert: Dort lief die Messung
  * und ergab nichts.
  */
-export function cacheQuote(zwischenspeicher: number | null, eingabe: number | null): number | null {
-  if (zwischenspeicher === null || eingabe === null || eingabe === 0) {
-    return null
-  }
-  return Math.round((zwischenspeicher / eingabe) * 100)
-}
+export function cacheQuote(zwischenspeicher: number | null, eingabe: number | null): number | null {}
 
 /** Ob ein Arbeitspaket ein Abbruch ist — der Filter „Nur Abbrüche" (Entwurf Z. 1419). */
killedBy: leitstand Instrumente eines Laufs (#988) rechnet den Anteil aus Zwischenspeicher, bleibt aber ohne Bezugsgröße bei null
statusReason: expected undefined to be 76 // Object.is equality
