[Killed] BlockStatement
src/lib/leitstand.ts:420:46
  */
 export function implementierungKachel(sekunden: number | null, stichprobe: number): Kachel {
   const basis = stichprobe === 1 ? '1 Karte' : `${stichprobe} Karten`
-  if (sekunden === null || stichprobe === 0) {
-    return { wert: null, einheit: 'Stunden', basis, verlauf: null, delta: null }
-  }
+  if (sekunden === null || stichprobe === 0) {}
   // Die Grenze liegt bei den gerundeten Minuten: 3570 s wären sonst „60 Minuten" statt „1,0 Stunden".
   const minuten = Math.round(sekunden / 60)
killedBy: leitstand Kennzahl-Kacheln zeigt Durchlaufzeit in Tagen und Implementierungszeit in Stunden mit ihrer Datenbasis
statusReason: expected '1,0' to be null

[Killed] EqualityOperator
src/lib/leitstand.ts:420:7
  */
 export function implementierungKachel(sekunden: number | null, stichprobe: number): Kachel {
   const basis = stichprobe === 1 ? '1 Karte' : `${stichprobe} Karten`
-  if (sekunden === null || stichprobe === 0) {
+  if (sekunden !== null || stichprobe === 0) {
     return { wert: null, einheit: 'Stunden', basis, verlauf: null, delta: null }
   }
killedBy: leitstand Kennzahl-Kacheln zeigt Durchlaufzeit in Tagen und Implementierungszeit in Stunden mit ihrer Datenbasis
statusReason: expected { Object (wert, einheit, ...) } to match object { wert: '14,8', …(2) }
(2 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/lib/leitstand.ts:424:30
     return { wert: null, einheit: 'Stunden', basis, verlauf: null, delta: null }
   }
   // Die Grenze liegt bei den gerundeten Minuten: 3570 s wären sonst „60 Minuten" statt „1,0 Stunden".
-  const minuten = Math.round(sekunden / 60)
+  const minuten = Math.round(sekunden * 60)
   const inMinuten = minuten < 60
   return {
killedBy: leitstand Kennzahl-Kacheln zeigt die Implementierungszeit unter einer Stunde in Minuten
statusReason: expected { wert: '0,3', …(4) } to match object { wert: '18', einheit: 'Minuten' }
(3 matching properties omitted from actual)

[Killed] EqualityOperator
src/lib/leitstand.ts:425:21
   }
   // Die Grenze liegt bei den gerundeten Minuten: 3570 s wären sonst „60 Minuten" statt „1,0 Stunden".
   const minuten = Math.round(sekunden / 60)
-  const inMinuten = minuten < 60
+  const inMinuten = minuten <= 60
   return {
     wert: inMinuten ? GANZ.format(minuten) : ZAHL_1.format(sekunden / 3600),
killedBy: leitstand Kennzahl-Kacheln zeigt die Implementierungszeit unter einer Stunde in Minuten
statusReason: expected { Object (wert, einheit, ...) } to match object { wert: '1,0', einheit: 'Stunden' }
(3 matching properties omitted from actual)

[Killed] EqualityOperator
src/lib/leitstand.ts:425:21
   }
   // Die Grenze liegt bei den gerundeten Minuten: 3570 s wären sonst „60 Minuten" statt „1,0 Stunden".
   const minuten = Math.round(sekunden / 60)
-  const inMinuten = minuten < 60
+  const inMinuten = minuten >= 60
   return {
     wert: inMinuten ? GANZ.format(minuten) : ZAHL_1.format(sekunden / 3600),
killedBy: leitstand Kennzahl-Kacheln zeigt Durchlaufzeit in Tagen und Implementierungszeit in Stunden mit ihrer Datenbasis
statusReason: expected { wert: '888', …(4) } to match object { wert: '14,8', …(2) }
(2 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/lib/leitstand.ts:427:60
   const minuten = Math.round(sekunden / 60)
   const inMinuten = minuten < 60
   return {
-    wert: inMinuten ? GANZ.format(minuten) : ZAHL_1.format(sekunden / 3600),
+    wert: inMinuten ? GANZ.format(minuten) : ZAHL_1.format(sekunden * 3600),
     einheit: inMinuten ? 'Minuten' : 'Stunden',
     basis,
killedBy: leitstand Kennzahl-Kacheln zeigt Durchlaufzeit in Tagen und Implementierungszeit in Stunden mit ihrer Datenbasis
statusReason: expected { wert: '191.808.000,0', …(4) } to match object { wert: '14,8', …(2) }
(2 matching properties omitted from actual)

[Killed] StringLiteral
src/lib/leitstand.ts:428:26
   const inMinuten = minuten < 60
   return {
     wert: inMinuten ? GANZ.format(minuten) : ZAHL_1.format(sekunden / 3600),
-    einheit: inMinuten ? 'Minuten' : 'Stunden',
+    einheit: inMinuten ? "" : 'Stunden',
     basis,
     verlauf: null,
killedBy: leitstand Kennzahl-Kacheln zeigt die Implementierungszeit unter einer Stunde in Minuten
statusReason: expected { wert: '18', einheit: '', …(3) } to match object { wert: '18', einheit: 'Minuten' }
(3 matching properties omitted from actual)

[Killed] BlockStatement
src/lib/leitstand.ts:444:75
   gesamt: number
 }
 
-export function gruenAnteil(laeufe: readonly NightRunView[]): GruenAnteil {
-  const gezaehlt = paketZaehlung(laeufe.flatMap((lauf) => lauf.items))
-  return {
-    prozent: gezaehlt.gesamt === 0 ? null : Math.round((gezaehlt.gruen / gezaehlt.gesamt) * 100),
-    ...gezaehlt,
-  }
-}
+export function gruenAnteil(laeufe: readonly NightRunView[]): GruenAnteil {}
 
 /**
killedBy: leitstand Kennzahl-Kacheln rechnet den grünen Anteil über alle aufbewahrten Läufe ohne graue Pakete
statusReason: expected undefined to deeply equal { Object (prozent, gruen, ...) }

[Killed] ArrowFunction
src/lib/leitstand.ts:445:49
 }
 
 export function gruenAnteil(laeufe: readonly NightRunView[]): GruenAnteil {
-  const gezaehlt = paketZaehlung(laeufe.flatMap((lauf) => lauf.items))
+  const gezaehlt = paketZaehlung(laeufe.flatMap(() => undefined))
   return {
     prozent: gezaehlt.gesamt === 0 ? null : Math.round((gezaehlt.gruen / gezaehlt.gesamt) * 100),
killedBy: leitstand Kennzahl-Kacheln rechnet den grünen Anteil über alle aufbewahrten Läufe ohne graue Pakete
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] ConditionalExpression
src/lib/leitstand.ts:447:14
 export function gruenAnteil(laeufe: readonly NightRunView[]): GruenAnteil {
   const gezaehlt = paketZaehlung(laeufe.flatMap((lauf) => lauf.items))
   return {
-    prozent: gezaehlt.gesamt === 0 ? null : Math.round((gezaehlt.gruen / gezaehlt.gesamt) * 100),
+    prozent: false ? null : Math.round((gezaehlt.gruen / gezaehlt.gesamt) * 100),
     ...gezaehlt,
   }
killedBy: leitstand Kennzahl-Kacheln rechnet den grünen Anteil über alle aufbewahrten Läufe ohne graue Pakete
statusReason: expected NaN to be null

[Killed] EqualityOperator
src/lib/leitstand.ts:447:14
 export function gruenAnteil(laeufe: readonly NightRunView[]): GruenAnteil {
   const gezaehlt = paketZaehlung(laeufe.flatMap((lauf) => lauf.items))
   return {
-    prozent: gezaehlt.gesamt === 0 ? null : Math.round((gezaehlt.gruen / gezaehlt.gesamt) * 100),
+    prozent: gezaehlt.gesamt !== 0 ? null : Math.round((gezaehlt.gruen / gezaehlt.gesamt) * 100),
     ...gezaehlt,
   }
killedBy: leitstand Kennzahl-Kacheln rechnet den grünen Anteil über alle aufbewahrten Läufe ohne graue Pakete
statusReason: expected { prozent: null, gruen: 3, …(3) } to deeply equal { Object (prozent, gruen, ...) }

[Killed] BlockStatement
src/lib/leitstand.ts:463:65
  */
 export function paketZaehlung(
   pakete: readonly { state: NightRunState }[],
-): { gruen: number; gelb: number; rot: number; gesamt: number } {
-  const gruen = pakete.filter((p) => p.state === 'GREEN').length
-  const gelb = pakete.filter((p) => p.state === 'YELLOW').length
-  const rot = pakete.filter((p) => p.state === 'RED').length
-  return { gruen, gelb, rot, gesamt: gruen + gelb + rot }
-}
+): { gruen: number; gelb: number; rot: number; gesamt: number } {}
 
 /**
killedBy: leitstand Kennzahl-Kacheln rechnet den grünen Anteil über alle aufbewahrten Läufe ohne graue Pakete
statusReason: Cannot read properties of undefined (reading 'gesamt')

[Killed] MethodExpression
src/lib/leitstand.ts:464:17
 export function paketZaehlung(
   pakete: readonly { state: NightRunState }[],
 ): { gruen: number; gelb: number; rot: number; gesamt: number } {
-  const gruen = pakete.filter((p) => p.state === 'GREEN').length
+  const gruen = pakete.length
   const gelb = pakete.filter((p) => p.state === 'YELLOW').length
   const rot = pakete.filter((p) => p.state === 'RED').length
killedBy: leitstand Kennzahl-Kacheln rechnet den grünen Anteil über alle aufbewahrten Läufe ohne graue Pakete
statusReason: expected { Object (prozent, gruen, ...) } to deeply equal { Object (prozent, gruen, ...) }

[Killed] ConditionalExpression
src/lib/leitstand.ts:464:38
 export function paketZaehlung(
   pakete: readonly { state: NightRunState }[],
 ): { gruen: number; gelb: number; rot: number; gesamt: number } {
-  const gruen = pakete.filter((p) => p.state === 'GREEN').length
+  const gruen = pakete.filter((p) => false).length
   const gelb = pakete.filter((p) => p.state === 'YELLOW').length
   const rot = pakete.filter((p) => p.state === 'RED').length
killedBy: leitstand Kennzahl-Kacheln rechnet den grünen Anteil über alle aufbewahrten Läufe ohne graue Pakete
statusReason: expected { prozent: +0, gruen: +0, …(3) } to deeply equal { Object (prozent, gruen, ...) }

[Killed] ArrowFunction
src/lib/leitstand.ts:465:30
   pakete: readonly { state: NightRunState }[],
 ): { gruen: number; gelb: number; rot: number; gesamt: number } {
   const gruen = pakete.filter((p) => p.state === 'GREEN').length
-  const gelb = pakete.filter((p) => p.state === 'YELLOW').length
+  const gelb = pakete.filter(() => undefined).length
   const rot = pakete.filter((p) => p.state === 'RED').length
   return { gruen, gelb, rot, gesamt: gruen + gelb + rot }
killedBy: leitstand Kennzahl-Kacheln rechnet den grünen Anteil über alle aufbewahrten Läufe ohne graue Pakete
statusReason: expected { prozent: 75, gruen: 3, …(3) } to deeply equal { Object (prozent, gruen, ...) }

[Killed] ConditionalExpression
src/lib/leitstand.ts:465:37
   pakete: readonly { state: NightRunState }[],
 ): { gruen: number; gelb: number; rot: number; gesamt: number } {
   const gruen = pakete.filter((p) => p.state === 'GREEN').length
-  const gelb = pakete.filter((p) => p.state === 'YELLOW').length
+  const gelb = pakete.filter((p) => false).length
   const rot = pakete.filter((p) => p.state === 'RED').length
   return { gruen, gelb, rot, gesamt: gruen + gelb + rot }
killedBy: leitstand Kennzahl-Kacheln rechnet den grünen Anteil über alle aufbewahrten Läufe ohne graue Pakete
statusReason: expected { prozent: 75, gruen: 3, …(3) } to deeply equal { Object (prozent, gruen, ...) }

[Killed] ArrowFunction
src/lib/leitstand.ts:466:29
 ): { gruen: number; gelb: number; rot: number; gesamt: number } {
   const gruen = pakete.filter((p) => p.state === 'GREEN').length
   const gelb = pakete.filter((p) => p.state === 'YELLOW').length
-  const rot = pakete.filter((p) => p.state === 'RED').length
+  const rot = pakete.filter(() => undefined).length
   return { gruen, gelb, rot, gesamt: gruen + gelb + rot }
 }
killedBy: leitstand Kennzahl-Kacheln rechnet den grünen Anteil über alle aufbewahrten Läufe ohne graue Pakete
statusReason: expected { Object (prozent, gruen, ...) } to deeply equal { Object (prozent, gruen, ...) }

[Killed] MethodExpression
src/lib/leitstand.ts:466:15
 ): { gruen: number; gelb: number; rot: number; gesamt: number } {
   const gruen = pakete.filter((p) => p.state === 'GREEN').length
   const gelb = pakete.filter((p) => p.state === 'YELLOW').length
-  const rot = pakete.filter((p) => p.state === 'RED').length
+  const rot = pakete.length
   return { gruen, gelb, rot, gesamt: gruen + gelb + rot }
 }
killedBy: leitstand Kennzahl-Kacheln rechnet den grünen Anteil über alle aufbewahrten Läufe ohne graue Pakete
statusReason: expected { Object (prozent, gruen, ...) } to deeply equal { Object (prozent, gruen, ...) }

[Killed] ArithmeticOperator
src/lib/leitstand.ts:467:38
   const gruen = pakete.filter((p) => p.state === 'GREEN').length
   const gelb = pakete.filter((p) => p.state === 'YELLOW').length
   const rot = pakete.filter((p) => p.state === 'RED').length
-  return { gruen, gelb, rot, gesamt: gruen + gelb + rot }
+  return { gruen, gelb, rot, gesamt: gruen - gelb + rot }
 }
 
killedBy: leitstand Kennzahl-Kacheln rechnet den grünen Anteil über alle aufbewahrten Läufe ohne graue Pakete
statusReason: expected { prozent: 100, gruen: 3, …(3) } to deeply equal { Object (prozent, gruen, ...) }

[Killed] ArithmeticOperator
src/lib/leitstand.ts:467:38
   const gruen = pakete.filter((p) => p.state === 'GREEN').length
   const gelb = pakete.filter((p) => p.state === 'YELLOW').length
   const rot = pakete.filter((p) => p.state === 'RED').length
-  return { gruen, gelb, rot, gesamt: gruen + gelb + rot }
+  return { gruen, gelb, rot, gesamt: gruen + gelb - rot }
 }
 
killedBy: leitstand Kennzahl-Kacheln rechnet den grünen Anteil über alle aufbewahrten Läufe ohne graue Pakete
statusReason: expected { prozent: 100, gruen: 3, …(3) } to deeply equal { Object (prozent, gruen, ...) }

[Killed] BlockStatement
src/lib/leitstand.ts:474:89
  * Punkte einer Sparkline im Rahmen 124 × 36 des Entwurfs: links 2, rechts 122, oben 4, unten 30.
  * Ein einzelner Wert oder lauter gleiche Werte liegen auf halber Höhe.
  */
-export function funkenPunkte(werte: readonly number[]): Array<{ x: number; y: number }> {
-  const min = Math.min(...werte)
-  const max = Math.max(...werte)
-  const schritt = werte.length > 1 ? 120 / (werte.length - 1) : 0
-  return werte.map((wert, i) => ({
-    x: Math.round((2 + i * schritt) * 10) / 10,
-    y: max === min ? 17 : Math.round((30 - ((wert - min) / (max - min)) * 26) * 10) / 10,
-  }))
-}
+export function funkenPunkte(werte: readonly number[]): Array<{ x: number; y: number }> {}
 
 /** Die Kalenderwoche nach ISO 8601 eines Wochenbeginns — Beschriftung unter dem Balkenwerk. */
killedBy: leitstand Kennzahl-Kacheln legt die Sparkline in den Rahmen des Entwurfs
statusReason: expected undefined to deeply equal [ { x: 2, y: 30 }, …(2) ]

[Killed] MethodExpression
src/lib/leitstand.ts:475:15
  * Ein einzelner Wert oder lauter gleiche Werte liegen auf halber Höhe.
  */
 export function funkenPunkte(werte: readonly number[]): Array<{ x: number; y: number }> {
-  const min = Math.min(...werte)
+  const min = Math.max(...werte)
   const max = Math.max(...werte)
   const schritt = werte.length > 1 ? 120 / (werte.length - 1) : 0
killedBy: leitstand Kennzahl-Kacheln legt die Sparkline in den Rahmen des Entwurfs
statusReason: expected [ { x: 2, y: 17 }, …(2) ] to deeply equal [ { x: 2, y: 30 }, …(2) ]

[Killed] MethodExpression
src/lib/leitstand.ts:476:15
  */
 export function funkenPunkte(werte: readonly number[]): Array<{ x: number; y: number }> {
   const min = Math.min(...werte)
-  const max = Math.max(...werte)
+  const max = Math.min(...werte)
   const schritt = werte.length > 1 ? 120 / (werte.length - 1) : 0
   return werte.map((wert, i) => ({
killedBy: leitstand Kennzahl-Kacheln legt die Sparkline in den Rahmen des Entwurfs
statusReason: expected [ { x: 2, y: 17 }, …(2) ] to deeply equal [ { x: 2, y: 30 }, …(2) ]

[Killed] ArithmeticOperator
src/lib/leitstand.ts:477:38
 export function funkenPunkte(werte: readonly number[]): Array<{ x: number; y: number }> {
   const min = Math.min(...werte)
   const max = Math.max(...werte)
-  const schritt = werte.length > 1 ? 120 / (werte.length - 1) : 0
+  const schritt = werte.length > 1 ? 120 * (werte.length - 1) : 0
   return werte.map((wert, i) => ({
     x: Math.round((2 + i * schritt) * 10) / 10,
killedBy: leitstand Kennzahl-Kacheln legt die Sparkline in den Rahmen des Entwurfs
statusReason: expected [ { x: 2, y: 30 }, …(2) ] to deeply equal [ { x: 2, y: 30 }, …(2) ]

[Killed] ConditionalExpression
src/lib/leitstand.ts:477:19
 export function funkenPunkte(werte: readonly number[]): Array<{ x: number; y: number }> {
   const min = Math.min(...werte)
   const max = Math.max(...werte)
-  const schritt = werte.length > 1 ? 120 / (werte.length - 1) : 0
+  const schritt = true ? 120 / (werte.length - 1) : 0
   return werte.map((wert, i) => ({
     x: Math.round((2 + i * schritt) * 10) / 10,
killedBy: leitstand Kennzahl-Kacheln legt die Sparkline in den Rahmen des Entwurfs
statusReason: expected [ { x: NaN, y: 17 } ] to deeply equal [ { x: 2, y: 17 } ]

[Killed] ArrowFunction
src/lib/leitstand.ts:478:20
   const min = Math.min(...werte)
   const max = Math.max(...werte)
   const schritt = werte.length > 1 ? 120 / (werte.length - 1) : 0
-  return werte.map((wert, i) => ({
-    x: Math.round((2 + i * schritt) * 10) / 10,
-    y: max === min ? 17 : Math.round((30 - ((wert - min) / (max - min)) * 26) * 10) / 10,
-  }))
+  return werte.map(() => undefined)
 }
 
killedBy: leitstand Kennzahl-Kacheln legt die Sparkline in den Rahmen des Entwurfs
statusReason: expected [ undefined, undefined, undefined ] to deeply equal [ { x: 2, y: 30 }, …(2) ]

[Killed] ArithmeticOperator
src/lib/leitstand.ts:479:19
   const max = Math.max(...werte)
   const schritt = werte.length > 1 ? 120 / (werte.length - 1) : 0
   return werte.map((wert, i) => ({
-    x: Math.round((2 + i * schritt) * 10) / 10,
+    x: Math.round((2 + i * schritt) / 10) / 10,
     y: max === min ? 17 : Math.round((30 - ((wert - min) / (max - min)) * 26) * 10) / 10,
   }))
killedBy: leitstand Kennzahl-Kacheln legt die Sparkline in den Rahmen des Entwurfs
statusReason: expected [ { x: +0, y: 30 }, …(2) ] to deeply equal [ { x: 2, y: 30 }, …(2) ]

[Killed] ArithmeticOperator
src/lib/leitstand.ts:479:24
   const max = Math.max(...werte)
   const schritt = werte.length > 1 ? 120 / (werte.length - 1) : 0
   return werte.map((wert, i) => ({
-    x: Math.round((2 + i * schritt) * 10) / 10,
+    x: Math.round((2 + i / schritt) * 10) / 10,
     y: max === min ? 17 : Math.round((30 - ((wert - min) / (max - min)) * 26) * 10) / 10,
   }))
killedBy: leitstand Kennzahl-Kacheln legt die Sparkline in den Rahmen des Entwurfs
statusReason: expected [ { x: 2, y: 30 }, …(2) ] to deeply equal [ { x: 2, y: 30 }, …(2) ]

[Killed] ArithmeticOperator
src/lib/leitstand.ts:480:27
   const schritt = werte.length > 1 ? 120 / (werte.length - 1) : 0
   return werte.map((wert, i) => ({
     x: Math.round((2 + i * schritt) * 10) / 10,
-    y: max === min ? 17 : Math.round((30 - ((wert - min) / (max - min)) * 26) * 10) / 10,
+    y: max === min ? 17 : Math.round((30 - (wert - min) / (max - min) * 26) * 10) * 10,
   }))
 }
killedBy: leitstand Kennzahl-Kacheln legt die Sparkline in den Rahmen des Entwurfs
statusReason: expected [ { x: 2, y: 3000 }, …(2) ] to deeply equal [ { x: 2, y: 30 }, …(2) ]

[Killed] ArithmeticOperator
src/lib/leitstand.ts:480:39
   const schritt = werte.length > 1 ? 120 / (werte.length - 1) : 0
   return werte.map((wert, i) => ({
     x: Math.round((2 + i * schritt) * 10) / 10,
-    y: max === min ? 17 : Math.round((30 - ((wert - min) / (max - min)) * 26) * 10) / 10,
+    y: max === min ? 17 : Math.round((30 + (wert - min) / (max - min) * 26) * 10) / 10,
   }))
 }
killedBy: leitstand Kennzahl-Kacheln legt die Sparkline in den Rahmen des Entwurfs
statusReason: expected [ { x: 2, y: 30 }, …(2) ] to deeply equal [ { x: 2, y: 30 }, …(2) ]

[Killed] BlockStatement
src/lib/leitstand.ts:485:52
 }
 
 /** Die Kalenderwoche nach ISO 8601 eines Wochenbeginns — Beschriftung unter dem Balkenwerk. */
-export function kalenderwoche(iso: string): number {
-  const datum = new Date(iso)
-  const tag = new Date(Date.UTC(datum.getUTCFullYear(), datum.getUTCMonth(), datum.getUTCDate()))
-  const wochentag = tag.getUTCDay() || 7
-  tag.setUTCDate(tag.getUTCDate() + 4 - wochentag)
-  const jahresbeginn = new Date(Date.UTC(tag.getUTCFullYear(), 0, 1))
-  return Math.ceil(((tag.getTime() - jahresbeginn.getTime()) / 86_400_000 + 1) / 7)
-}
+export function kalenderwoche(iso: string): number {}
 
 /** Höhen der Balken in Prozent des höchsten Werts; ohne Wert über null steht jeder Balken bei 0. */
killedBy: leitstand Platten nennt die ISO-Kalenderwoche eines Wochenbeginns, auch über den Jahreswechsel
statusReason: expected undefined to be 23 // Object.is equality

[Killed] ConditionalExpression
src/lib/leitstand.ts:488:21
 export function kalenderwoche(iso: string): number {
   const datum = new Date(iso)
   const tag = new Date(Date.UTC(datum.getUTCFullYear(), datum.getUTCMonth(), datum.getUTCDate()))
-  const wochentag = tag.getUTCDay() || 7
+  const wochentag = true
   tag.setUTCDate(tag.getUTCDate() + 4 - wochentag)
   const jahresbeginn = new Date(Date.UTC(tag.getUTCFullYear(), 0, 1))
killedBy: leitstand Platten nennt die ISO-Kalenderwoche eines Wochenbeginns, auch über den Jahreswechsel
statusReason: expected 1 to be 53 // Object.is equality

[Killed] LogicalOperator
src/lib/leitstand.ts:488:21
 export function kalenderwoche(iso: string): number {
   const datum = new Date(iso)
   const tag = new Date(Date.UTC(datum.getUTCFullYear(), datum.getUTCMonth(), datum.getUTCDate()))
-  const wochentag = tag.getUTCDay() || 7
+  const wochentag = tag.getUTCDay() && 7
   tag.setUTCDate(tag.getUTCDate() + 4 - wochentag)
   const jahresbeginn = new Date(Date.UTC(tag.getUTCFullYear(), 0, 1))
killedBy: leitstand Platten nennt die ISO-Kalenderwoche eines Wochenbeginns, auch über den Jahreswechsel
statusReason: expected 22 to be 23 // Object.is equality

[Killed] MethodExpression
src/lib/leitstand.ts:489:3
   const datum = new Date(iso)
   const tag = new Date(Date.UTC(datum.getUTCFullYear(), datum.getUTCMonth(), datum.getUTCDate()))
   const wochentag = tag.getUTCDay() || 7
-  tag.setUTCDate(tag.getUTCDate() + 4 - wochentag)
+  tag.setTime(tag.getUTCDate() + 4 - wochentag)
   const jahresbeginn = new Date(Date.UTC(tag.getUTCFullYear(), 0, 1))
   return Math.ceil(((tag.getTime() - jahresbeginn.getTime()) / 86_400_000 + 1) / 7)
killedBy: leitstand Platten nennt die ISO-Kalenderwoche eines Wochenbeginns, auch über den Jahreswechsel
statusReason: expected 1 to be 23 // Object.is equality

[Killed] ArithmeticOperator
src/lib/leitstand.ts:489:18
   const datum = new Date(iso)
   const tag = new Date(Date.UTC(datum.getUTCFullYear(), datum.getUTCMonth(), datum.getUTCDate()))
   const wochentag = tag.getUTCDay() || 7
-  tag.setUTCDate(tag.getUTCDate() + 4 - wochentag)
+  tag.setUTCDate(tag.getUTCDate() - 4 - wochentag)
   const jahresbeginn = new Date(Date.UTC(tag.getUTCFullYear(), 0, 1))
   return Math.ceil(((tag.getTime() - jahresbeginn.getTime()) / 86_400_000 + 1) / 7)
killedBy: leitstand Platten nennt die ISO-Kalenderwoche eines Wochenbeginns, auch über den Jahreswechsel
statusReason: expected 21 to be 23 // Object.is equality

[Killed] ArithmeticOperator
src/lib/leitstand.ts:491:20
   const wochentag = tag.getUTCDay() || 7
   tag.setUTCDate(tag.getUTCDate() + 4 - wochentag)
   const jahresbeginn = new Date(Date.UTC(tag.getUTCFullYear(), 0, 1))
-  return Math.ceil(((tag.getTime() - jahresbeginn.getTime()) / 86_400_000 + 1) / 7)
+  return Math.ceil(((tag.getTime() - jahresbeginn.getTime()) / 86_400_000 + 1) * 7)
 }
 
killedBy: leitstand Platten nennt die ISO-Kalenderwoche eines Wochenbeginns, auch über den Jahreswechsel
statusReason: expected 1085 to be 23 // Object.is equality

[Killed] ArithmeticOperator
src/lib/leitstand.ts:491:21
   const wochentag = tag.getUTCDay() || 7
   tag.setUTCDate(tag.getUTCDate() + 4 - wochentag)
   const jahresbeginn = new Date(Date.UTC(tag.getUTCFullYear(), 0, 1))
-  return Math.ceil(((tag.getTime() - jahresbeginn.getTime()) / 86_400_000 + 1) / 7)
+  return Math.ceil(((tag.getTime() - jahresbeginn.getTime()) / 86_400_000 - 1) / 7)
 }
 
killedBy: leitstand Platten nennt die ISO-Kalenderwoche eines Wochenbeginns, auch über den Jahreswechsel
statusReason: expected 22 to be 23 // Object.is equality

[Killed] BlockStatement
src/lib/leitstand.ts:495:66
 }
 
 /** Höhen der Balken in Prozent des höchsten Werts; ohne Wert über null steht jeder Balken bei 0. */
-export function balkenHoehen(werte: readonly number[]): number[] {
-  const max = Math.max(0, ...werte)
-  return werte.map((wert) => (max === 0 ? 0 : Math.round((wert / max) * 100)))
-}
+export function balkenHoehen(werte: readonly number[]): number[] {}
 
 /** Eine Zeile der Abbruchgründe (Entwurf Z. 1606–1653): Klasse, Zahl, Breite relativ zur häufigsten. */
killedBy: leitstand Platten setzt Balkenhöhen relativ zum höchsten Wert
statusReason: expected undefined to deeply equal [ 50, 100, 25 ]

[Killed] MethodExpression
src/lib/leitstand.ts:496:15
 
 /** Höhen der Balken in Prozent des höchsten Werts; ohne Wert über null steht jeder Balken bei 0. */
 export function balkenHoehen(werte: readonly number[]): number[] {
-  const max = Math.max(0, ...werte)
+  const max = Math.min(0, ...werte)
   return werte.map((wert) => (max === 0 ? 0 : Math.round((wert / max) * 100)))
 }
killedBy: leitstand Platten setzt Balkenhöhen relativ zum höchsten Wert
statusReason: expected [ +0, +0, +0 ] to deeply equal [ 50, 100, 25 ]

[Killed] ConditionalExpression
src/lib/leitstand.ts:497:31
 /** Höhen der Balken in Prozent des höchsten Werts; ohne Wert über null steht jeder Balken bei 0. */
 export function balkenHoehen(werte: readonly number[]): number[] {
   const max = Math.max(0, ...werte)
-  return werte.map((wert) => (max === 0 ? 0 : Math.round((wert / max) * 100)))
+  return werte.map((wert) => (true ? 0 : Math.round((wert / max) * 100)))
 }
 
killedBy: leitstand Platten setzt Balkenhöhen relativ zum höchsten Wert
statusReason: expected [ +0, +0, +0 ] to deeply equal [ 50, 100, 25 ]

[Killed] ConditionalExpression
src/lib/leitstand.ts:497:31
 /** Höhen der Balken in Prozent des höchsten Werts; ohne Wert über null steht jeder Balken bei 0. */
 export function balkenHoehen(werte: readonly number[]): number[] {
   const max = Math.max(0, ...werte)
-  return werte.map((wert) => (max === 0 ? 0 : Math.round((wert / max) * 100)))
+  return werte.map((wert) => (false ? 0 : Math.round((wert / max) * 100)))
 }
 
killedBy: leitstand Platten setzt Balkenhöhen relativ zum höchsten Wert
statusReason: expected [ NaN, NaN ] to deeply equal [ +0, +0 ]

[Killed] BlockStatement
src/lib/leitstand.ts:508:83
   melder: Melder
 }
 
-export function abbruchgruende(zaehler: NightRunErrorClassCounts): Klassenzeile[] {
-  const eintraege = (Object.entries(zaehler) as Array<[NightRunErrorClass, number]>).filter(([, zahl]) => zahl > 0)
-  const max = Math.max(0, ...eintraege.map(([, zahl]) => zahl))
-  return eintraege
-    .toSorted((a, b) => b[1] - a[1] || a[0].localeCompare(b[0]))
-    .map(([klasse, zahl]) => ({
-      klasse,
-      zahl,
-      breite: Math.round((zahl / max) * 100),
-      melder: MELDER_JE_FEHLERKLASSE[klasse],
-    }))
-}
+export function abbruchgruende(zaehler: NightRunErrorClassCounts): Klassenzeile[] {}
 
 /** Eine Token-Menge in der Einheit des Entwurfs: „4,82 Mio", „186 Tsd" oder die Zahl selbst. */
killedBy: leitstand Platten sortiert Abbruchgründe nach Häufigkeit und färbt sie nach Art
statusReason: expected undefined to deeply equal [ Array(4) ]

[Killed] ConditionalExpression
src/lib/leitstand.ts:509:107
 }
 
 export function abbruchgruende(zaehler: NightRunErrorClassCounts): Klassenzeile[] {
-  const eintraege = (Object.entries(zaehler) as Array<[NightRunErrorClass, number]>).filter(([, zahl]) => zahl > 0)
+  const eintraege = (Object.entries(zaehler) as Array<[NightRunErrorClass, number]>).filter(([, zahl]) => true)
   const max = Math.max(0, ...eintraege.map(([, zahl]) => zahl))
   return eintraege
killedBy: leitstand Platten sortiert Abbruchgründe nach Häufigkeit und färbt sie nach Art
statusReason: expected [ Array(5) ] to deeply equal [ Array(4) ]

[Killed] ArrowFunction
src/lib/leitstand.ts:509:93
 }
 
 export function abbruchgruende(zaehler: NightRunErrorClassCounts): Klassenzeile[] {
-  const eintraege = (Object.entries(zaehler) as Array<[NightRunErrorClass, number]>).filter(([, zahl]) => zahl > 0)
+  const eintraege = (Object.entries(zaehler) as Array<[NightRunErrorClass, number]>).filter(() => undefined)
   const max = Math.max(0, ...eintraege.map(([, zahl]) => zahl))
   return eintraege
killedBy: leitstand Platten sortiert Abbruchgründe nach Häufigkeit und färbt sie nach Art
statusReason: expected [] to deeply equal [ Array(4) ]

[Killed] MethodExpression
src/lib/leitstand.ts:510:15
 
 export function abbruchgruende(zaehler: NightRunErrorClassCounts): Klassenzeile[] {
   const eintraege = (Object.entries(zaehler) as Array<[NightRunErrorClass, number]>).filter(([, zahl]) => zahl > 0)
-  const max = Math.max(0, ...eintraege.map(([, zahl]) => zahl))
+  const max = Math.min(0, ...eintraege.map(([, zahl]) => zahl))
   return eintraege
     .toSorted((a, b) => b[1] - a[1] || a[0].localeCompare(b[0]))
killedBy: leitstand Platten sortiert Abbruchgründe nach Häufigkeit und färbt sie nach Art
statusReason: expected [ Array(4) ] to deeply equal [ Array(4) ]

[Killed] ArrowFunction
src/lib/leitstand.ts:510:44
 
 export function abbruchgruende(zaehler: NightRunErrorClassCounts): Klassenzeile[] {
   const eintraege = (Object.entries(zaehler) as Array<[NightRunErrorClass, number]>).filter(([, zahl]) => zahl > 0)
-  const max = Math.max(0, ...eintraege.map(([, zahl]) => zahl))
+  const max = Math.max(0, ...eintraege.map(() => undefined))
   return eintraege
     .toSorted((a, b) => b[1] - a[1] || a[0].localeCompare(b[0]))
killedBy: leitstand Platten sortiert Abbruchgründe nach Häufigkeit und färbt sie nach Art
statusReason: expected [ Array(4) ] to deeply equal [ Array(4) ]

[Killed] ArrowFunction
src/lib/leitstand.ts:512:15
   const eintraege = (Object.entries(zaehler) as Array<[NightRunErrorClass, number]>).filter(([, zahl]) => zahl > 0)
   const max = Math.max(0, ...eintraege.map(([, zahl]) => zahl))
   return eintraege
-    .toSorted((a, b) => b[1] - a[1] || a[0].localeCompare(b[0]))
+    .toSorted(() => undefined)
     .map(([klasse, zahl]) => ({
       klasse,
killedBy: leitstand Platten sortiert Abbruchgründe nach Häufigkeit und färbt sie nach Art
statusReason: expected [ { …(4) }, …(3) ] to deeply equal [ Array(4) ]
