[Killed] ArrowFunction
src/lib/nachtlaufFormat.ts:19:23
  * Ein Betrag oder die ausdrückliche Auskunft, dass der Stand keinen führt. „0 $" wäre eine
  * Behauptung über etwas, das gar nicht gemeldet wurde.
  */
-export const betrag = (wert: number | undefined): string =>
-  wert === undefined ? 'nicht angegeben' : KOSTEN_FORMAT.format(wert)
+export const betrag = () => undefined
 
 /**
killedBy: nachtlaufFormat betrag schreibt US-Dollar in deutscher Schreibweise und sagt, wenn nichts angegeben ist
statusReason: Cannot read properties of undefined (reading 'replaceAll')

[Killed] ConditionalExpression
src/lib/nachtlaufFormat.ts:20:3
  * Behauptung über etwas, das gar nicht gemeldet wurde.
  */
 export const betrag = (wert: number | undefined): string =>
-  wert === undefined ? 'nicht angegeben' : KOSTEN_FORMAT.format(wert)
+  true ? 'nicht angegeben' : KOSTEN_FORMAT.format(wert)
 
 /**
killedBy: vergleichMitVorzeitraum nennt teurer mit dem Unterschied, ohne dass der Leser rechnet
statusReason: expected 'nicht angegeben teurer als im Vorzeit…' to be '2,50 $ teurer als im Vorzeitraum' // Object.is equality

[Killed] ConditionalExpression
src/lib/nachtlaufFormat.ts:20:3
  * Behauptung über etwas, das gar nicht gemeldet wurde.
  */
 export const betrag = (wert: number | undefined): string =>
-  wert === undefined ? 'nicht angegeben' : KOSTEN_FORMAT.format(wert)
+  false ? 'nicht angegeben' : KOSTEN_FORMAT.format(wert)
 
 /**
killedBy: nachtlaufFormat betrag schreibt US-Dollar in deutscher Schreibweise und sagt, wenn nichts angegeben ist
statusReason: expected 'NaN $' to be 'nicht angegeben' // Object.is equality

[Killed] ArrowFunction
src/lib/nachtlaufFormat.ts:26:22
  * Eine Verbrauchszahl mit ihrer Einheit, oder die ausdrueckliche Fehlanzeige. „0 Token" waere eine
  * Behauptung ueber etwas, das gar nicht gemessen wurde — dieselbe Linie wie bei {@link betrag}.
  */
-export const menge = (wert: number | undefined): string =>
-  wert === undefined ? 'nicht gemessen' : `${TOKEN_FORMAT.format(wert)} Token`
+export const menge = () => undefined
 
 /** Ein gemessener Kostenbetrag oder „nicht gemessen" — die Verbrauchs-Schwester von {@link betrag}. */
killedBy: nachtlaufFormat menge nennt ihre Einheit
statusReason: expected undefined to be '8.883.160 Token' // Object.is equality

[Killed] ConditionalExpression
src/lib/nachtlaufFormat.ts:27:3
  * Behauptung ueber etwas, das gar nicht gemessen wurde — dieselbe Linie wie bei {@link betrag}.
  */
 export const menge = (wert: number | undefined): string =>
-  wert === undefined ? 'nicht gemessen' : `${TOKEN_FORMAT.format(wert)} Token`
+  true ? 'nicht gemessen' : `${TOKEN_FORMAT.format(wert)} Token`
 
 /** Ein gemessener Kostenbetrag oder „nicht gemessen" — die Verbrauchs-Schwester von {@link betrag}. */
killedBy: nachtlaufFormat menge nennt ihre Einheit
statusReason: expected 'nicht gemessen' to be '8.883.160 Token' // Object.is equality

[Killed] ConditionalExpression
src/lib/nachtlaufFormat.ts:27:3
  * Behauptung ueber etwas, das gar nicht gemessen wurde — dieselbe Linie wie bei {@link betrag}.
  */
 export const menge = (wert: number | undefined): string =>
-  wert === undefined ? 'nicht gemessen' : `${TOKEN_FORMAT.format(wert)} Token`
+  false ? 'nicht gemessen' : `${TOKEN_FORMAT.format(wert)} Token`
 
 /** Ein gemessener Kostenbetrag oder „nicht gemessen" — die Verbrauchs-Schwester von {@link betrag}. */
killedBy: nachtlaufFormat menge nennt ihre Einheit
statusReason: expected 'NaN Token' to be 'nicht gemessen' // Object.is equality

[Killed] ArrowFunction
src/lib/nachtlaufFormat.ts:30:23
   wert === undefined ? 'nicht gemessen' : `${TOKEN_FORMAT.format(wert)} Token`
 
 /** Ein gemessener Kostenbetrag oder „nicht gemessen" — die Verbrauchs-Schwester von {@link betrag}. */
-export const kosten = (wert: number | undefined): string =>
-  wert === undefined ? 'nicht gemessen' : KOSTEN_FORMAT.format(wert)
+export const kosten = () => undefined
 
 /**
killedBy: nachtlaufFormat kosten nennt eine fehlende Angabe „nicht gemessen", eine gemessene Null bleibt ein Betrag
statusReason: Cannot read properties of undefined (reading 'replaceAll')

[Killed] ConditionalExpression
src/lib/nachtlaufFormat.ts:31:3
 
 /** Ein gemessener Kostenbetrag oder „nicht gemessen" — die Verbrauchs-Schwester von {@link betrag}. */
 export const kosten = (wert: number | undefined): string =>
-  wert === undefined ? 'nicht gemessen' : KOSTEN_FORMAT.format(wert)
+  false ? 'nicht gemessen' : KOSTEN_FORMAT.format(wert)
 
 /**
killedBy: nachtlaufFormat kosten nennt eine fehlende Angabe „nicht gemessen", eine gemessene Null bleibt ein Betrag
statusReason: expected 'NaN $' to be 'nicht gemessen' // Object.is equality

[Killed] EqualityOperator
src/lib/nachtlaufFormat.ts:31:3
 
 /** Ein gemessener Kostenbetrag oder „nicht gemessen" — die Verbrauchs-Schwester von {@link betrag}. */
 export const kosten = (wert: number | undefined): string =>
-  wert === undefined ? 'nicht gemessen' : KOSTEN_FORMAT.format(wert)
+  wert !== undefined ? 'nicht gemessen' : KOSTEN_FORMAT.format(wert)
 
 /**
killedBy: nachtlaufFormat kosten nennt eine fehlende Angabe „nicht gemessen", eine gemessene Null bleibt ein Betrag
statusReason: expected 'nicht gemessen' to be '0,94 $' // Object.is equality

[Killed] LogicalOperator
src/lib/nachtlaufFormat.ts:40:70
  * gehört zu den Formatierern, die sie erwarten, und eine dreifache Kopie derselben Zeile läuft
  * beim nächsten Gedanken über die 0 auseinander. Die 0 bleibt eine Zahl — sie wurde gemessen.
  */
-export const ohneNull = (wert: number | null): number | undefined => wert ?? undefined
+export const ohneNull = (wert: number | null): number | undefined => wert && undefined
 
killedBy: nachtlaufFormat ohneNull macht aus `null` ein `undefined` und lässt jede Zahl stehen — auch die 0
statusReason: expected null to be undefined

[Killed] ArrowFunction
src/lib/nachtlaufFormat.ts:40:25
  * gehört zu den Formatierern, die sie erwarten, und eine dreifache Kopie derselben Zeile läuft
  * beim nächsten Gedanken über die 0 auseinander. Die 0 bleibt eine Zahl — sie wurde gemessen.
  */
-export const ohneNull = (wert: number | null): number | undefined => wert ?? undefined
+export const ohneNull = () => undefined
 
killedBy: nachtlaufFormat ohneNull macht aus `null` ein `undefined` und lässt jede Zahl stehen — auch die 0
statusReason: expected undefined to be +0 // Object.is equality
