[Killed] ArrowFunction
src/lib/nightRunErgebnisstand.ts:226:26
   string,
   { auszug: (p: RohPruefung) => string; erfolg?: Farbe; fehlschlag?: Farbe }
 >([
-  ['geprueft', { auszug: () => 'geprüft', erfolg: { state: 'GREEN' } }],
+  ['geprueft', { auszug: () => undefined, erfolg: { state: 'GREEN' } }],
   ['leeresPaket', { auszug: () => 'leeres Paket', erfolg: { state: 'GREEN' } }],
   [
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `erfolg` mit gepruefter Runde gruen
statusReason: Cannot read properties of undefined (reading 'slice')

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:226:32
   string,
   { auszug: (p: RohPruefung) => string; erfolg?: Farbe; fehlschlag?: Farbe }
 >([
-  ['geprueft', { auszug: () => 'geprüft', erfolg: { state: 'GREEN' } }],
+  ['geprueft', { auszug: () => "", erfolg: { state: 'GREEN' } }],
   ['leeresPaket', { auszug: () => 'leeres Paket', erfolg: { state: 'GREEN' } }],
   [
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `erfolg` mit gepruefter Runde gruen
statusReason: expected '' to be 'geprüft' // Object.is equality

[Killed] ArrowFunction
src/lib/nightRunErgebnisstand.ts:227:29
   { auszug: (p: RohPruefung) => string; erfolg?: Farbe; fehlschlag?: Farbe }
 >([
   ['geprueft', { auszug: () => 'geprüft', erfolg: { state: 'GREEN' } }],
-  ['leeresPaket', { auszug: () => 'leeres Paket', erfolg: { state: 'GREEN' } }],
+  ['leeresPaket', { auszug: () => undefined, erfolg: { state: 'GREEN' } }],
   [
     'ungeprueft',
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `erfolg` mit leerem Paket gruen
statusReason: Cannot read properties of undefined (reading 'slice')

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:227:68
   { auszug: (p: RohPruefung) => string; erfolg?: Farbe; fehlschlag?: Farbe }
 >([
   ['geprueft', { auszug: () => 'geprüft', erfolg: { state: 'GREEN' } }],
-  ['leeresPaket', { auszug: () => 'leeres Paket', erfolg: { state: 'GREEN' } }],
+  ['leeresPaket', { auszug: () => 'leeres Paket', erfolg: { state: "" } }],
   [
     'ungeprueft',
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `erfolg` mit leerem Paket gruen
statusReason: expected '' to be 'GREEN' // Object.is equality

[Survived] ArrayDeclaration
src/lib/nightRunErgebnisstand.ts:228:3
 >([
   ['geprueft', { auszug: () => 'geprüft', erfolg: { state: 'GREEN' } }],
   ['leeresPaket', { auszug: () => 'leeres Paket', erfolg: { state: 'GREEN' } }],
-  [
-    'ungeprueft',
-    {
-      auszug: () => 'Nachweis fehlt — die Session hat keine Prüfung gefahren',
-      erfolg: { state: 'YELLOW', errorClass: 'CHECKS_NOT_STARTED' },
-      fehlschlag: { state: 'RED', errorClass: 'CHECKS_NOT_STARTED' },
-    },
-  ],
+  [],
   [
     'unlesbar',

[Survived] ObjectLiteral
src/lib/nightRunErgebnisstand.ts:230:5
   ['leeresPaket', { auszug: () => 'leeres Paket', erfolg: { state: 'GREEN' } }],
   [
     'ungeprueft',
-    {
-      auszug: () => 'Nachweis fehlt — die Session hat keine Prüfung gefahren',
-      erfolg: { state: 'YELLOW', errorClass: 'CHECKS_NOT_STARTED' },
-      fehlschlag: { state: 'RED', errorClass: 'CHECKS_NOT_STARTED' },
-    },
+    {},
   ],
   [

[Survived] ArrowFunction
src/lib/nightRunErgebnisstand.ts:231:15
   [
     'ungeprueft',
     {
-      auszug: () => 'Nachweis fehlt — die Session hat keine Prüfung gefahren',
+      auszug: () => undefined,
       erfolg: { state: 'YELLOW', errorClass: 'CHECKS_NOT_STARTED' },
       fehlschlag: { state: 'RED', errorClass: 'CHECKS_NOT_STARTED' },

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:231:21
   [
     'ungeprueft',
     {
-      auszug: () => 'Nachweis fehlt — die Session hat keine Prüfung gefahren',
+      auszug: () => "",
       erfolg: { state: 'YELLOW', errorClass: 'CHECKS_NOT_STARTED' },
       fehlschlag: { state: 'RED', errorClass: 'CHECKS_NOT_STARTED' },
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `erfolg` ohne gefahrene Pruefung gelb mit CHECKS_NOT_STARTED
statusReason: expected '' to be 'Nachweis fehlt — die Session hat kein…' // Object.is equality

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:232:46
     'ungeprueft',
     {
       auszug: () => 'Nachweis fehlt — die Session hat keine Prüfung gefahren',
-      erfolg: { state: 'YELLOW', errorClass: 'CHECKS_NOT_STARTED' },
+      erfolg: { state: 'YELLOW', errorClass: "" },
       fehlschlag: { state: 'RED', errorClass: 'CHECKS_NOT_STARTED' },
     },
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `erfolg` ohne gefahrene Pruefung gelb mit CHECKS_NOT_STARTED
statusReason: expected '' to be 'CHECKS_NOT_STARTED' // Object.is equality

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:233:28
     {
       auszug: () => 'Nachweis fehlt — die Session hat keine Prüfung gefahren',
       erfolg: { state: 'YELLOW', errorClass: 'CHECKS_NOT_STARTED' },
-      fehlschlag: { state: 'RED', errorClass: 'CHECKS_NOT_STARTED' },
+      fehlschlag: { state: "", errorClass: 'CHECKS_NOT_STARTED' },
     },
   ],
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `fehlschlag` ohne gefahrene Pruefung rot mit CHECKS_NOT_STARTED
statusReason: expected '' to be 'RED' // Object.is equality

[Killed] ObjectLiteral
src/lib/nightRunErgebnisstand.ts:238:5
   ],
   [
     'unlesbar',
-    {
-      auszug: (p) => `Nachweis unlesbar (${p.fehler})`,
-      erfolg: { state: 'YELLOW', errorClass: 'CHECKS_NOT_STARTED' },
-      fehlschlag: { state: 'RED', errorClass: 'CHECKS_NOT_STARTED' },
-    },
+    {},
   ],
   [
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `erfolg` mit unlesbarem Nachweis gelb mit CHECKS_NOT_STARTED
statusReason: unerwartet nicht deutbar: nicht-unterstuetzt

[Killed] ArrowFunction
src/lib/nightRunErgebnisstand.ts:239:15
   [
     'unlesbar',
     {
-      auszug: (p) => `Nachweis unlesbar (${p.fehler})`,
+      auszug: () => undefined,
       erfolg: { state: 'YELLOW', errorClass: 'CHECKS_NOT_STARTED' },
       fehlschlag: { state: 'RED', errorClass: 'CHECKS_NOT_STARTED' },
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `erfolg` mit unlesbarem Nachweis gelb mit CHECKS_NOT_STARTED
statusReason: Cannot read properties of undefined (reading 'slice')

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:239:22
   [
     'unlesbar',
     {
-      auszug: (p) => `Nachweis unlesbar (${p.fehler})`,
+      auszug: (p) => ``,
       erfolg: { state: 'YELLOW', errorClass: 'CHECKS_NOT_STARTED' },
       fehlschlag: { state: 'RED', errorClass: 'CHECKS_NOT_STARTED' },
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `erfolg` mit unlesbarem Nachweis gelb mit CHECKS_NOT_STARTED
statusReason: expected '' to be 'Nachweis unlesbar (Unexpected token })' // Object.is equality

[Killed] ObjectLiteral
src/lib/nightRunErgebnisstand.ts:240:15
     'unlesbar',
     {
       auszug: (p) => `Nachweis unlesbar (${p.fehler})`,
-      erfolg: { state: 'YELLOW', errorClass: 'CHECKS_NOT_STARTED' },
+      erfolg: {},
       fehlschlag: { state: 'RED', errorClass: 'CHECKS_NOT_STARTED' },
     },
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `erfolg` mit unlesbarem Nachweis gelb mit CHECKS_NOT_STARTED
statusReason: expected undefined to be 'YELLOW' // Object.is equality

[Killed] ObjectLiteral
src/lib/nightRunErgebnisstand.ts:241:19
     {
       auszug: (p) => `Nachweis unlesbar (${p.fehler})`,
       erfolg: { state: 'YELLOW', errorClass: 'CHECKS_NOT_STARTED' },
-      fehlschlag: { state: 'RED', errorClass: 'CHECKS_NOT_STARTED' },
+      fehlschlag: {},
     },
   ],
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `fehlschlag` mit unlesbarem Nachweis rot mit CHECKS_NOT_STARTED
statusReason: expected undefined to be 'RED' // Object.is equality

[Survived] ArrayDeclaration
src/lib/nightRunErgebnisstand.ts:244:3
       fehlschlag: { state: 'RED', errorClass: 'CHECKS_NOT_STARTED' },
     },
   ],
-  [
-    'rot',
-    {
-      auszug: (p) => `Nachweis rot — ${p.rotesKommando} endete ${p.rotesErgebnis}`,
-      erfolg: { state: 'YELLOW', errorClass: 'CHECKS_RED' },
-      fehlschlag: { state: 'RED', errorClass: 'CHECKS_RED' },
-    },
-  ],
+  [],
 ])
 

[Survived] ArrowFunction
src/lib/nightRunErgebnisstand.ts:247:15
   [
     'rot',
     {
-      auszug: (p) => `Nachweis rot — ${p.rotesKommando} endete ${p.rotesErgebnis}`,
+      auszug: () => undefined,
       erfolg: { state: 'YELLOW', errorClass: 'CHECKS_RED' },
       fehlschlag: { state: 'RED', errorClass: 'CHECKS_RED' },

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:248:46
     'rot',
     {
       auszug: (p) => `Nachweis rot — ${p.rotesKommando} endete ${p.rotesErgebnis}`,
-      erfolg: { state: 'YELLOW', errorClass: 'CHECKS_RED' },
+      erfolg: { state: 'YELLOW', errorClass: "" },
       fehlschlag: { state: 'RED', errorClass: 'CHECKS_RED' },
     },
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `erfolg` mit rotem Nachweis gelb mit CHECKS_RED
statusReason: expected '' to be 'CHECKS_RED' // Object.is equality

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:249:47
     {
       auszug: (p) => `Nachweis rot — ${p.rotesKommando} endete ${p.rotesErgebnis}`,
       erfolg: { state: 'YELLOW', errorClass: 'CHECKS_RED' },
-      fehlschlag: { state: 'RED', errorClass: 'CHECKS_RED' },
+      fehlschlag: { state: 'RED', errorClass: "" },
     },
   ],
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `fehlschlag` mit rotem Nachweis rot mit CHECKS_RED
statusReason: expected '' to be 'CHECKS_RED' // Object.is equality

[Killed] ArrayDeclaration
src/lib/nightRunErgebnisstand.ts:260:88
  * erwaehnen), und der erste Treffer gewinnt. Ohne feste Ordnung kippte derselbe Text
  * je nach Auswertungsreihenfolge auf eine andere Farbe.
  */
-const ZURUECKGESTELLT: ReadonlyArray<{ trifft: (grund: string) => boolean } & Farbe> = [
-  { trifft: (g) => g.includes('Abhaengigkeit'), state: 'GREY', errorClass: 'DEPENDENCY_UNMET' },
-  { trifft: (g) => g.includes('kit:klaeren'), state: 'RED', errorClass: 'AWAITING_DECISION' },
-  {
-    trifft: (g) => g.startsWith('Session ohne In-review-Ergebnis'),
-    state: 'RED',
-    errorClass: 'UNEXPECTED_STATE',
-  },
-]
+const ZURUECKGESTELLT: ReadonlyArray<{ trifft: (grund: string) => boolean } & Farbe> = []
 
 /**
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht ein wegen unerfuellter Abhaengigkeit zurueckgestelltes Paket grau mit DEPENDENCY_UNMET
statusReason: expected undefined to be 'DEPENDENCY_UNMET' // Object.is equality

[Killed] ArrowFunction
src/lib/nightRunErgebnisstand.ts:261:13
  * je nach Auswertungsreihenfolge auf eine andere Farbe.
  */
 const ZURUECKGESTELLT: ReadonlyArray<{ trifft: (grund: string) => boolean } & Farbe> = [
-  { trifft: (g) => g.includes('Abhaengigkeit'), state: 'GREY', errorClass: 'DEPENDENCY_UNMET' },
+  { trifft: () => undefined, state: 'GREY', errorClass: 'DEPENDENCY_UNMET' },
   { trifft: (g) => g.includes('kit:klaeren'), state: 'RED', errorClass: 'AWAITING_DECISION' },
   {
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht ein wegen unerfuellter Abhaengigkeit zurueckgestelltes Paket grau mit DEPENDENCY_UNMET
statusReason: expected undefined to be 'DEPENDENCY_UNMET' // Object.is equality

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:261:56
  * je nach Auswertungsreihenfolge auf eine andere Farbe.
  */
 const ZURUECKGESTELLT: ReadonlyArray<{ trifft: (grund: string) => boolean } & Farbe> = [
-  { trifft: (g) => g.includes('Abhaengigkeit'), state: 'GREY', errorClass: 'DEPENDENCY_UNMET' },
+  { trifft: (g) => g.includes('Abhaengigkeit'), state: "", errorClass: 'DEPENDENCY_UNMET' },
   { trifft: (g) => g.includes('kit:klaeren'), state: 'RED', errorClass: 'AWAITING_DECISION' },
   {
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht ein wegen unerfuellter Abhaengigkeit zurueckgestelltes Paket grau mit DEPENDENCY_UNMET
statusReason: expected '' to be 'GREY' // Object.is equality

[Killed] ArrowFunction
src/lib/nightRunErgebnisstand.ts:262:13
  */
 const ZURUECKGESTELLT: ReadonlyArray<{ trifft: (grund: string) => boolean } & Farbe> = [
   { trifft: (g) => g.includes('Abhaengigkeit'), state: 'GREY', errorClass: 'DEPENDENCY_UNMET' },
-  { trifft: (g) => g.includes('kit:klaeren'), state: 'RED', errorClass: 'AWAITING_DECISION' },
+  { trifft: () => undefined, state: 'RED', errorClass: 'AWAITING_DECISION' },
   {
     trifft: (g) => g.startsWith('Session ohne In-review-Ergebnis'),
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht ein wegen kit:klaeren zurueckgestelltes Paket rot mit AWAITING_DECISION
statusReason: expected 'GREY' to be 'RED' // Object.is equality

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:262:31
  */
 const ZURUECKGESTELLT: ReadonlyArray<{ trifft: (grund: string) => boolean } & Farbe> = [
   { trifft: (g) => g.includes('Abhaengigkeit'), state: 'GREY', errorClass: 'DEPENDENCY_UNMET' },
-  { trifft: (g) => g.includes('kit:klaeren'), state: 'RED', errorClass: 'AWAITING_DECISION' },
+  { trifft: (g) => g.includes(""), state: 'RED', errorClass: 'AWAITING_DECISION' },
   {
     trifft: (g) => g.startsWith('Session ohne In-review-Ergebnis'),
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht eine Session ohne In-review-Ergebnis rot mit UNEXPECTED_STATE
statusReason: expected 'AWAITING_DECISION' to be 'UNEXPECTED_STATE' // Object.is equality

[Killed] MethodExpression
src/lib/nightRunErgebnisstand.ts:264:20
   { trifft: (g) => g.includes('Abhaengigkeit'), state: 'GREY', errorClass: 'DEPENDENCY_UNMET' },
   { trifft: (g) => g.includes('kit:klaeren'), state: 'RED', errorClass: 'AWAITING_DECISION' },
   {
-    trifft: (g) => g.startsWith('Session ohne In-review-Ergebnis'),
+    trifft: (g) => g.endsWith('Session ohne In-review-Ergebnis'),
     state: 'RED',
     errorClass: 'UNEXPECTED_STATE',
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht eine Session ohne In-review-Ergebnis rot mit UNEXPECTED_STATE
statusReason: expected 'GREY' to be 'RED' // Object.is equality

[Killed] ArrowFunction
src/lib/nightRunErgebnisstand.ts:264:13
   { trifft: (g) => g.includes('Abhaengigkeit'), state: 'GREY', errorClass: 'DEPENDENCY_UNMET' },
   { trifft: (g) => g.includes('kit:klaeren'), state: 'RED', errorClass: 'AWAITING_DECISION' },
   {
-    trifft: (g) => g.startsWith('Session ohne In-review-Ergebnis'),
+    trifft: () => undefined,
     state: 'RED',
     errorClass: 'UNEXPECTED_STATE',
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht eine Session ohne In-review-Ergebnis rot mit UNEXPECTED_STATE
statusReason: expected 'GREY' to be 'RED' // Object.is equality

[Survived] StringLiteral
src/lib/nightRunErgebnisstand.ts:295:5
 
 const OHNE_PRUEFUNG = new Map<string, Farbe & { excerpt: string }>([
   [
-    'unbekannt',
+    "",
     {
       state: 'RED',

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:299:16
     {
       state: 'RED',
       errorClass: 'HARD_ABORT',
-      excerpt: 'Run mitten in der Runde abgebrochen — kein Ausgang',
+      excerpt: "",
     },
   ],
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht ein Paket mit unbekanntem Ausgang rot mit HARD_ABORT
statusReason: expected '' to be 'Run mitten in der Runde abgebrochen —…' // Object.is equality

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:302:4
       excerpt: 'Run mitten in der Runde abgebrochen — kein Ausgang',
     },
   ],
-  ['harterStopp', { state: 'RED', errorClass: 'HARD_ABORT', excerpt: 'Harter Stopp' }],
+  ["", { state: 'RED', errorClass: 'HARD_ABORT', excerpt: 'Harter Stopp' }],
   [
     'verbraucht',
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht ein Paket mit hartem Stopp rot mit HARD_ABORT
statusReason: unerwartet nicht deutbar: nicht-unterstuetzt

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:302:47
       excerpt: 'Run mitten in der Runde abgebrochen — kein Ausgang',
     },
   ],
-  ['harterStopp', { state: 'RED', errorClass: 'HARD_ABORT', excerpt: 'Harter Stopp' }],
+  ['harterStopp', { state: 'RED', errorClass: "", excerpt: 'Harter Stopp' }],
   [
     'verbraucht',
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht ein Paket mit hartem Stopp rot mit HARD_ABORT
statusReason: expected '' to be 'HARD_ABORT' // Object.is equality

[Survived] StringLiteral
src/lib/nightRunErgebnisstand.ts:304:5
   ],
   ['harterStopp', { state: 'RED', errorClass: 'HARD_ABORT', excerpt: 'Harter Stopp' }],
   [
-    'verbraucht',
+    "",
     { state: 'GREEN', excerpt: 'Dokument(e) erzeugt und geprüft — Label entfernt' },
   ],

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:305:32
   ['harterStopp', { state: 'RED', errorClass: 'HARD_ABORT', excerpt: 'Harter Stopp' }],
   [
     'verbraucht',
-    { state: 'GREEN', excerpt: 'Dokument(e) erzeugt und geprüft — Label entfernt' },
+    { state: 'GREEN', excerpt: "" },
   ],
   ['liegengeblieben', { state: 'GREY', excerpt: NIGHT_RUN_AUSZUG_LIEGENGEBLIEBEN }],
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `verbraucht` GREEN ohne Fehlerklasse
statusReason: expected '' to be 'Dokument(e) erzeugt und geprüft — Lab…' // Object.is equality

[Killed] ObjectLiteral
src/lib/nightRunErgebnisstand.ts:307:23
     'verbraucht',
     { state: 'GREEN', excerpt: 'Dokument(e) erzeugt und geprüft — Label entfernt' },
   ],
-  ['liegengeblieben', { state: 'GREY', excerpt: NIGHT_RUN_AUSZUG_LIEGENGEBLIEBEN }],
+  ['liegengeblieben', {}],
   [
     'offen',
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `liegengeblieben` GREY ohne Fehlerklasse
statusReason: expected undefined to be 'GREY' // Object.is equality

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:307:32
     'verbraucht',
     { state: 'GREEN', excerpt: 'Dokument(e) erzeugt und geprüft — Label entfernt' },
   ],
-  ['liegengeblieben', { state: 'GREY', excerpt: NIGHT_RUN_AUSZUG_LIEGENGEBLIEBEN }],
+  ['liegengeblieben', { state: "", excerpt: NIGHT_RUN_AUSZUG_LIEGENGEBLIEBEN }],
   [
     'offen',
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `liegengeblieben` GREY ohne Fehlerklasse
statusReason: expected '' to be 'GREY' // Object.is equality

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:311:14
   [
     'offen',
     {
-      state: 'GREY',
+      state: "",
       excerpt: 'Noch nicht jedes erzeugte Dokument hat einen Endzustand — Label bleibt stehen',
     },
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `offen` GREY ohne Fehlerklasse
statusReason: expected '' to be 'GREY' // Object.is equality

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:312:16
     'offen',
     {
       state: 'GREY',
-      excerpt: 'Noch nicht jedes erzeugte Dokument hat einen Endzustand — Label bleibt stehen',
+      excerpt: "",
     },
   ],
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `offen` GREY ohne Fehlerklasse
statusReason: expected '' to be 'Noch nicht jedes erzeugte Dokument ha…' // Object.is equality

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:318:14
   [
     'ohneErgebnis',
     {
-      state: 'RED',
+      state: "",
       excerpt: 'Keine verwertbare Erzeugung — Session ohne Dokument oder Prüfrunde ohne Anker',
     },
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `ohneErgebnis` RED ohne Fehlerklasse
statusReason: expected '' to be 'RED' // Object.is equality

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:319:16
     'ohneErgebnis',
     {
       state: 'RED',
-      excerpt: 'Keine verwertbare Erzeugung — Session ohne Dokument oder Prüfrunde ohne Anker',
+      excerpt: "",
     },
   ],
killedBy: parseNightRunErgebnisstand — Zustand je Arbeitspaket macht `ohneErgebnis` RED ohne Fehlerklasse
statusReason: expected '' to be 'Keine verwertbare Erzeugung — Session…' // Object.is equality

[Survived] ArrayDeclaration
src/lib/nightRunErgebnisstand.ts:333:70
  * Review MIT Befund die gelungene Runde ist — er wartet planmaessig auf den Menschen,
  * es ist nichts kaputt.
  */
-const PRUEF_AUSGAENGE = new Map<string, Farbe & { excerpt: string }>([
-  ['ohneBefund', { state: 'GREEN', excerpt: 'geprüft ohne Befund — Marker gesetzt' }],
-  ['mitBefund', { state: 'GREEN', excerpt: 'geprüft mit Befund — kein Marker, wartet auf dich' }],
-  [
-    'schaerfungFehlt',
-    {
-      state: 'YELLOW',
-      errorClass: 'CHECKS_NOT_STARTED',
-      excerpt: 'Befunde vorhanden, aber kein Body-Vorschlag — Schärfung fehlt',
-    },
-  ],
-  [
-    'ohneErgebnis',
-    {
-      state: 'RED',
-      errorClass: 'CHECKS_NOT_STARTED',
-      excerpt: 'Die Review-Session hat nichts hinterlassen — weder Marker noch Befunde',
-    },
-  ],
-])
+const PRUEF_AUSGAENGE = new Map<string, Farbe & { excerpt: string }>([])
 
 /**

[Killed] ObjectLiteral
src/lib/nightRunErgebnisstand.ts:334:18
  * es ist nichts kaputt.
  */
 const PRUEF_AUSGAENGE = new Map<string, Farbe & { excerpt: string }>([
-  ['ohneBefund', { state: 'GREEN', excerpt: 'geprüft ohne Befund — Marker gesetzt' }],
+  ['ohneBefund', {}],
   ['mitBefund', { state: 'GREEN', excerpt: 'geprüft mit Befund — kein Marker, wartet auf dich' }],
   [
killedBy: parseNightRunErgebnisstand — Pruef-Lauf (Issue #816) macht `ohneBefund` gruen ohne Fehlerklasse
statusReason: expected undefined to be 'GREEN' // Object.is equality

[Killed] ObjectLiteral
src/lib/nightRunErgebnisstand.ts:335:17
  */
 const PRUEF_AUSGAENGE = new Map<string, Farbe & { excerpt: string }>([
   ['ohneBefund', { state: 'GREEN', excerpt: 'geprüft ohne Befund — Marker gesetzt' }],
-  ['mitBefund', { state: 'GREEN', excerpt: 'geprüft mit Befund — kein Marker, wartet auf dich' }],
+  ['mitBefund', {}],
   [
     'schaerfungFehlt',
killedBy: parseNightRunErgebnisstand — Pruef-Lauf (Issue #816) macht `mitBefund` gruen ohne Fehlerklasse — der Review hat sich gelohnt
statusReason: expected undefined to be 'GREEN' // Object.is equality

[Killed] ArrayDeclaration
src/lib/nightRunErgebnisstand.ts:344:3
       excerpt: 'Befunde vorhanden, aber kein Body-Vorschlag — Schärfung fehlt',
     },
   ],
-  [
-    'ohneErgebnis',
-    {
-      state: 'RED',
-      errorClass: 'CHECKS_NOT_STARTED',
-      excerpt: 'Die Review-Session hat nichts hinterlassen — weder Marker noch Befunde',
-    },
-  ],
+  [],
 ])
 
killedBy: parseNightRunErgebnisstand — Pruef-Lauf (Issue #816) macht `ohneErgebnis` im Pruef-Lauf rot mit CHECKS_NOT_STARTED
statusReason: expected undefined to be 'CHECKS_NOT_STARTED' // Object.is equality

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:348:19
     'ohneErgebnis',
     {
       state: 'RED',
-      errorClass: 'CHECKS_NOT_STARTED',
+      errorClass: "",
       excerpt: 'Die Review-Session hat nichts hinterlassen — weder Marker noch Befunde',
     },
killedBy: parseNightRunErgebnisstand — Pruef-Lauf (Issue #816) macht `ohneErgebnis` im Pruef-Lauf rot mit CHECKS_NOT_STARTED
statusReason: expected '' to be 'CHECKS_NOT_STARTED' // Object.is equality

[Survived] ArrayDeclaration
src/lib/nightRunErgebnisstand.ts:359:52
  * sie nichts; sie bleiben dort nicht unterstuetzt. `ohneErgebnis` steht bewusst NICHT
  * hier: Der Nachtplan-Lauf kennt ihn mit eigener Bedeutung (siehe {@link OHNE_PRUEFUNG}).
  */
-const NUR_PRUEFLAUF: ReadonlySet<string> = new Set([
-  'ohneBefund',
-  'mitBefund',
-  'schaerfungFehlt',
-  'syntheseOhneBeleg',
-])
+const NUR_PRUEFLAUF: ReadonlySet<string> = new Set([])
 
 /**

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:372:3
  * (entschieden am 2026-09-11, Issue-Review zu #816, Fund 2).
  */
 const NIE_IM_PRUEFLAUF: ReadonlySet<string> = new Set([
-  'erfolg',
+  "",
   'fehlschlag',
   'zurueckgestellt',
killedBy: parseNightRunErgebnisstand — Ablehnungen lehnt den Ausgang erfolg eines anderen Modus in einem Pruef-Lauf ab
statusReason: unerwartet deutbar

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:375:3
   'erfolg',
   'fehlschlag',
   'zurueckgestellt',
-  'verbraucht',
+  "",
   'offen',
 ])
killedBy: parseNightRunErgebnisstand — Ablehnungen lehnt den Ausgang verbraucht eines anderen Modus in einem Pruef-Lauf ab
statusReason: unerwartet deutbar

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:376:3
   'fehlschlag',
   'zurueckgestellt',
   'verbraucht',
-  'offen',
+  "",
 ])
 
killedBy: parseNightRunErgebnisstand — Ablehnungen lehnt den Ausgang offen eines anderen Modus in einem Pruef-Lauf ab
statusReason: unerwartet deutbar

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:395:5
     { state: 'GREEN', excerpt: 'Kette vollständig durchlaufen — Plan, Prüfung, Pakete, Abdeckung' },
   ],
   [
-    'angehalten',
+    "",
     {
       state: 'RED',
killedBy: parseNightRunErgebnisstand — Ketten-Lauf (Issue #854) macht `angehalten` rot mit AWAITING_DECISION — eine Stopp-Frage wartet auf einen Menschen
statusReason: unerwartet nicht deutbar: nicht-unterstuetzt

[Killed] StringLiteral
src/lib/nightRunErgebnisstand.ts:405:28
 ])
 
 /** Der Grund-Praefix, an dem `ketteSession` einen Zeitbudget-Abbruch erkennbar macht. */
-const ZEITBUDGET_PRAEFIX = 'Zeitbudget '
+const ZEITBUDGET_PRAEFIX = ""
 
 /**
killedBy: parseNightRunErgebnisstand — Ketten-Lauf (Issue #854) macht den Abbruch "Kostenbudget: 55.00 $ von 50 $ nach der Stufe review" rot mit HARD_ABORT, auch mit erzeugtem Dokument
statusReason: expected 'YELLOW' to be 'RED' // Object.is equality

[Survived] StringLiteral
src/lib/nightRunErgebnisstand.ts:411:73
  * Die Ausgaenge, die **nur** ein Ketten-Lauf schreibt — analog {@link NUR_PRUEFLAUF}. In
  * jedem anderen Modus sagen sie nichts und bleiben dort nicht unterstuetzt.
  */
-const NUR_KETTE: ReadonlySet<string> = new Set(['fertig', 'angehalten', 'abgebrochen'])
+const NUR_KETTE: ReadonlySet<string> = new Set(['fertig', 'angehalten', ""])
 
 /**

[Survived] StringLiteral
src/lib/nightRunErgebnisstand.ts:426:3
   'offen',
   'ohneErgebnis',
   'ohneBefund',
-  'mitBefund',
+  "",
   'schaerfungFehlt',
   'syntheseOhneBeleg',

[Survived] ArrayDeclaration
src/lib/nightRunErgebnisstand.ts:436:52
 ])
 
 /** Die Stufen, auf denen `night.mjs --review` laeuft. */
-const REVIEW_STUFEN: ReadonlySet<string> = new Set(['fachlich', 'plan', 'issue'])
+const REVIEW_STUFEN: ReadonlySet<string> = new Set([])
 
 /** Die Stufe, mit der `runReviewLoop` ohne `--stufe` laeuft (`args.stufe ?? "issue"`). */

[Survived] StringLiteral
src/lib/nightRunErgebnisstand.ts:436:65
 ])
 
 /** Die Stufen, auf denen `night.mjs --review` laeuft. */
-const REVIEW_STUFEN: ReadonlySet<string> = new Set(['fachlich', 'plan', 'issue'])
+const REVIEW_STUFEN: ReadonlySet<string> = new Set(['fachlich', "", 'issue'])
 
 /** Die Stufe, mit der `runReviewLoop` ohne `--stufe` laeuft (`args.stufe ?? "issue"`). */

[Survived] BlockStatement
src/lib/nightRunErgebnisstand.ts:461:104
  * **in der Einheit** und schreibt am Lauf deshalb immer `stufe: null` (`--kette` kennt
  * kein `--stufe`); ein gesetzter Wert waere eine Kombination, die kein Runner erzeugt.
  */
-function bestimmeModus(art: string | undefined, stufe: string | null | undefined): NightRunMode | null {
-  if (art === 'erzeugung' && stufe === 'plan') return 'NIGHTPLAN'
-  // Lose Gleichheit mit Bedacht: fehlendes und ausdruecklich leeres Feld sind hier dasselbe.
-  if (art === 'kette' && stufe == null) return 'CHAIN'
-  if (art === 'review' && (stufe === undefined || stufe === null || REVIEW_STUFEN.has(stufe))) return 'REVIEW'
-  if (art === 'implementierung' && (stufe === undefined || stufe === null)) return 'IMPLEMENTATION'
-  if (art === undefined && (stufe === undefined || stufe === null)) return 'IMPLEMENTATION'
-  return null
-}
+function bestimmeModus(art: string | undefined, stufe: string | null | undefined): NightRunMode | null {}
 
 /** Auszuege gehen an den Server und teilen sich die Spaltengrenze mit dem Protokoll-Parser. */

[Killed] ConditionalExpression
src/lib/nightRunErgebnisstand.ts:462:30
  * kein `--stufe`); ein gesetzter Wert waere eine Kombination, die kein Runner erzeugt.
  */
 function bestimmeModus(art: string | undefined, stufe: string | null | undefined): NightRunMode | null {
-  if (art === 'erzeugung' && stufe === 'plan') return 'NIGHTPLAN'
+  if (art === 'erzeugung' && true) return 'NIGHTPLAN'
   // Lose Gleichheit mit Bedacht: fehlendes und ausdruecklich leeres Feld sind hier dasselbe.
   if (art === 'kette' && stufe == null) return 'CHAIN'
killedBy: parseNightRunErgebnisstand — Ablehnungen lehnt die Kombination art=erzeugung/stufe=undefined ab — nur (erzeugung,plan) ist Nachtplan
statusReason: unerwartet deutbar

[Survived] EqualityOperator
src/lib/nightRunErgebnisstand.ts:462:30
  * kein `--stufe`); ein gesetzter Wert waere eine Kombination, die kein Runner erzeugt.
  */
 function bestimmeModus(art: string | undefined, stufe: string | null | undefined): NightRunMode | null {
-  if (art === 'erzeugung' && stufe === 'plan') return 'NIGHTPLAN'
+  if (art === 'erzeugung' && stufe !== 'plan') return 'NIGHTPLAN'
   // Lose Gleichheit mit Bedacht: fehlendes und ausdruecklich leeres Feld sind hier dasselbe.
   if (art === 'kette' && stufe == null) return 'CHAIN'
