[Killed] StringLiteral
src/lib/nightRunHandoff.ts:46:10
 
 /** Die Beschriftung je Zustand — Text traegt die Aussage, nicht nur die Farbe. */
 export const NIGHT_RUN_STATE_TEXT: Record<NightRunState, string> = {
-  GREEN: 'Erfolg',
+  GREEN: "",
   YELLOW: 'Erfolg, Prüfung rot',
   RED: 'gescheitert',
killedBy: nightRunZustandsText — Rueckfall wertgleich (AK 9 aus #842) laesst den gruenen und den grauen Zeitbudget-Fall auf die Zustandstabelle fallen
statusReason: expected '' to be 'Erfolg' // Object.is equality

[Killed] ObjectLiteral
src/lib/nightRunHandoff.ts:58:79
  * kaeme dort eine hinzu, braeche hier der Build, statt dass eine Klasse stumm ohne Beschriftung
  * erschiene. Deshalb zaehlt diese Datei die Klassen auch nirgends selbst auf.
  */
-export const NIGHT_RUN_ERROR_CLASS_TEXT: Record<NightRunErrorClass, string> = {
-  CHECKS_RED: 'Prüfungen rot',
-  CHECKS_NOT_STARTED: 'Prüfungen nicht gelaufen',
-  DEPENDENCY_UNMET: 'Abhängigkeit offen',
-  UNEXPECTED_STATE: 'Unerwarteter Zustand',
-  HARD_ABORT: 'Harter Abbruch',
-  AWAITING_DECISION: 'Wartet auf Entscheidung',
-  REVIEWER_FAILED: 'Prüf-Session gescheitert',
-  TIME_BUDGET_EXCEEDED: 'Zeitbudget erschöpft',
-}
+export const NIGHT_RUN_ERROR_CLASS_TEXT: Record<NightRunErrorClass, string> = {}
 
 /**
killedBy: buildHandoffText — gelbe und rote Arbeitspakete nennt zu einem roten Arbeitspaket Kartennummer, Zustand, Fehlerklasse und Auszug
statusReason: expected 'Befund des Runs zu Karte #700 Paket A…' to contain 'Harter Abbruch'

[Survived] StringLiteral
src/lib/nightRunHandoff.ts:60:23
  */
 export const NIGHT_RUN_ERROR_CLASS_TEXT: Record<NightRunErrorClass, string> = {
   CHECKS_RED: 'Prüfungen rot',
-  CHECKS_NOT_STARTED: 'Prüfungen nicht gelaufen',
+  CHECKS_NOT_STARTED: "",
   DEPENDENCY_UNMET: 'Abhängigkeit offen',
   UNEXPECTED_STATE: 'Unerwarteter Zustand',

[Survived] StringLiteral
src/lib/nightRunHandoff.ts:64:22
   DEPENDENCY_UNMET: 'Abhängigkeit offen',
   UNEXPECTED_STATE: 'Unerwarteter Zustand',
   HARD_ABORT: 'Harter Abbruch',
-  AWAITING_DECISION: 'Wartet auf Entscheidung',
+  AWAITING_DECISION: "",
   REVIEWER_FAILED: 'Prüf-Session gescheitert',
   TIME_BUDGET_EXCEEDED: 'Zeitbudget erschöpft',

[Killed] StringLiteral
src/lib/nightRunHandoff.ts:92:14
  * uebergangenen Pakets, und Grau allein sagte nicht, dass es nichts zu tun gab.
  */
 export const NIGHT_RUN_VERDICT_TEXT: Record<Verdict, string> = {
-  SUCCEEDED: 'gelungen',
+  SUCCEEDED: "",
   FAILED: 'nicht gelungen',
   WAITING: 'mit Vorbehalt',
killedBy: NIGHT_RUN_VERDICT_TEXT — die Woerter der fuenf Ausgaenge (#1096, #1121) traegt zu jedem der fuenf Ausgaenge einen nicht leeren Text
statusReason: expected '' not to be '' // Object.is equality

[Killed] StringLiteral
src/lib/nightRunHandoff.ts:94:12
 export const NIGHT_RUN_VERDICT_TEXT: Record<Verdict, string> = {
   SUCCEEDED: 'gelungen',
   FAILED: 'nicht gelungen',
-  WAITING: 'mit Vorbehalt',
+  WAITING: "",
   RUNNING: 'läuft',
   NO_WORK: 'nichts zu tun',
killedBy: NIGHT_RUN_VERDICT_TEXT — die Woerter der fuenf Ausgaenge (#1096, #1121) traegt zu jedem der fuenf Ausgaenge einen nicht leeren Text
statusReason: expected '' not to be '' // Object.is equality

[Killed] ObjectLiteral
src/lib/nightRunHandoff.ts:116:5
  */
 export const NIGHT_RUN_STATE_TEXT_BY_ERROR_CLASS: Partial<
   Record<NightRunErrorClass, Partial<Record<NightRunState, string>>>
-> = {
-  TIME_BUDGET_EXCEEDED: {
-    YELLOW: 'Am Zeitbudget beendet, Ergebnis liegt vor',
-    RED: 'Am Zeitbudget beendet, ohne Ergebnis',
-  },
-}
+> = {}
 
 /**
killedBy: nightRunZustandsText — Zeitbudget (Issue #856) nennt am gelben Vorgang das Zeitbudget als Grund statt „Erfolg, Prüfung rot"
statusReason: expected 'Erfolg, Prüfung rot' to be 'Am Zeitbudget beendet, Ergebnis liegt…' // Object.is equality

[Killed] StringLiteral
src/lib/nightRunHandoff.ts:118:13
   Record<NightRunErrorClass, Partial<Record<NightRunState, string>>>
 > = {
   TIME_BUDGET_EXCEEDED: {
-    YELLOW: 'Am Zeitbudget beendet, Ergebnis liegt vor',
+    YELLOW: "",
     RED: 'Am Zeitbudget beendet, ohne Ergebnis',
   },
killedBy: nightRunZustandsText — Zeitbudget (Issue #856) nennt am gelben Vorgang das Zeitbudget als Grund statt „Erfolg, Prüfung rot"
statusReason: expected '' to be 'Am Zeitbudget beendet, Ergebnis liegt…' // Object.is equality

[Killed] StringLiteral
src/lib/nightRunHandoff.ts:119:10
 > = {
   TIME_BUDGET_EXCEEDED: {
     YELLOW: 'Am Zeitbudget beendet, Ergebnis liegt vor',
-    RED: 'Am Zeitbudget beendet, ohne Ergebnis',
+    RED: "",
   },
 }
killedBy: nightRunZustandsText — Zeitbudget (Issue #856) nennt am roten Vorgang das Zeitbudget und das fehlende Ergebnis
statusReason: expected '' to be 'Am Zeitbudget beendet, ohne Ergebnis' // Object.is equality

[Killed] BlockStatement
src/lib/nightRunHandoff.ts:133:11
 export function nightRunZustandsText(
   state: NightRunState,
   errorClass: NightRunErrorClass | undefined,
-): string {
-  const jeKlasse = errorClass === undefined ? undefined : NIGHT_RUN_STATE_TEXT_BY_ERROR_CLASS[errorClass]
-  return jeKlasse?.[state] ?? NIGHT_RUN_STATE_TEXT[state]
-}
+): string {}
 
 /**
killedBy: buildHandoffText — gelbe und rote Arbeitspakete nennt zu einem roten Arbeitspaket Kartennummer, Zustand, Fehlerklasse und Auszug
statusReason: expected 'Befund des Runs zu Karte #700 Paket A…' to contain 'gescheitert'

[Killed] EqualityOperator
src/lib/nightRunHandoff.ts:134:20
   state: NightRunState,
   errorClass: NightRunErrorClass | undefined,
 ): string {
-  const jeKlasse = errorClass === undefined ? undefined : NIGHT_RUN_STATE_TEXT_BY_ERROR_CLASS[errorClass]
+  const jeKlasse = errorClass !== undefined ? undefined : NIGHT_RUN_STATE_TEXT_BY_ERROR_CLASS[errorClass]
   return jeKlasse?.[state] ?? NIGHT_RUN_STATE_TEXT[state]
 }
killedBy: nightRunZustandsText — Zeitbudget (Issue #856) nennt am gelben Vorgang das Zeitbudget als Grund statt „Erfolg, Prüfung rot"
statusReason: expected 'Erfolg, Prüfung rot' to be 'Am Zeitbudget beendet, Ergebnis liegt…' // Object.is equality

[Killed] ConditionalExpression
src/lib/nightRunHandoff.ts:134:20
   state: NightRunState,
   errorClass: NightRunErrorClass | undefined,
 ): string {
-  const jeKlasse = errorClass === undefined ? undefined : NIGHT_RUN_STATE_TEXT_BY_ERROR_CLASS[errorClass]
+  const jeKlasse = true ? undefined : NIGHT_RUN_STATE_TEXT_BY_ERROR_CLASS[errorClass]
   return jeKlasse?.[state] ?? NIGHT_RUN_STATE_TEXT[state]
 }
killedBy: nightRunZustandsText — Zeitbudget (Issue #856) nennt am gelben Vorgang das Zeitbudget als Grund statt „Erfolg, Prüfung rot"
statusReason: expected 'Erfolg, Prüfung rot' to be 'Am Zeitbudget beendet, Ergebnis liegt…' // Object.is equality

[Killed] LogicalOperator
src/lib/nightRunHandoff.ts:135:10
   errorClass: NightRunErrorClass | undefined,
 ): string {
   const jeKlasse = errorClass === undefined ? undefined : NIGHT_RUN_STATE_TEXT_BY_ERROR_CLASS[errorClass]
-  return jeKlasse?.[state] ?? NIGHT_RUN_STATE_TEXT[state]
+  return jeKlasse?.[state] && NIGHT_RUN_STATE_TEXT[state]
 }
 
killedBy: buildHandoffText — gelbe und rote Arbeitspakete nennt zu einem roten Arbeitspaket Kartennummer, Zustand, Fehlerklasse und Auszug
statusReason: expected 'Befund des Runs zu Karte #700 Paket A…' to contain 'gescheitert'

[Killed] OptionalChaining
src/lib/nightRunHandoff.ts:135:10
   errorClass: NightRunErrorClass | undefined,
 ): string {
   const jeKlasse = errorClass === undefined ? undefined : NIGHT_RUN_STATE_TEXT_BY_ERROR_CLASS[errorClass]
-  return jeKlasse?.[state] ?? NIGHT_RUN_STATE_TEXT[state]
+  return jeKlasse[state] ?? NIGHT_RUN_STATE_TEXT[state]
 }
 
killedBy: buildHandoffText — gelbe und rote Arbeitspakete nennt zu einem roten Arbeitspaket Kartennummer, Zustand, Fehlerklasse und Auszug
statusReason: Cannot read properties of undefined (reading 'RED')

[Killed] BlockStatement
src/lib/nightRunHandoff.ts:164:49
  * so innerhalb der Grenze, die er zusichert. Genau <em>auf</em> der Grenze wird nicht gekuerzt —
  * die Grenze ist die zugesagte Laenge, nicht ihr Ueberschreiten.
  */
-export function kurzGrund(text: string): string {
-  const zeile = text.split('\n').find((z) => z.trim() !== '')?.trim() ?? ''
-  return zeile.length <= KURZ_GRUND_MAX ? zeile : `${zeile.slice(0, KURZ_GRUND_MAX - 1)}…`
-}
+export function kurzGrund(text: string): string {}
 
 /**
killedBy: kurzGrund — der Abbruchgrund in einer Zeile (#1144) nimmt die erste nicht leere Zeile eines mehrzeiligen Textes
statusReason: expected undefined to be 'Harter Stopp (dirty-tree)' // Object.is equality

[Killed] ConditionalExpression
src/lib/nightRunHandoff.ts:165:46
  * die Grenze ist die zugesagte Laenge, nicht ihr Ueberschreiten.
  */
 export function kurzGrund(text: string): string {
-  const zeile = text.split('\n').find((z) => z.trim() !== '')?.trim() ?? ''
+  const zeile = text.split('\n').find((z) => true)?.trim() ?? ''
   return zeile.length <= KURZ_GRUND_MAX ? zeile : `${zeile.slice(0, KURZ_GRUND_MAX - 1)}…`
 }
killedBy: kurzGrund — der Abbruchgrund in einer Zeile (#1144) nimmt die erste nicht leere Zeile eines mehrzeiligen Textes
statusReason: expected '' to be 'Harter Stopp (dirty-tree)' // Object.is equality

[Killed] ArrowFunction
src/lib/nightRunHandoff.ts:165:39
  * die Grenze ist die zugesagte Laenge, nicht ihr Ueberschreiten.
  */
 export function kurzGrund(text: string): string {
-  const zeile = text.split('\n').find((z) => z.trim() !== '')?.trim() ?? ''
+  const zeile = text.split('\n').find(() => undefined)?.trim() ?? ''
   return zeile.length <= KURZ_GRUND_MAX ? zeile : `${zeile.slice(0, KURZ_GRUND_MAX - 1)}…`
 }
killedBy: kurzGrund — der Abbruchgrund in einer Zeile (#1144) nimmt die erste nicht leere Zeile eines mehrzeiligen Textes
statusReason: expected '' to be 'Harter Stopp (dirty-tree)' // Object.is equality

[Killed] ConditionalExpression
src/lib/nightRunHandoff.ts:166:10
  */
 export function kurzGrund(text: string): string {
   const zeile = text.split('\n').find((z) => z.trim() !== '')?.trim() ?? ''
-  return zeile.length <= KURZ_GRUND_MAX ? zeile : `${zeile.slice(0, KURZ_GRUND_MAX - 1)}…`
+  return false ? zeile : `${zeile.slice(0, KURZ_GRUND_MAX - 1)}…`
 }
 
killedBy: kurzGrund — der Abbruchgrund in einer Zeile (#1144) nimmt die erste nicht leere Zeile eines mehrzeiligen Textes
statusReason: expected 'Harter Stopp (dirty-tree)…' to be 'Harter Stopp (dirty-tree)' // Object.is equality

[Killed] MethodExpression
src/lib/nightRunHandoff.ts:166:54
  */
 export function kurzGrund(text: string): string {
   const zeile = text.split('\n').find((z) => z.trim() !== '')?.trim() ?? ''
-  return zeile.length <= KURZ_GRUND_MAX ? zeile : `${zeile.slice(0, KURZ_GRUND_MAX - 1)}…`
+  return zeile.length <= KURZ_GRUND_MAX ? zeile : `${zeile}…`
 }
 
killedBy: kurzGrund — der Abbruchgrund in einer Zeile (#1144) setzt das Auslassungszeichen genau bei Ueberschreitung
statusReason: expected 'xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx…' to be 'xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx…' // Object.is equality

[Killed] BlockStatement
src/lib/nightRunHandoff.ts:185:76
  * wird er nur hier: Eine zweite Textbaustelle formatierte frueher oder spaeter anders als das,
  * was tatsaechlich kopiert wird.
  */
-export function buildHandoffText(item: NightRunHandoffItem): string | null {
-  if (item.state !== 'YELLOW' && item.state !== 'RED') {
-    return null
-  }
-  const karte = item.title === '' ? `#${item.cardNumber}` : `#${item.cardNumber} ${item.title}`
-  const zeilen = [
-    `Befund des Runs zu Karte ${karte}`,
-    `Zustand: ${nightRunZustandsText(item.state, item.errorClass)}`,
-  ]
-
-  if (item.errorClass !== undefined) {
-    zeilen.push(`Fehlerklasse: ${NIGHT_RUN_ERROR_CLASS_TEXT[item.errorClass]}`)
-  }
-  // Truthiness statt `!== undefined`: Ein leerer Auszug ergaebe eine Zeile, die nichts sagt.
-  if (item.excerpt) {
-    zeilen.push(`Auszug: ${item.excerpt}`)
-  }
-  if (item.rawLines !== undefined && item.rawLines.length > 0) {
-    zeilen.push('Rohprotokoll:', ...item.rawLines)
-  }
-  return zeilen.join('\n')
-}
+export function buildHandoffText(item: NightRunHandoffItem): string | null {}
 
killedBy: buildHandoffText — gelbe und rote Arbeitspakete nennt zu einem roten Arbeitspaket Kartennummer, Zustand, Fehlerklasse und Auszug
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] EqualityOperator
src/lib/nightRunHandoff.ts:186:34
  * was tatsaechlich kopiert wird.
  */
 export function buildHandoffText(item: NightRunHandoffItem): string | null {
-  if (item.state !== 'YELLOW' && item.state !== 'RED') {
+  if (item.state !== 'YELLOW' && item.state === 'RED') {
     return null
   }
killedBy: buildHandoffText — gelbe und rote Arbeitspakete nennt zu einem roten Arbeitspaket Kartennummer, Zustand, Fehlerklasse und Auszug
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] StringLiteral
src/lib/nightRunHandoff.ts:191:5
   }
   const karte = item.title === '' ? `#${item.cardNumber}` : `#${item.cardNumber} ${item.title}`
   const zeilen = [
-    `Befund des Runs zu Karte ${karte}`,
+    ``,
     `Zustand: ${nightRunZustandsText(item.state, item.errorClass)}`,
   ]
killedBy: buildHandoffText — gelbe und rote Arbeitspakete nennt zu einem roten Arbeitspaket Kartennummer, Zustand, Fehlerklasse und Auszug
statusReason: expected '\nZustand: gescheitert\nFehlerklasse:…' to contain 'Paket A'

[Killed] ConditionalExpression
src/lib/nightRunHandoff.ts:195:7
     `Zustand: ${nightRunZustandsText(item.state, item.errorClass)}`,
   ]
 
-  if (item.errorClass !== undefined) {
+  if (false) {
     zeilen.push(`Fehlerklasse: ${NIGHT_RUN_ERROR_CLASS_TEXT[item.errorClass]}`)
   }
killedBy: buildHandoffText — gelbe und rote Arbeitspakete nennt zu einem roten Arbeitspaket Kartennummer, Zustand, Fehlerklasse und Auszug
statusReason: expected 'Befund des Runs zu Karte #700 Paket A…' to contain 'Harter Abbruch'

[Killed] BlockStatement
src/lib/nightRunHandoff.ts:199:21
     zeilen.push(`Fehlerklasse: ${NIGHT_RUN_ERROR_CLASS_TEXT[item.errorClass]}`)
   }
   // Truthiness statt `!== undefined`: Ein leerer Auszug ergaebe eine Zeile, die nichts sagt.
-  if (item.excerpt) {
-    zeilen.push(`Auszug: ${item.excerpt}`)
-  }
+  if (item.excerpt) {}
   if (item.rawLines !== undefined && item.rawLines.length > 0) {
     zeilen.push('Rohprotokoll:', ...item.rawLines)
killedBy: buildHandoffText — gelbe und rote Arbeitspakete nennt zu einem roten Arbeitspaket Kartennummer, Zustand, Fehlerklasse und Auszug
statusReason: expected 'Befund des Runs zu Karte #700 Paket A…' to contain '  HARTER STOPP: erfolgreiche Runde zu…'

[Killed] EqualityOperator
src/lib/nightRunHandoff.ts:202:38
   if (item.excerpt) {
     zeilen.push(`Auszug: ${item.excerpt}`)
   }
-  if (item.rawLines !== undefined && item.rawLines.length > 0) {
+  if (item.rawLines !== undefined && item.rawLines.length >= 0) {
     zeilen.push('Rohprotokoll:', ...item.rawLines)
   }
killedBy: buildHandoffText — Rohprotokoll erzeugt keinen Abschnitt, wenn die Rohzeilen leer sind
statusReason: expected 'Befund des Runs zu Karte #700 Paket A…' to be 'Befund des Runs zu Karte #700 Paket A…' // Object.is equality

[Killed] LogicalOperator
src/lib/nightRunHandoff.ts:202:7
   if (item.excerpt) {
     zeilen.push(`Auszug: ${item.excerpt}`)
   }
-  if (item.rawLines !== undefined && item.rawLines.length > 0) {
+  if (item.rawLines !== undefined || item.rawLines.length > 0) {
     zeilen.push('Rohprotokoll:', ...item.rawLines)
   }
killedBy: buildHandoffText — gelbe und rote Arbeitspakete nennt zu einem roten Arbeitspaket Kartennummer, Zustand, Fehlerklasse und Auszug
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] StringLiteral
src/lib/nightRunHandoff.ts:203:17
     zeilen.push(`Auszug: ${item.excerpt}`)
   }
   if (item.rawLines !== undefined && item.rawLines.length > 0) {
-    zeilen.push('Rohprotokoll:', ...item.rawLines)
+    zeilen.push("", ...item.rawLines)
   }
   return zeilen.join('\n')
killedBy: buildHandoffText — Rohprotokoll haengt an ein rotes Arbeitspaket den Abschnitt samt Rohzeilen an
statusReason: expected 'Befund des Runs zu Karte #700 Paket A…' to contain 'Rohprotokoll:'
