[Killed] Regex
src/lib/nightRunLog.ts:233:17
 }
 
 /** `[ISO-Zeitstempel] Text` — so schreibt `log()` in `night.mjs`. */
-const PRAEFIX = /^\[(\d{4}-\d{2}-\d{2}T\d{2}:\d{2}:\d{2}\.\d{3}Z)\] (.*)$/
+const PRAEFIX = /^\[(\d{4}-\d{2}-\D{2}T\d{2}:\d{2}:\d{2}\.\d{3}Z)\] (.*)$/
 
 /** Der zweite Schreiber: `fail()` schreibt ohne Praefix und beendet den Lauf. */
killedBy: parseNightRunErgebnisstand gegen parseNightRunLog deutet 'ohneBefund' im Pruef-Lauf aus beiden Quellen gleich
statusReason: Cannot read properties of undefined (reading 'mode')

[Killed] Regex
src/lib/nightRunLog.ts:233:17
 }
 
 /** `[ISO-Zeitstempel] Text` — so schreibt `log()` in `night.mjs`. */
-const PRAEFIX = /^\[(\d{4}-\d{2}-\d{2}T\d{2}:\d{2}:\d{2}\.\d{3}Z)\] (.*)$/
+const PRAEFIX = /^\[(\d{4}-\d{2}-\d{2}T\d:\d{2}:\d{2}\.\d{3}Z)\] (.*)$/
 
 /** Der zweite Schreiber: `fail()` schreibt ohne Praefix und beendet den Lauf. */
killedBy: parseNightRunErgebnisstand gegen parseNightRunLog deutet 'ohneBefund' im Pruef-Lauf aus beiden Quellen gleich
statusReason: Cannot read properties of undefined (reading 'mode')

[Killed] StringLiteral
src/lib/nightRunLog.ts:243:17
 
 /** Abschluss eines Laufs; `Dry-Run beendet` markiert ihn zugleich als Probelauf. */
 const ABSCHLUSS = /^(Nacht-Runner beendet|Nacht-Review beendet|Dry-Run beendet)/
-const DRY_RUN = 'Dry-Run beendet'
+const DRY_RUN = ""
 const STUFE = /beendet \(Stufe ([^)]+)\)/
 
killedBy: parseNightRunErgebnisstand gegen parseNightRunLog deutet 'ohneBefund' im Pruef-Lauf aus beiden Quellen gleich
statusReason: Cannot read properties of undefined (reading 'mode')

[Killed] Regex
src/lib/nightRunLog.ts:244:15
 /** Abschluss eines Laufs; `Dry-Run beendet` markiert ihn zugleich als Probelauf. */
 const ABSCHLUSS = /^(Nacht-Runner beendet|Nacht-Review beendet|Dry-Run beendet)/
 const DRY_RUN = 'Dry-Run beendet'
-const STUFE = /beendet \(Stufe ([^)]+)\)/
+const STUFE = /beendet \(Stufe ([)]+)\)/
 
 /**
killedBy: parseNightRunErgebnisstand gegen parseNightRunLog deutet 'ohneBefund' im Pruef-Lauf aus beiden Quellen gleich
statusReason: expected [ 'REVIEW', 'plan' ] to deeply equal [ 'REVIEW', undefined ]

[Killed] ObjectLiteral
src/lib/nightRunLog.ts:272:3
  */
 const MUSTER: ReadonlyArray<{ re: RegExp; deute: (m: RegExpExecArray) => Treffer }> = [
   // --- Implementierungs-Lauf, Ausgaenge je Arbeitspaket
-  {
-    re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
-    deute: (m) => ({ cardNumber: Number(m[3]), state: "GREEN", durationMs: minuten(m[1]), commit: m[2] }),
-  },
+  {},
   {
     re: /^ {2}Salvage erfolgreich, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
killedBy: parseNightRunErgebnisstand gegen parseNightRunLog deutet 'ohneBefund' im Pruef-Lauf aus beiden Quellen gleich
statusReason: Cannot read properties of undefined (reading 'exec')

[Killed] Regex
src/lib/nightRunLog.ts:273:9
 const MUSTER: ReadonlyArray<{ re: RegExp; deute: (m: RegExpExecArray) => Treffer }> = [
   // --- Implementierungs-Lauf, Ausgaenge je Arbeitspaket
   {
-    re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
+    re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min, Commit ([0-9a-f]{7,40}), Issue #(\D+) in In review\./,
     deute: (m) => ({ cardNumber: Number(m[3]), state: "GREEN", durationMs: minuten(m[1]), commit: m[2] }),
   },
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg mit gruenen Pruefungen gruen
statusReason: expected { cardNumber: 100, …(6) } to match object { state: 'GREEN', …(2) }
(6 matching properties omitted from actual)

[Survived] Regex
src/lib/nightRunLog.ts:273:9
 const MUSTER: ReadonlyArray<{ re: RegExp; deute: (m: RegExpExecArray) => Treffer }> = [
   // --- Implementierungs-Lauf, Ausgaenge je Arbeitspaket
   {
-    re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
+    re: /^ {2}Erfolg nach (\d(?:\.\d+)?) min, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
     deute: (m) => ({ cardNumber: Number(m[3]), state: "GREEN", durationMs: minuten(m[1]), commit: m[2] }),
   },

[Killed] StringLiteral
src/lib/nightRunLog.ts:274:55
   // --- Implementierungs-Lauf, Ausgaenge je Arbeitspaket
   {
     re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
-    deute: (m) => ({ cardNumber: Number(m[3]), state: "GREEN", durationMs: minuten(m[1]), commit: m[2] }),
+    deute: (m) => ({ cardNumber: Number(m[3]), state: "", durationMs: minuten(m[1]), commit: m[2] }),
   },
   {
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg mit gruenen Pruefungen gruen
statusReason: expected { cardNumber: 100, …(6) } to match object { state: 'GREEN', …(2) }
(6 matching properties omitted from actual)

[Survived] Regex
src/lib/nightRunLog.ts:277:9
     deute: (m) => ({ cardNumber: Number(m[3]), state: "GREEN", durationMs: minuten(m[1]), commit: m[2] }),
   },
   {
-    re: /^ {2}Salvage erfolgreich, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
+    re: / {2}Salvage erfolgreich, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "GREEN", commit: m[1] }),
   },

[Survived] StringLiteral
src/lib/nightRunLog.ts:278:55
   },
   {
     re: /^ {2}Salvage erfolgreich, Commit ([0-9a-f]{7,40}), Issue #(\d+) in In review\./,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "GREEN", commit: m[1] }),
+    deute: (m) => ({ cardNumber: Number(m[2]), state: "", commit: m[1] }),
   },
   {

[Killed] Regex
src/lib/nightRunLog.ts:281:9
     deute: (m) => ({ cardNumber: Number(m[2]), state: "GREEN", commit: m[1] }),
   },
   {
-    re: /^ {2}FEHLSCHLAG nach (\d+(?:\.\d+)?) min: Issue #(\d+) nicht in In review UND Working Tree dirty/,
+    re: /^ {2}FEHLSCHLAG nach (\d+(?:\.\d+)?) min: Issue #(\d) nicht in In review UND Working Tree dirty/,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
   },
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht einen Fehlschlag mit dirtyem Tree rot mit HARD_ABORT
statusReason: expected { cardNumber: 100, …(6) } to match object { state: 'RED', …(2) }
(5 matching properties omitted from actual)

[Killed] ObjectLiteral
src/lib/nightRunLog.ts:282:20
   },
   {
     re: /^ {2}FEHLSCHLAG nach (\d+(?:\.\d+)?) min: Issue #(\d+) nicht in In review UND Working Tree dirty/,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
+    deute: (m) => ({}),
   },
   {
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht einen Fehlschlag mit dirtyem Tree rot mit HARD_ABORT
statusReason: expected { cardNumber: 100, …(6) } to match object { state: 'RED', …(2) }
(5 matching properties omitted from actual)

[Killed] Regex
src/lib/nightRunLog.ts:285:9
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
   },
   {
-    re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d+) — die Session hat nichts hinterlassen/,
+    re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\D+) — die Session hat nichts hinterlassen/,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "CHECKS_NOT_STARTED", durationMs: minuten(m[1]) }),
   },
killedBy: parseNightRunErgebnisstand gegen parseNightRunLog deutet 'ohneErgebnis' im Pruef-Lauf aus beiden Quellen gleich
statusReason: expected [ 'RED', 'CHECKS_NOT_STARTED' ] to deeply equal [ 'RED', 'HARD_ABORT' ]

[Timeout] Regex
src/lib/nightRunLog.ts:285:9
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
   },
   {
-    re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d+) — die Session hat nichts hinterlassen/,
+    re: /^ {2}Fehlschlag nach (\d+(?:\.\d)?) min: Issue #(\d+) — die Session hat nichts hinterlassen/,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "CHECKS_NOT_STARTED", durationMs: minuten(m[1]) }),
   },

[Killed] StringLiteral
src/lib/nightRunLog.ts:286:74
   },
   {
     re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d+) — die Session hat nichts hinterlassen/,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "CHECKS_NOT_STARTED", durationMs: minuten(m[1]) }),
+    deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "", durationMs: minuten(m[1]) }),
   },
   {
killedBy: parseNightRunLog — Pruef-Lauf macht "die Session hat nichts hinterlassen" rot mit CHECKS_NOT_STARTED
statusReason: expected { cardNumber: 200, …(7) } to match object { state: 'RED', …(1) }
(6 matching properties omitted from actual)

[Killed] Regex
src/lib/nightRunLog.ts:289:9
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "CHECKS_NOT_STARTED", durationMs: minuten(m[1]) }),
   },
   {
-    re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d+) nicht in In review, Tree sauber/,
+    re: /^ {2}Fehlschlag nach (\D+(?:\.\d+)?) min: Issue #(\d+) nicht in In review, Tree sauber/,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "UNEXPECTED_STATE", durationMs: minuten(m[1]) }),
   },
killedBy: parseNightRunErgebnisstand gegen parseNightRunLog deutet 'Session ohne In-review-Ergebnis' aus beiden Quellen gleich
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] StringLiteral
src/lib/nightRunLog.ts:290:55
   },
   {
     re: /^ {2}Fehlschlag nach (\d+(?:\.\d+)?) min: Issue #(\d+) nicht in In review, Tree sauber/,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "UNEXPECTED_STATE", durationMs: minuten(m[1]) }),
+    deute: (m) => ({ cardNumber: Number(m[2]), state: "", errorClass: "UNEXPECTED_STATE", durationMs: minuten(m[1]) }),
   },
   {
killedBy: parseNightRunErgebnisstand gegen parseNightRunLog deutet 'Session ohne In-review-Ergebnis' aus beiden Quellen gleich
statusReason: expected [ 'RED', 'UNEXPECTED_STATE' ] to deeply equal [ 'RED', 'HARD_ABORT' ]

[Survived] Regex
src/lib/nightRunLog.ts:293:9
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "UNEXPECTED_STATE", durationMs: minuten(m[1]) }),
   },
   {
-    re: /^ {2}INFRASTRUKTUR-FEHLSCHLAG nach (\d+(?:\.\d+)?) min .*Issue #(\d+) bleibt unangetastet\./,
+    re: /^ {2}INFRASTRUKTUR-FEHLSCHLAG nach (\d+(?:\.\d+)?) min .Issue #(\d+) bleibt unangetastet\./,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
   },

[Survived] Regex
src/lib/nightRunLog.ts:293:9
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "UNEXPECTED_STATE", durationMs: minuten(m[1]) }),
   },
   {
-    re: /^ {2}INFRASTRUKTUR-FEHLSCHLAG nach (\d+(?:\.\d+)?) min .*Issue #(\d+) bleibt unangetastet\./,
+    re: /^ {2}INFRASTRUKTUR-FEHLSCHLAG nach (\d+(?:\.\d+)?) min .*Issue #(\D+) bleibt unangetastet\./,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "HARD_ABORT", durationMs: minuten(m[1]) }),
   },

[Survived] ObjectLiteral
src/lib/nightRunLog.ts:298:20
   },
   {
     re: /^ {2}HARTER STOPP: (?:erfolgreiche Runde zu|die Review-Session zu) Issue #(\d+)/,
-    deute: (m) => ({ cardNumber: Number(m[1]), state: "RED", errorClass: "HARD_ABORT" }),
+    deute: (m) => ({}),
   },
   {

[Killed] ObjectLiteral
src/lib/nightRunLog.ts:300:3
     re: /^ {2}HARTER STOPP: (?:erfolgreiche Runde zu|die Review-Session zu) Issue #(\d+)/,
     deute: (m) => ({ cardNumber: Number(m[1]), state: "RED", errorClass: "HARD_ABORT" }),
   },
-  {
-    re: /^ {2}SALVAGE-VERSUCH gescheitert — harter Stopp\. Issue #(\d+)/,
-    deute: (m) => ({ cardNumber: Number(m[1]), state: "RED", errorClass: "HARD_ABORT" }),
-  },
+  {},
 
   // --- Pruef-Lauf, Ausgaenge je Arbeitspaket
killedBy: parseNightRunErgebnisstand gegen parseNightRunLog deutet 'ohneBefund' im Pruef-Lauf aus beiden Quellen gleich
statusReason: Cannot read properties of undefined (reading 'exec')

[Killed] StringLiteral
src/lib/nightRunLog.ts:302:74
   },
   {
     re: /^ {2}SALVAGE-VERSUCH gescheitert — harter Stopp\. Issue #(\d+)/,
-    deute: (m) => ({ cardNumber: Number(m[1]), state: "RED", errorClass: "HARD_ABORT" }),
+    deute: (m) => ({ cardNumber: Number(m[1]), state: "RED", errorClass: "" }),
   },
 
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht einen gescheiterten Salvage-Versuch rot mit HARD_ABORT
statusReason: expected { cardNumber: 100, …(6) } to match object { state: 'RED', …(1) }
(5 matching properties omitted from actual)

[Killed] Regex
src/lib/nightRunLog.ts:307:9
 
   // --- Pruef-Lauf, Ausgaenge je Arbeitspaket
   {
-    re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min: Issue #(\d+) geprueft (?:ohne|mit) Befund/,
+    re: /^ {2}Erfolg nach (\D+(?:\.\d+)?) min: Issue #(\d+) geprueft (?:ohne|mit) Befund/,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "GREEN", durationMs: minuten(m[1]) }),
   },
killedBy: parseNightRunErgebnisstand gegen parseNightRunLog deutet 'ohneBefund' im Pruef-Lauf aus beiden Quellen gleich
statusReason: expected [ 'GREEN', undefined ] to deeply equal [ 'RED', 'HARD_ABORT' ]

[Timeout] Regex
src/lib/nightRunLog.ts:307:9
 
   // --- Pruef-Lauf, Ausgaenge je Arbeitspaket
   {
-    re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min: Issue #(\d+) geprueft (?:ohne|mit) Befund/,
+    re: /^ {2}Erfolg nach (\d(?:\.\d+)?) min: Issue #(\d+) geprueft (?:ohne|mit) Befund/,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "GREEN", durationMs: minuten(m[1]) }),
   },

[Killed] StringLiteral
src/lib/nightRunLog.ts:308:55
   // --- Pruef-Lauf, Ausgaenge je Arbeitspaket
   {
     re: /^ {2}Erfolg nach (\d+(?:\.\d+)?) min: Issue #(\d+) geprueft (?:ohne|mit) Befund/,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "GREEN", durationMs: minuten(m[1]) }),
+    deute: (m) => ({ cardNumber: Number(m[2]), state: "", durationMs: minuten(m[1]) }),
   },
   // Vor dem Schaerfungs-Muster: Beide Zeilen beginnen mit `  Nach <X> min: Issue #<N> — `,
killedBy: parseNightRunErgebnisstand gegen parseNightRunLog deutet 'ohneBefund' im Pruef-Lauf aus beiden Quellen gleich
statusReason: expected [ 'GREEN', undefined ] to deeply equal [ 'RED', 'HARD_ABORT' ]

[Killed] Regex
src/lib/nightRunLog.ts:314:9
   // und die Synthese ohne Beleg ist der schwerere Fall — das Kit setzt dabei
   // `kit:klaeren`, es wartet also eine Entscheidung auf einen Menschen (Issue #816).
   {
-    re: /^ {2}Nach (\d+(?:\.\d+)?) min: Issue #(\d+) — Synthese ohne Beleg: /,
+    re: /^ {2}Nach (\d+(?:\.\D+)?) min: Issue #(\d+) — Synthese ohne Beleg: /,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "AWAITING_DECISION", durationMs: minuten(m[1]) }),
   },
killedBy: parseNightRunLog — Pruef-Lauf macht "Synthese ohne Beleg" rot mit AWAITING_DECISION
statusReason: expected { cardNumber: 200, …(6) } to match object { cardNumber: 200, state: 'RED', …(2) }
(4 matching properties omitted from actual)

[Killed] Regex
src/lib/nightRunLog.ts:314:9
   // und die Synthese ohne Beleg ist der schwerere Fall — das Kit setzt dabei
   // `kit:klaeren`, es wartet also eine Entscheidung auf einen Menschen (Issue #816).
   {
-    re: /^ {2}Nach (\d+(?:\.\d+)?) min: Issue #(\d+) — Synthese ohne Beleg: /,
+    re: /^ {2}Nach (\d+(?:\.\d+)) min: Issue #(\d+) — Synthese ohne Beleg: /,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "AWAITING_DECISION", durationMs: minuten(m[1]) }),
   },
killedBy: parseNightRunErgebnisstand gegen parseNightRunLog deutet 'syntheseOhneBeleg' im Pruef-Lauf aus beiden Quellen gleich
statusReason: expected [ 'RED', 'AWAITING_DECISION' ] to deeply equal [ 'RED', 'HARD_ABORT' ]

[Killed] ArrowFunction
src/lib/nightRunLog.ts:315:12
   // `kit:klaeren`, es wartet also eine Entscheidung auf einen Menschen (Issue #816).
   {
     re: /^ {2}Nach (\d+(?:\.\d+)?) min: Issue #(\d+) — Synthese ohne Beleg: /,
-    deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "AWAITING_DECISION", durationMs: minuten(m[1]) }),
+    deute: () => undefined,
   },
   {
killedBy: parseNightRunLog — Pruef-Lauf macht "Synthese ohne Beleg" rot mit AWAITING_DECISION
statusReason: Cannot read properties of undefined (reading 'cardNumber')

[Timeout] Regex
src/lib/nightRunLog.ts:318:9
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "AWAITING_DECISION", durationMs: minuten(m[1]) }),
   },
   {
-    re: /^ {2}Nach (\d+(?:\.\d+)?) min: Issue #(\d+) — Befunde vorhanden, aber kein Body-Vorschlag/,
+    re: /^ {2}Nach (\d(?:\.\d+)?) min: Issue #(\d+) — Befunde vorhanden, aber kein Body-Vorschlag/,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "YELLOW", errorClass: "CHECKS_NOT_STARTED", durationMs: minuten(m[1]) }),
   },

[Timeout] Regex
src/lib/nightRunLog.ts:318:9
     deute: (m) => ({ cardNumber: Number(m[2]), state: "RED", errorClass: "AWAITING_DECISION", durationMs: minuten(m[1]) }),
   },
   {
-    re: /^ {2}Nach (\d+(?:\.\d+)?) min: Issue #(\d+) — Befunde vorhanden, aber kein Body-Vorschlag/,
+    re: /^ {2}Nach (\d+(?:\.\d)?) min: Issue #(\d+) — Befunde vorhanden, aber kein Body-Vorschlag/,
     deute: (m) => ({ cardNumber: Number(m[2]), state: "YELLOW", errorClass: "CHECKS_NOT_STARTED", durationMs: minuten(m[1]) }),
   },

[Killed] ObjectLiteral
src/lib/nightRunLog.ts:324:3
 
   // --- Uebergangene Arbeitspakete. `kit:klaeren` steht vor dem generischen Muster:
   // eine offene Entscheidung ist kein blosses Ueberspringen, sondern rot.
-  {
-    re: /^ {2}#(\d+) (.*?) -> uebersprungen \(kit:klaeren/,
-    deute: (m) => ({ cardNumber: Number(m[1]), title: m[2], state: "RED", errorClass: "AWAITING_DECISION" }),
-  },
+  {},
   {
     re: /^ {2}#(\d+) (.*?) -> uebersprungen \(/,
killedBy: parseNightRunErgebnisstand gegen parseNightRunLog deutet 'ohneBefund' im Pruef-Lauf aus beiden Quellen gleich
statusReason: Cannot read properties of undefined (reading 'exec')

[Killed] Regex
src/lib/nightRunLog.ts:325:9
   // --- Uebergangene Arbeitspakete. `kit:klaeren` steht vor dem generischen Muster:
   // eine offene Entscheidung ist kein blosses Ueberspringen, sondern rot.
   {
-    re: /^ {2}#(\d+) (.*?) -> uebersprungen \(kit:klaeren/,
+    re: /^ #(\d+) (.*?) -> uebersprungen \(kit:klaeren/,
     deute: (m) => ({ cardNumber: Number(m[1]), title: m[2], state: "RED", errorClass: "AWAITING_DECISION" }),
   },
killedBy: parseNightRunErgebnisstand gegen parseNightRunLog deutet 'kit:klaeren' aus beiden Quellen gleich
statusReason: expected [ 'RED', 'AWAITING_DECISION' ] to deeply equal [ 'GREY', undefined ]

[Killed] Regex
src/lib/nightRunLog.ts:329:9
     deute: (m) => ({ cardNumber: Number(m[1]), title: m[2], state: "RED", errorClass: "AWAITING_DECISION" }),
   },
   {
-    re: /^ {2}#(\d+) (.*?) -> uebersprungen \(/,
+    re: /^ {2}#(\D+) (.*?) -> uebersprungen \(/,
     deute: (m) => ({ cardNumber: Number(m[1]), title: m[2], state: "GREY" }),
   },
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht ein uebersprungenes Arbeitspaket grau und haelt den Grund fest
statusReason: Cannot read properties of undefined (reading 'state')

[Survived] Regex
src/lib/nightRunLog.ts:329:9
     deute: (m) => ({ cardNumber: Number(m[1]), title: m[2], state: "RED", errorClass: "AWAITING_DECISION" }),
   },
   {
-    re: /^ {2}#(\d+) (.*?) -> uebersprungen \(/,
+    re: / {2}#(\d+) (.*?) -> uebersprungen \(/,
     deute: (m) => ({ cardNumber: Number(m[1]), title: m[2], state: "GREY" }),
   },

[Killed] Regex
src/lib/nightRunLog.ts:333:9
     deute: (m) => ({ cardNumber: Number(m[1]), title: m[2], state: "GREY" }),
   },
   {
-    re: /^ {2}#(\d+) (.*?) -> ueber --max \d+, (?:bleibt|bliebe) liegen/,
+    re: /^ #(\d+) (.*?) -> ueber --max \d+, (?:bleibt|bliebe) liegen/,
     deute: (m) => ({ cardNumber: Number(m[1]), title: m[2], state: "GREY" }),
   },
killedBy: parseNightRunLog — Fixture "vollstaendiger Lauf" deutet jede Runner-Zeile — unparsedCount ist 0
statusReason: expected 1 to be +0 // Object.is equality

[Killed] Regex
src/lib/nightRunLog.ts:333:9
     deute: (m) => ({ cardNumber: Number(m[1]), title: m[2], state: "GREY" }),
   },
   {
-    re: /^ {2}#(\d+) (.*?) -> ueber --max \d+, (?:bleibt|bliebe) liegen/,
+    re: /^ {2}#(\d+) (.*?) -> ueber --max \D+, (?:bleibt|bliebe) liegen/,
     deute: (m) => ({ cardNumber: Number(m[1]), title: m[2], state: "GREY" }),
   },
killedBy: parseNightRunLog — Fixture "vollstaendiger Lauf" deutet jede Runner-Zeile — unparsedCount ist 0
statusReason: expected 1 to be +0 // Object.is equality

[Survived] Regex
src/lib/nightRunLog.ts:337:9
     deute: (m) => ({ cardNumber: Number(m[1]), title: m[2], state: "GREY" }),
   },
   {
-    re: /^#(\d+) zurueckgestellt: Abhaengigkeit/,
+    re: /#(\d+) zurueckgestellt: Abhaengigkeit/,
     deute: (m) => ({ cardNumber: Number(m[1]), state: "GREY", errorClass: "DEPENDENCY_UNMET" }),
   },

[Killed] StringLiteral
src/lib/nightRunLog.ts:338:75
   },
   {
     re: /^#(\d+) zurueckgestellt: Abhaengigkeit/,
-    deute: (m) => ({ cardNumber: Number(m[1]), state: "GREY", errorClass: "DEPENDENCY_UNMET" }),
+    deute: (m) => ({ cardNumber: Number(m[1]), state: "GREY", errorClass: "" }),
   },
   {
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht ein wegen unerfuellter Abhaengigkeit zurueckgestelltes Paket grau mit DEPENDENCY_UNMET
statusReason: expected { cardNumber: 100, title: '', …(5) } to match object { state: 'GREY', …(1) }
(5 matching properties omitted from actual)

[Killed] ObjectLiteral
src/lib/nightRunLog.ts:340:3
     re: /^#(\d+) zurueckgestellt: Abhaengigkeit/,
     deute: (m) => ({ cardNumber: Number(m[1]), state: "GREY", errorClass: "DEPENDENCY_UNMET" }),
   },
-  {
-    re: /^#(\d+) uebersprungen: /,
-    deute: (m) => ({ cardNumber: Number(m[1]), state: "GREY" }),
-  },
+  {},
 
   // --- Sessionbeginn: eroeffnet ein Arbeitspaket, dessen Ausgang noch aussteht.
killedBy: parseNightRunErgebnisstand gegen parseNightRunLog deutet 'ohneBefund' im Pruef-Lauf aus beiden Quellen gleich
statusReason: Cannot read properties of undefined (reading 'exec')

[Killed] Regex
src/lib/nightRunLog.ts:341:9
     deute: (m) => ({ cardNumber: Number(m[1]), state: "GREY", errorClass: "DEPENDENCY_UNMET" }),
   },
   {
-    re: /^#(\d+) uebersprungen: /,
+    re: /^#(\d) uebersprungen: /,
     deute: (m) => ({ cardNumber: Number(m[1]), state: "GREY" }),
   },
killedBy: parseNightRunErgebnisstand gegen parseNightRunLog deutet 'Praefix-Gate' aus beiden Quellen gleich
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] Regex
src/lib/nightRunLog.ts:341:9
     deute: (m) => ({ cardNumber: Number(m[1]), state: "GREY", errorClass: "DEPENDENCY_UNMET" }),
   },
   {
-    re: /^#(\d+) uebersprungen: /,
+    re: /^#(\D+) uebersprungen: /,
     deute: (m) => ({ cardNumber: Number(m[1]), state: "GREY" }),
   },
killedBy: parseNightRunErgebnisstand gegen parseNightRunLog deutet 'Praefix-Gate' aus beiden Quellen gleich
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] Regex
src/lib/nightRunLog.ts:347:9
 
   // --- Sessionbeginn: eroeffnet ein Arbeitspaket, dessen Ausgang noch aussteht.
   {
-    re: /^(?:Review-)?Session \d+\/\d+: Issue #(\d+) — (.*)$/,
+    re: /^(?:Review-)?Session \d+\/\d+: Issue #(\d) — (.*)$/,
     deute: (m) => ({ cardNumber: Number(m[1]), title: m[2], eroeffnet: true }),
   },
killedBy: parseNightRunLog — unvollstaendige Laeufe und harter Abbruch macht ein angefangenes Arbeitspaket ohne Ausgang rot mit HARD_ABORT
statusReason: expected [] to have a length of 1 but got +0

[Survived] Regex
src/lib/nightRunLog.ts:347:9
 
   // --- Sessionbeginn: eroeffnet ein Arbeitspaket, dessen Ausgang noch aussteht.
   {
-    re: /^(?:Review-)?Session \d+\/\d+: Issue #(\d+) — (.*)$/,
+    re: /^(?:Review-)?Session \d+\/\d+: Issue #(\d+) — (.*)/,
     deute: (m) => ({ cardNumber: Number(m[1]), title: m[2], eroeffnet: true }),
   },

[Killed] Regex
src/lib/nightRunLog.ts:373:3
  * Mehrheit der Runner-Zeilen, und je eine leere Funktion waere Ballast ohne Aussage.
  */
 const STUMME_MUSTER: readonly RegExp[] = [
-  /^ {2}#\d+ > /, // Sitzungsecho — liefert die Zuordnung Zeile → Arbeitspaket
+  /^ {2}#\d > /, // Sitzungsecho — liefert die Zuordnung Zeile → Arbeitspaket
   /^#\d+ bewusst ohne Pruefung freigegeben/,
   /^ {2}Vorflug-Session (?:startet|nicht auswertbar)/,
killedBy: parseNightRunLog — was als ungedeutet zaehlt zaehlt das Sitzungsecho nicht
statusReason: expected 1 to be +0 // Object.is equality

[Timeout] Regex
src/lib/nightRunLog.ts:374:3
  */
 const STUMME_MUSTER: readonly RegExp[] = [
   /^ {2}#\d+ > /, // Sitzungsecho — liefert die Zuordnung Zeile → Arbeitspaket
-  /^#\d+ bewusst ohne Pruefung freigegeben/,
+  /#\d+ bewusst ohne Pruefung freigegeben/,
   /^ {2}Vorflug-Session (?:startet|nicht auswertbar)/,
   /^ {2}Reviewer .*: /,

[Killed] Regex
src/lib/nightRunLog.ts:376:3
   /^ {2}#\d+ > /, // Sitzungsecho — liefert die Zuordnung Zeile → Arbeitspaket
   /^#\d+ bewusst ohne Pruefung freigegeben/,
   /^ {2}Vorflug-Session (?:startet|nicht auswertbar)/,
-  /^ {2}Reviewer .*: /,
+  /^ {2}Reviewer .: /,
   /^ {2}Kein Reviewer konfiguriert: /,
   /^ {2}Tracker \(.*\): /,
killedBy: parseNightRunLog — an echten Protokollen gefundene Muster deutet die Reviewer-Zeile auch mit Bindestrich in der Umgebung
statusReason: expected 3 to be +0 // Object.is equality

[Timeout] Regex
src/lib/nightRunLog.ts:376:3
   /^ {2}#\d+ > /, // Sitzungsecho — liefert die Zuordnung Zeile → Arbeitspaket
   /^#\d+ bewusst ohne Pruefung freigegeben/,
   /^ {2}Vorflug-Session (?:startet|nicht auswertbar)/,
-  /^ {2}Reviewer .*: /,
+  / {2}Reviewer .*: /,
   /^ {2}Kein Reviewer konfiguriert: /,
   /^ {2}Tracker \(.*\): /,

[Timeout] Regex
src/lib/nightRunLog.ts:377:3
   /^#\d+ bewusst ohne Pruefung freigegeben/,
   /^ {2}Vorflug-Session (?:startet|nicht auswertbar)/,
   /^ {2}Reviewer .*: /,
-  /^ {2}Kein Reviewer konfiguriert: /,
+  /^ Kein Reviewer konfiguriert: /,
   /^ {2}Tracker \(.*\): /,
   /^ {2}buildChecks rot — einmaliger Format-Fix/,

[Timeout] Regex
src/lib/nightRunLog.ts:379:3
   /^ {2}Reviewer .*: /,
   /^ {2}Kein Reviewer konfiguriert: /,
   /^ {2}Tracker \(.*\): /,
-  /^ {2}buildChecks rot — einmaliger Format-Fix/,
+  / {2}buildChecks rot — einmaliger Format-Fix/,
   /^ {2}FORMAT-FIX angewendet/,
   /^ {2}SALVAGE-VERSUCH gestartet/,

[Timeout] Regex
src/lib/nightRunLog.ts:382:3
   /^ {2}buildChecks rot — einmaliger Format-Fix/,
   /^ {2}FORMAT-FIX angewendet/,
   /^ {2}SALVAGE-VERSUCH gestartet/,
-  /^ {2}Salvage nicht moeglich: /,
+  /^ Salvage nicht moeglich: /,
   /^ {2}Hinweis: die vorherige Pruef-Zusammenfassung/,
   /^ {2}CLI-Meldung: /,

[Timeout] Regex
src/lib/nightRunLog.ts:383:3
   /^ {2}FORMAT-FIX angewendet/,
   /^ {2}SALVAGE-VERSUCH gestartet/,
   /^ {2}Salvage nicht moeglich: /,
-  /^ {2}Hinweis: die vorherige Pruef-Zusammenfassung/,
+  / {2}Hinweis: die vorherige Pruef-Zusammenfassung/,
   /^ {2}CLI-Meldung: /,
   /^ {2}I[nm] (?:Ready|Backlog) vorhandene Labels: /,

[Killed] Regex
src/lib/nightRunLog.ts:385:3
   /^ {2}Salvage nicht moeglich: /,
   /^ {2}Hinweis: die vorherige Pruef-Zusammenfassung/,
   /^ {2}CLI-Meldung: /,
-  /^ {2}I[nm] (?:Ready|Backlog) vorhandene Labels: /,
+  /^ I[nm] (?:Ready|Backlog) vorhandene Labels: /,
   /^ {2}Tippfehler im --(?:review-)?label-Wert\?/,
   /^WARNUNG: /,
killedBy: parseNightRunLog — an echten Protokollen gefundene Muster deutet beide Praepositionen der Label-Zeile
statusReason: expected 2 to be +0 // Object.is equality

[Survived] Regex
src/lib/nightRunLog.ts:385:3
   /^ {2}Salvage nicht moeglich: /,
   /^ {2}Hinweis: die vorherige Pruef-Zusammenfassung/,
   /^ {2}CLI-Meldung: /,
-  /^ {2}I[nm] (?:Ready|Backlog) vorhandene Labels: /,
+  / {2}I[nm] (?:Ready|Backlog) vorhandene Labels: /,
   /^ {2}Tippfehler im --(?:review-)?label-Wert\?/,
   /^WARNUNG: /,

[Survived] Regex
src/lib/nightRunLog.ts:387:3
   /^ {2}CLI-Meldung: /,
   /^ {2}I[nm] (?:Ready|Backlog) vorhandene Labels: /,
   /^ {2}Tippfehler im --(?:review-)?label-Wert\?/,
-  /^WARNUNG: /,
+  /WARNUNG: /,
   /^Ready ist leer — nichts zu tun\./,
   /^Keine Review-Kandidaten im Backlog/,

[Survived] Regex
src/lib/nightRunLog.ts:393:3
   /^Morgen-Ritual: /,
   PRUEFBLOCK,
   /^Pruefungen: keine Implementierungs-Runde gelaufen\.$/,
-  /^ {2}Summe: \d+ Session\(s\)/,
+  /^ {2}Summe: \d Session\(s\)/,
   ABSCHLUSS,
 ]

[Killed] Regex
src/lib/nightRunLog.ts:398:24
 ]
 
 /** Zeilen des Pruefblocks — sie aendern den Zustand eines bereits bekannten Pakets. */
-const PRUEF_GELAUFEN = /^ {2}Issue #(\d+): gelaufen: (.*?) \| ausgelassen:/
+const PRUEF_GELAUFEN = /^ {2}Issue #(\d): gelaufen: (.*?) \| ausgelassen:/
 const PRUEF_UNGEPRUEFT = /^ {2}Issue #(\d+): ungeprueft — /
 const PRUEF_LEER = /^ {2}Issue #(\d+): leeres Paket — /
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg mit roter Pruefung gelb, nicht gruen
statusReason: expected { cardNumber: 100, …(8) } to match object { state: 'YELLOW', …(1) }
(7 matching properties omitted from actual)

[Killed] Regex
src/lib/nightRunLog.ts:398:24
 ]
 
 /** Zeilen des Pruefblocks — sie aendern den Zustand eines bereits bekannten Pakets. */
-const PRUEF_GELAUFEN = /^ {2}Issue #(\d+): gelaufen: (.*?) \| ausgelassen:/
+const PRUEF_GELAUFEN = /^ {2}Issue #(\D+): gelaufen: (.*?) \| ausgelassen:/
 const PRUEF_UNGEPRUEFT = /^ {2}Issue #(\d+): ungeprueft — /
 const PRUEF_LEER = /^ {2}Issue #(\d+): leeres Paket — /
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg mit roter Pruefung gelb, nicht gruen
statusReason: expected { cardNumber: 100, …(8) } to match object { state: 'YELLOW', …(1) }
(7 matching properties omitted from actual)
