[Survived] Regex
src/lib/nightRunLog.ts:399:26
 
 /** Zeilen des Pruefblocks — sie aendern den Zustand eines bereits bekannten Pakets. */
 const PRUEF_GELAUFEN = /^ {2}Issue #(\d+): gelaufen: (.*?) \| ausgelassen:/
-const PRUEF_UNGEPRUEFT = /^ {2}Issue #(\d+): ungeprueft — /
+const PRUEF_UNGEPRUEFT = / {2}Issue #(\d+): ungeprueft — /
 const PRUEF_LEER = /^ {2}Issue #(\d+): leeres Paket — /
 

[Killed] ArrowFunction
src/lib/nightRunLog.ts:421:21
   runExcerpt?: string
 }
 
-const neuerAufbau = (startedAt: string, modus: string): Aufbau => ({
-  startedAt,
-  mode: modus.toLowerCase().startsWith('review') ? 'REVIEW' : 'IMPLEMENTATION',
-  letzterZeitstempel: startedAt,
-  dryRun: false,
-  abgeschlossen: false,
-  unparsedCount: 0,
-  unparsedSample: [],
-  items: [],
-  nachNummer: new Map(),
-  aktuellesPaket: null,
-})
+const neuerAufbau = () => undefined
 
 /** Legt ein Arbeitspaket an oder liefert das vorhandene — je Nummer genau eines. */
killedBy: parseNightRunLog — Zerlegung in Laeufe ignoriert Text vor der ersten Startzeile
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrayDeclaration
src/lib/nightRunLog.ts:428:19
   dryRun: false,
   abgeschlossen: false,
   unparsedCount: 0,
-  unparsedSample: [],
+  unparsedSample: ["Stryker was here"],
   items: [],
   nachNummer: new Map(),
killedBy: parseNightRunLog — was als ungedeutet zaehlt zaehlt eine Runner-Zeile mit Praefix ohne passendes Muster und liefert einen Auszug
statusReason: expected [ 'Stryker was here', …(1) ] to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/lib/nightRunLog.ts:435:72
 })
 
 /** Legt ein Arbeitspaket an oder liefert das vorhandene — je Nummer genau eines. */
-function paket(a: Aufbau, nummer: number, zeile: string): NightRunItem {
-  const vorhanden = a.nachNummer.get(nummer)
-  if (vorhanden) return vorhanden
-  const neu: NightRunItem = {
-    cardNumber: nummer,
-    title: '',
-    // Bis ein Ausgang bekannt ist, gilt der Abbruch: Ein eroeffnetes Paket ohne
-    // Ausgang bedeutet, dass der Lauf mittendrin endete.
-    state: 'RED',
-    errorClass: 'HARD_ABORT',
-    excerpt: zeile,
-    position: a.items.length,
-    rawLines: [],
-  }
-  a.items.push(neu)
-  a.nachNummer.set(nummer, neu)
-  return neu
-}
+function paket(a: Aufbau, nummer: number, zeile: string): NightRunItem {}
 
 /**
killedBy: parseNightRunLog — unvollstaendige Laeufe und harter Abbruch markiert einen Lauf ohne Abschlusszeile als incomplete
statusReason: Cannot set properties of undefined (setting 'title')

[Survived] StringLiteral
src/lib/nightRunLog.ts:440:12
   if (vorhanden) return vorhanden
   const neu: NightRunItem = {
     cardNumber: nummer,
-    title: '',
+    title: "Stryker was here!",
     // Bis ein Ausgang bekannt ist, gilt der Abbruch: Ein eroeffnetes Paket ohne
     // Ausgang bedeutet, dass der Lauf mittendrin endete.

[Killed] StringLiteral
src/lib/nightRunLog.ts:443:12
     title: '',
     // Bis ein Ausgang bekannt ist, gilt der Abbruch: Ein eroeffnetes Paket ohne
     // Ausgang bedeutet, dass der Lauf mittendrin endete.
-    state: 'RED',
+    state: "",
     errorClass: 'HARD_ABORT',
     excerpt: zeile,
killedBy: parseNightRunLog — unvollstaendige Laeufe und harter Abbruch macht ein angefangenes Arbeitspaket ohne Ausgang rot mit HARD_ABORT
statusReason: expected { cardNumber: 100, …(6) } to match object { cardNumber: 100, state: 'RED', …(1) }
(4 matching properties omitted from actual)

[Killed] ArrayDeclaration
src/lib/nightRunLog.ts:447:15
     errorClass: 'HARD_ABORT',
     excerpt: zeile,
     position: a.items.length,
-    rawLines: [],
+    rawLines: ["Stryker was here"],
   }
   a.items.push(neu)
killedBy: parseNightRunLog — Rohprotokoll je Arbeitspaket nimmt die Session-Oeffnungszeile mit Zeitstempel-Praefix als erste Zeile auf
statusReason: expected 'Stryker was here' to be '[2026-09-01T22:01:00.000Z] Session 1/…' // Object.is equality

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:462:7
  */
 function deutePruefzeile(a: Aufbau, inhalt: string, roh: string): boolean {
   const gelaufen = PRUEF_GELAUFEN.exec(inhalt)
-  if (gelaufen) {
+  if (false) {
     const item = a.nachNummer.get(Number(gelaufen[1]))
     item?.rawLines.push(roh)
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg mit roter Pruefung gelb, nicht gruen
statusReason: expected { cardNumber: 100, …(8) } to match object { state: 'YELLOW', …(1) }
(7 matching properties omitted from actual)

[Killed] BlockStatement
src/lib/nightRunLog.ts:462:17
  */
 function deutePruefzeile(a: Aufbau, inhalt: string, roh: string): boolean {
   const gelaufen = PRUEF_GELAUFEN.exec(inhalt)
-  if (gelaufen) {
-    const item = a.nachNummer.get(Number(gelaufen[1]))
-    item?.rawLines.push(roh)
-    // Nur ein als erfolgreich gemeldetes Paket kippt auf gelb — ein rotes bleibt rot.
-    if (item?.state === 'GREEN' && / -> rot /.test(gelaufen[2])) {
-      item.state = 'YELLOW'
-      item.errorClass = 'CHECKS_RED'
-      item.excerpt = inhalt
-    }
-    return true
-  }
+  if (gelaufen) {}
   const ungeprueft = PRUEF_UNGEPRUEFT.exec(inhalt)
   if (ungeprueft) {
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg mit roter Pruefung gelb, nicht gruen
statusReason: expected { cardNumber: 100, …(8) } to match object { state: 'YELLOW', …(1) }
(7 matching properties omitted from actual)

[Killed] OptionalChaining
src/lib/nightRunLog.ts:464:5
   const gelaufen = PRUEF_GELAUFEN.exec(inhalt)
   if (gelaufen) {
     const item = a.nachNummer.get(Number(gelaufen[1]))
-    item?.rawLines.push(roh)
+    item.rawLines.push(roh)
     // Nur ein als erfolgreich gemeldetes Paket kippt auf gelb — ein rotes bleibt rot.
     if (item?.state === 'GREEN' && / -> rot /.test(gelaufen[2])) {
killedBy: parseNightRunLog — Rohprotokoll je Arbeitspaket verwirft eine Pruefzeile zu einer unbekannten Nummer
statusReason: Cannot read properties of undefined (reading 'rawLines')

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:466:9
     const item = a.nachNummer.get(Number(gelaufen[1]))
     item?.rawLines.push(roh)
     // Nur ein als erfolgreich gemeldetes Paket kippt auf gelb — ein rotes bleibt rot.
-    if (item?.state === 'GREEN' && / -> rot /.test(gelaufen[2])) {
+    if (true) {
       item.state = 'YELLOW'
       item.errorClass = 'CHECKS_RED'
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg mit gruenen Pruefungen gruen
statusReason: expected { cardNumber: 100, …(8) } to match object { state: 'GREEN', …(2) }
(6 matching properties omitted from actual)

[Killed] StringLiteral
src/lib/nightRunLog.ts:468:25
     // Nur ein als erfolgreich gemeldetes Paket kippt auf gelb — ein rotes bleibt rot.
     if (item?.state === 'GREEN' && / -> rot /.test(gelaufen[2])) {
       item.state = 'YELLOW'
-      item.errorClass = 'CHECKS_RED'
+      item.errorClass = ""
       item.excerpt = inhalt
     }
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg mit roter Pruefung gelb, nicht gruen
statusReason: expected { cardNumber: 100, …(8) } to match object { state: 'YELLOW', …(1) }
(7 matching properties omitted from actual)

[Killed] BlockStatement
src/lib/nightRunLog.ts:474:19
     return true
   }
   const ungeprueft = PRUEF_UNGEPRUEFT.exec(inhalt)
-  if (ungeprueft) {
-    const item = a.nachNummer.get(Number(ungeprueft[1]))
-    item?.rawLines.push(roh)
-    if (item?.state === 'GREEN') {
-      item.state = 'YELLOW'
-      item.errorClass = 'CHECKS_NOT_STARTED'
-      item.excerpt = inhalt
-    }
-    return true
-  }
+  if (ungeprueft) {}
   const leer = PRUEF_LEER.exec(inhalt)
   if (!leer) return false
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg ohne gefahrene Pruefung gelb mit CHECKS_NOT_STARTED
statusReason: expected { cardNumber: 100, …(8) } to match object { state: 'YELLOW', …(1) }
(7 matching properties omitted from actual)

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:474:7
     return true
   }
   const ungeprueft = PRUEF_UNGEPRUEFT.exec(inhalt)
-  if (ungeprueft) {
+  if (false) {
     const item = a.nachNummer.get(Number(ungeprueft[1]))
     item?.rawLines.push(roh)
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg ohne gefahrene Pruefung gelb mit CHECKS_NOT_STARTED
statusReason: expected { cardNumber: 100, …(8) } to match object { state: 'YELLOW', …(1) }
(7 matching properties omitted from actual)

[Killed] OptionalChaining
src/lib/nightRunLog.ts:476:5
   const ungeprueft = PRUEF_UNGEPRUEFT.exec(inhalt)
   if (ungeprueft) {
     const item = a.nachNummer.get(Number(ungeprueft[1]))
-    item?.rawLines.push(roh)
+    item.rawLines.push(roh)
     if (item?.state === 'GREEN') {
       item.state = 'YELLOW'
killedBy: parseNightRunLog — Rohprotokoll je Arbeitspaket verwirft eine Pruefzeile zu einer unbekannten Nummer
statusReason: Cannot read properties of undefined (reading 'rawLines')

[Killed] BlockStatement
src/lib/nightRunLog.ts:477:34
   if (ungeprueft) {
     const item = a.nachNummer.get(Number(ungeprueft[1]))
     item?.rawLines.push(roh)
-    if (item?.state === 'GREEN') {
-      item.state = 'YELLOW'
-      item.errorClass = 'CHECKS_NOT_STARTED'
-      item.excerpt = inhalt
-    }
+    if (item?.state === 'GREEN') {}
     return true
   }
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg ohne gefahrene Pruefung gelb mit CHECKS_NOT_STARTED
statusReason: expected { cardNumber: 100, …(8) } to match object { state: 'YELLOW', …(1) }
(7 matching properties omitted from actual)

[Killed] OptionalChaining
src/lib/nightRunLog.ts:477:9
   if (ungeprueft) {
     const item = a.nachNummer.get(Number(ungeprueft[1]))
     item?.rawLines.push(roh)
-    if (item?.state === 'GREEN') {
+    if (item.state === 'GREEN') {
       item.state = 'YELLOW'
       item.errorClass = 'CHECKS_NOT_STARTED'
killedBy: parseNightRunLog — Rohprotokoll je Arbeitspaket verwirft eine Pruefzeile zu einer unbekannten Nummer
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:485:7
     return true
   }
   const leer = PRUEF_LEER.exec(inhalt)
-  if (!leer) return false
+  if (false) return false
   // Ein leeres Paket gilt als geprueft: Es gab nichts zu pruefen, und die
   // Erfolgszeile liegt vor. Der Zustand bleibt, wie er ist.
killedBy: parseNightRunLog — Zerlegung in Laeufe ignoriert Text vor der ersten Startzeile
statusReason: Cannot read properties of null (reading '1')

[Killed] BooleanLiteral
src/lib/nightRunLog.ts:485:7
     return true
   }
   const leer = PRUEF_LEER.exec(inhalt)
-  if (!leer) return false
+  if (leer) return false
   // Ein leeres Paket gilt als geprueft: Es gab nichts zu pruefen, und die
   // Erfolgszeile liegt vor. Der Zustand bleibt, wie er ist.
killedBy: parseNightRunLog — Zerlegung in Laeufe ignoriert Text vor der ersten Startzeile
statusReason: Cannot read properties of null (reading '1')

[Killed] OptionalChaining
src/lib/nightRunLog.ts:488:3
   if (!leer) return false
   // Ein leeres Paket gilt als geprueft: Es gab nichts zu pruefen, und die
   // Erfolgszeile liegt vor. Der Zustand bleibt, wie er ist.
-  a.nachNummer.get(Number(leer[1]))?.rawLines.push(roh)
+  a.nachNummer.get(Number(leer[1])).rawLines.push(roh)
   return true
 }
killedBy: parseNightRunLog — Rohprotokoll je Arbeitspaket verwirft eine Pruefzeile zu einer unbekannten Nummer
statusReason: Cannot read properties of undefined (reading 'rawLines')

[Killed] BooleanLiteral
src/lib/nightRunLog.ts:489:10
   // Ein leeres Paket gilt als geprueft: Es gab nichts zu pruefen, und die
   // Erfolgszeile liegt vor. Der Zustand bleibt, wie er ist.
   a.nachNummer.get(Number(leer[1]))?.rawLines.push(roh)
-  return true
+  return false
 }
 
killedBy: parseNightRunLog — Rohprotokoll je Arbeitspaket verwirft eine Pruefzeile zu einer unbekannten Nummer
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/lib/nightRunLog.ts:513:93
  *
  * @returns das Arbeitspaket, falls die Zeile es eroeffnet — sonst `undefined`
  */
-function verarbeiteTreffer(a: Aufbau, t: Treffer, inhalt: string): NightRunItem | undefined {
-  let eroeffnet: NightRunItem | undefined
-  if (t.cardNumber !== undefined) {
-    const item = paket(a, t.cardNumber, inhalt)
-    if (t.title) item.title = t.title
-    if (t.eroeffnet) eroeffnet = item
-    else if (t.state) {
-      item.state = t.state
-      item.errorClass = t.errorClass
-      item.excerpt = inhalt
-      if (t.durationMs !== undefined) item.durationMs = t.durationMs
-      if (t.commit !== undefined) item.commit = t.commit
-    }
-  }
-  return eroeffnet
-}
+function verarbeiteTreffer(a: Aufbau, t: Treffer, inhalt: string): NightRunItem | undefined {}
 
 /**
killedBy: parseNightRunLog — unvollstaendige Laeufe und harter Abbruch macht ein angefangenes Arbeitspaket ohne Ausgang rot mit HARD_ABORT
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:515:7
  */
 function verarbeiteTreffer(a: Aufbau, t: Treffer, inhalt: string): NightRunItem | undefined {
   let eroeffnet: NightRunItem | undefined
-  if (t.cardNumber !== undefined) {
+  if (false) {
     const item = paket(a, t.cardNumber, inhalt)
     if (t.title) item.title = t.title
killedBy: parseNightRunLog — unvollstaendige Laeufe und harter Abbruch macht ein angefangenes Arbeitspaket ohne Ausgang rot mit HARD_ABORT
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/lib/nightRunLog.ts:515:35
  */
 function verarbeiteTreffer(a: Aufbau, t: Treffer, inhalt: string): NightRunItem | undefined {
   let eroeffnet: NightRunItem | undefined
-  if (t.cardNumber !== undefined) {
-    const item = paket(a, t.cardNumber, inhalt)
-    if (t.title) item.title = t.title
-    if (t.eroeffnet) eroeffnet = item
-    else if (t.state) {
-      item.state = t.state
-      item.errorClass = t.errorClass
-      item.excerpt = inhalt
-      if (t.durationMs !== undefined) item.durationMs = t.durationMs
-      if (t.commit !== undefined) item.commit = t.commit
-    }
-  }
+  if (t.cardNumber !== undefined) {}
   return eroeffnet
 }
killedBy: parseNightRunLog — unvollstaendige Laeufe und harter Abbruch macht ein angefangenes Arbeitspaket ohne Ausgang rot mit HARD_ABORT
statusReason: expected [] to have a length of 1 but got +0

[Survived] ConditionalExpression
src/lib/nightRunLog.ts:517:9
   let eroeffnet: NightRunItem | undefined
   if (t.cardNumber !== undefined) {
     const item = paket(a, t.cardNumber, inhalt)
-    if (t.title) item.title = t.title
+    if (false) item.title = t.title
     if (t.eroeffnet) eroeffnet = item
     else if (t.state) {

[Survived] ConditionalExpression
src/lib/nightRunLog.ts:517:9
   let eroeffnet: NightRunItem | undefined
   if (t.cardNumber !== undefined) {
     const item = paket(a, t.cardNumber, inhalt)
-    if (t.title) item.title = t.title
+    if (true) item.title = t.title
     if (t.eroeffnet) eroeffnet = item
     else if (t.state) {

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:518:9
   if (t.cardNumber !== undefined) {
     const item = paket(a, t.cardNumber, inhalt)
     if (t.title) item.title = t.title
-    if (t.eroeffnet) eroeffnet = item
+    if (false) eroeffnet = item
     else if (t.state) {
       item.state = t.state
killedBy: parseNightRunLog — Rohprotokoll je Arbeitspaket nimmt die Session-Oeffnungszeile mit Zeitstempel-Praefix als erste Zeile auf
statusReason: expected undefined to be '[2026-09-01T22:01:00.000Z] Session 1/…' // Object.is equality

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:518:9
   if (t.cardNumber !== undefined) {
     const item = paket(a, t.cardNumber, inhalt)
     if (t.title) item.title = t.title
-    if (t.eroeffnet) eroeffnet = item
+    if (true) eroeffnet = item
     else if (t.state) {
       item.state = t.state
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg mit gruenen Pruefungen gruen
statusReason: expected { cardNumber: 100, …(6) } to match object { state: 'GREEN', …(2) }
(6 matching properties omitted from actual)

[Killed] BlockStatement
src/lib/nightRunLog.ts:519:23
     const item = paket(a, t.cardNumber, inhalt)
     if (t.title) item.title = t.title
     if (t.eroeffnet) eroeffnet = item
-    else if (t.state) {
-      item.state = t.state
-      item.errorClass = t.errorClass
-      item.excerpt = inhalt
-      if (t.durationMs !== undefined) item.durationMs = t.durationMs
-      if (t.commit !== undefined) item.commit = t.commit
-    }
+    else if (t.state) {}
   }
   return eroeffnet
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg mit gruenen Pruefungen gruen
statusReason: expected { cardNumber: 100, …(6) } to match object { state: 'GREEN', …(2) }
(6 matching properties omitted from actual)

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:519:14
     const item = paket(a, t.cardNumber, inhalt)
     if (t.title) item.title = t.title
     if (t.eroeffnet) eroeffnet = item
-    else if (t.state) {
+    else if (false) {
       item.state = t.state
       item.errorClass = t.errorClass
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg mit gruenen Pruefungen gruen
statusReason: expected { cardNumber: 100, …(6) } to match object { state: 'GREEN', …(2) }
(6 matching properties omitted from actual)

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:523:11
       item.state = t.state
       item.errorClass = t.errorClass
       item.excerpt = inhalt
-      if (t.durationMs !== undefined) item.durationMs = t.durationMs
+      if (false) item.durationMs = t.durationMs
       if (t.commit !== undefined) item.commit = t.commit
     }
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg mit gruenen Pruefungen gruen
statusReason: expected { cardNumber: 100, …(7) } to match object { state: 'GREEN', …(2) }
(6 matching properties omitted from actual)

[Killed] EqualityOperator
src/lib/nightRunLog.ts:523:11
       item.state = t.state
       item.errorClass = t.errorClass
       item.excerpt = inhalt
-      if (t.durationMs !== undefined) item.durationMs = t.durationMs
+      if (t.durationMs === undefined) item.durationMs = t.durationMs
       if (t.commit !== undefined) item.commit = t.commit
     }
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg mit gruenen Pruefungen gruen
statusReason: expected { cardNumber: 100, …(7) } to match object { state: 'GREEN', …(2) }
(6 matching properties omitted from actual)

[Killed] BlockStatement
src/lib/nightRunLog.ts:536:70
  * @param inhalt die Zeile ohne Zeitstempel-Praefix — daran greifen die Muster
  * @param roh die Zeile, wie sie in der Datei steht — sie geht ins Rohprotokoll
  */
-function deuteZeile(a: Aufbau, inhalt: string, roh: string): Deutung {
-  if (deutePruefzeile(a, inhalt, roh)) return { gedeutet: true, eigenzuordnung: true }
-  if (STUMME_MUSTER.some((re) => re.test(inhalt))) {
-    const nummer = STUMME_NUMMER.exec(inhalt)
-    return { gedeutet: true, cardNumber: nummer ? Number(nummer[1]) : undefined }
-  }
-  for (const { re, deute } of MUSTER) {
-    const m = re.exec(inhalt)
-    if (!m) continue
-    const t = deute(m)
-    const eroeffnet = verarbeiteTreffer(a, t, inhalt)
-    return { gedeutet: true, cardNumber: t.cardNumber, eroeffnet }
-  }
-  return { gedeutet: false }
-}
+function deuteZeile(a: Aufbau, inhalt: string, roh: string): Deutung {}
 
 /**
killedBy: parseNightRunLog — Zerlegung in Laeufe ignoriert Text vor der ersten Startzeile
statusReason: Cannot read properties of undefined (reading 'gedeutet')

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:537:7
  * @param roh die Zeile, wie sie in der Datei steht — sie geht ins Rohprotokoll
  */
 function deuteZeile(a: Aufbau, inhalt: string, roh: string): Deutung {
-  if (deutePruefzeile(a, inhalt, roh)) return { gedeutet: true, eigenzuordnung: true }
+  if (false) return { gedeutet: true, eigenzuordnung: true }
   if (STUMME_MUSTER.some((re) => re.test(inhalt))) {
     const nummer = STUMME_NUMMER.exec(inhalt)
killedBy: parseNightRunLog — Zustandszuordnung je Arbeitspaket macht Erfolg mit roter Pruefung gelb, nicht gruen
statusReason: expected { cardNumber: 100, …(8) } to match object { state: 'YELLOW', …(1) }
(7 matching properties omitted from actual)

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:537:7
  * @param roh die Zeile, wie sie in der Datei steht — sie geht ins Rohprotokoll
  */
 function deuteZeile(a: Aufbau, inhalt: string, roh: string): Deutung {
-  if (deutePruefzeile(a, inhalt, roh)) return { gedeutet: true, eigenzuordnung: true }
+  if (true) return { gedeutet: true, eigenzuordnung: true }
   if (STUMME_MUSTER.some((re) => re.test(inhalt))) {
     const nummer = STUMME_NUMMER.exec(inhalt)
killedBy: parseNightRunLog — unvollstaendige Laeufe und harter Abbruch macht ein angefangenes Arbeitspaket ohne Ausgang rot mit HARD_ABORT
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/lib/nightRunLog.ts:538:52
  */
 function deuteZeile(a: Aufbau, inhalt: string, roh: string): Deutung {
   if (deutePruefzeile(a, inhalt, roh)) return { gedeutet: true, eigenzuordnung: true }
-  if (STUMME_MUSTER.some((re) => re.test(inhalt))) {
-    const nummer = STUMME_NUMMER.exec(inhalt)
-    return { gedeutet: true, cardNumber: nummer ? Number(nummer[1]) : undefined }
-  }
+  if (STUMME_MUSTER.some((re) => re.test(inhalt))) {}
   for (const { re, deute } of MUSTER) {
     const m = re.exec(inhalt)
killedBy: parseNightRunLog — Zerlegung in Laeufe ignoriert auch eine Runner-Zeile mit Praefix vor dem ersten Start
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrowFunction
src/lib/nightRunLog.ts:538:26
  */
 function deuteZeile(a: Aufbau, inhalt: string, roh: string): Deutung {
   if (deutePruefzeile(a, inhalt, roh)) return { gedeutet: true, eigenzuordnung: true }
-  if (STUMME_MUSTER.some((re) => re.test(inhalt))) {
+  if (STUMME_MUSTER.some(() => undefined)) {
     const nummer = STUMME_NUMMER.exec(inhalt)
     return { gedeutet: true, cardNumber: nummer ? Number(nummer[1]) : undefined }
killedBy: parseNightRunLog — Zerlegung in Laeufe ignoriert auch eine Runner-Zeile mit Praefix vor dem ersten Start
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/lib/nightRunLog.ts:540:24
   if (deutePruefzeile(a, inhalt, roh)) return { gedeutet: true, eigenzuordnung: true }
   if (STUMME_MUSTER.some((re) => re.test(inhalt))) {
     const nummer = STUMME_NUMMER.exec(inhalt)
-    return { gedeutet: true, cardNumber: nummer ? Number(nummer[1]) : undefined }
+    return { gedeutet: false, cardNumber: nummer ? Number(nummer[1]) : undefined }
   }
   for (const { re, deute } of MUSTER) {
killedBy: parseNightRunLog — Zerlegung in Laeufe ignoriert auch eine Runner-Zeile mit Praefix vor dem ersten Start
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ObjectLiteral
src/lib/nightRunLog.ts:540:12
   if (deutePruefzeile(a, inhalt, roh)) return { gedeutet: true, eigenzuordnung: true }
   if (STUMME_MUSTER.some((re) => re.test(inhalt))) {
     const nummer = STUMME_NUMMER.exec(inhalt)
-    return { gedeutet: true, cardNumber: nummer ? Number(nummer[1]) : undefined }
+    return {}
   }
   for (const { re, deute } of MUSTER) {
killedBy: parseNightRunLog — Zerlegung in Laeufe ignoriert auch eine Runner-Zeile mit Praefix vor dem ersten Start
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/lib/nightRunLog.ts:542:39
     const nummer = STUMME_NUMMER.exec(inhalt)
     return { gedeutet: true, cardNumber: nummer ? Number(nummer[1]) : undefined }
   }
-  for (const { re, deute } of MUSTER) {
-    const m = re.exec(inhalt)
-    if (!m) continue
-    const t = deute(m)
-    const eroeffnet = verarbeiteTreffer(a, t, inhalt)
-    return { gedeutet: true, cardNumber: t.cardNumber, eroeffnet }
-  }
+  for (const { re, deute } of MUSTER) {}
   return { gedeutet: false }
 }
killedBy: parseNightRunLog — unvollstaendige Laeufe und harter Abbruch macht ein angefangenes Arbeitspaket ohne Ausgang rot mit HARD_ABORT
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:544:9
   }
   for (const { re, deute } of MUSTER) {
     const m = re.exec(inhalt)
-    if (!m) continue
+    if (true) continue
     const t = deute(m)
     const eroeffnet = verarbeiteTreffer(a, t, inhalt)
killedBy: parseNightRunLog — unvollstaendige Laeufe und harter Abbruch macht ein angefangenes Arbeitspaket ohne Ausgang rot mit HARD_ABORT
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
src/lib/nightRunLog.ts:544:9
   }
   for (const { re, deute } of MUSTER) {
     const m = re.exec(inhalt)
-    if (!m) continue
+    if (m) continue
     const t = deute(m)
     const eroeffnet = verarbeiteTreffer(a, t, inhalt)
killedBy: parseNightRunLog — unvollstaendige Laeufe und harter Abbruch markiert einen Lauf ohne Abschlusszeile als incomplete
statusReason: Cannot read properties of null (reading '3')

[Killed] BooleanLiteral
src/lib/nightRunLog.ts:547:24
     if (!m) continue
     const t = deute(m)
     const eroeffnet = verarbeiteTreffer(a, t, inhalt)
-    return { gedeutet: true, cardNumber: t.cardNumber, eroeffnet }
+    return { gedeutet: false, cardNumber: t.cardNumber, eroeffnet }
   }
   return { gedeutet: false }
killedBy: parseNightRunLog — an echten Protokollen gefundene Muster versteht Minutenangaben mit Nachkommastelle
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/lib/nightRunLog.ts:549:22
     const eroeffnet = verarbeiteTreffer(a, t, inhalt)
     return { gedeutet: true, cardNumber: t.cardNumber, eroeffnet }
   }
-  return { gedeutet: false }
+  return { gedeutet: true }
 }
 
killedBy: parseNightRunLog — was als ungedeutet zaehlt zaehlt eine Runner-Zeile mit Praefix ohne passendes Muster und liefert einen Auszug
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/nightRunLog.ts:561:62
  * Kandidaten. Zeilen mit derselben Nummer — Sitzungsecho, Salvage, `HARTER STOPP`,
  * `CLI-Meldung` — bleiben beim Paket (Plan #744, A1).
  */
-function uebernimm(a: Aufbau, roh: string, d: Deutung): void {
-  if (d.eroeffnet) {
-    a.aktuellesPaket = d.eroeffnet
-    d.eroeffnet.rawLines.push(roh)
-    return
-  }
-  const offen = a.aktuellesPaket
-  if (!offen) return
-  if (d.eigenzuordnung) return
-  if (d.cardNumber !== undefined && d.cardNumber !== offen.cardNumber) {
-    a.aktuellesPaket = null
-    return
-  }
-  offen.rawLines.push(roh)
-}
+function uebernimm(a: Aufbau, roh: string, d: Deutung): void {}
 
 /** Schliesst einen Lauf ab und bringt ihn in die Ausgabeform. */
killedBy: parseNightRunLog — Rohprotokoll je Arbeitspaket nimmt die Session-Oeffnungszeile mit Zeitstempel-Praefix als erste Zeile auf
statusReason: expected undefined to be '[2026-09-01T22:01:00.000Z] Session 1/…' // Object.is equality

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:562:7
  * `CLI-Meldung` — bleiben beim Paket (Plan #744, A1).
  */
 function uebernimm(a: Aufbau, roh: string, d: Deutung): void {
-  if (d.eroeffnet) {
+  if (true) {
     a.aktuellesPaket = d.eroeffnet
     d.eroeffnet.rawLines.push(roh)
killedBy: parseNightRunLog — Zerlegung in Laeufe ignoriert Text vor der ersten Startzeile
statusReason: Cannot read properties of undefined (reading 'rawLines')

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:562:7
  * `CLI-Meldung` — bleiben beim Paket (Plan #744, A1).
  */
 function uebernimm(a: Aufbau, roh: string, d: Deutung): void {
-  if (d.eroeffnet) {
+  if (false) {
     a.aktuellesPaket = d.eroeffnet
     d.eroeffnet.rawLines.push(roh)
killedBy: parseNightRunLog — Rohprotokoll je Arbeitspaket nimmt die Session-Oeffnungszeile mit Zeitstempel-Praefix als erste Zeile auf
statusReason: expected undefined to be '[2026-09-01T22:01:00.000Z] Session 1/…' // Object.is equality

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:568:7
     return
   }
   const offen = a.aktuellesPaket
-  if (!offen) return
+  if (false) return
   if (d.eigenzuordnung) return
   if (d.cardNumber !== undefined && d.cardNumber !== offen.cardNumber) {
killedBy: parseNightRunLog — Zerlegung in Laeufe ignoriert Text vor der ersten Startzeile
statusReason: Cannot read properties of null (reading 'rawLines')

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:568:7
     return
   }
   const offen = a.aktuellesPaket
-  if (!offen) return
+  if (true) return
   if (d.eigenzuordnung) return
   if (d.cardNumber !== undefined && d.cardNumber !== offen.cardNumber) {
killedBy: parseNightRunLog — Rohprotokoll je Arbeitspaket trennt die Rohprotokolle mehrerer Arbeitspakete
statusReason: expected [ Array(1) ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:569:7
   }
   const offen = a.aktuellesPaket
   if (!offen) return
-  if (d.eigenzuordnung) return
+  if (false) return
   if (d.cardNumber !== undefined && d.cardNumber !== offen.cardNumber) {
     a.aktuellesPaket = null
killedBy: parseNightRunLog — Rohprotokoll je Arbeitspaket ordnet eine Pruefblock-Zeile dem per Nummer referenzierten Paket zu, nicht dem zuletzt offenen
statusReason: expected [ …(2) ] to deeply equal [ Array(1) ]

[Killed] ConditionalExpression
src/lib/nightRunLog.ts:569:7
   }
   const offen = a.aktuellesPaket
   if (!offen) return
-  if (d.eigenzuordnung) return
+  if (true) return
   if (d.cardNumber !== undefined && d.cardNumber !== offen.cardNumber) {
     a.aktuellesPaket = null
killedBy: parseNightRunLog — Rohprotokoll je Arbeitspaket trennt die Rohprotokolle mehrerer Arbeitspakete
statusReason: expected [ Array(1) ] to deeply equal [ …(2) ]
