[Killed] StringLiteral
src/lib/statusColors.ts:40:41
  * - `text` ist der Melder als Schrift: 4,5:1 auf `bg`, Platte und Grund. Hell nachgedunkelt, dunkel
  *   hält der Entwurfston unverändert — außer Grau, das aufgehellt ist.
  */
-const HELL_GRAU: StatusColorSet = { bg: '#EEEFF2', text: '#636972', dot: '#757B86' }
+const HELL_GRAU: StatusColorSet = { bg: "", text: '#636972', dot: '#757B86' }
 const DUNKEL_GRAU: StatusColorSet = { bg: '#22272E', text: '#878E97', dot: '#6E7681' }
 
killedBy: statusColors führt in beiden Erscheinungsbildern dieselben Sets mit Hexwerten
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/statusColors.ts:41:60
  *   hält der Entwurfston unverändert — außer Grau, das aufgehellt ist.
  */
 const HELL_GRAU: StatusColorSet = { bg: '#EEEFF2', text: '#636972', dot: '#757B86' }
-const DUNKEL_GRAU: StatusColorSet = { bg: '#22272E', text: '#878E97', dot: '#6E7681' }
+const DUNKEL_GRAU: StatusColorSet = { bg: '#22272E', text: "", dot: '#6E7681' }
 
 export const STATUS_FARBWERTE: Readonly<Record<'light' | 'dark', Readonly<Record<StatusSet, StatusColorSet>>>> = {
killedBy: statusColors führt in beiden Erscheinungsbildern dieselben Sets mit Hexwerten
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/lib/statusColors.ts:43:114
 const HELL_GRAU: StatusColorSet = { bg: '#EEEFF2', text: '#636972', dot: '#757B86' }
 const DUNKEL_GRAU: StatusColorSet = { bg: '#22272E', text: '#878E97', dot: '#6E7681' }
 
-export const STATUS_FARBWERTE: Readonly<Record<'light' | 'dark', Readonly<Record<StatusSet, StatusColorSet>>>> = {
-  light: {
-    done: { bg: '#E2EFE7', text: '#277741', dot: '#2E8B4C' },
-    review: { bg: '#F3ECE0', text: '#8A6110', dot: '#A17113' },
-    progress: { bg: '#E2EBF7', text: '#2C68BD', dot: '#2F6FC9' },
-    ready: HELL_GRAU,
-    backlog: HELL_GRAU,
-    neutral: HELL_GRAU,
-    archived: HELL_GRAU,
-  },
-  dark: {
-    done: { bg: '#1D312C', text: '#46C46F', dot: '#46C46F' },
-    review: { bg: '#312E27', text: '#E0AE49', dot: '#E0AE49' },
-    progress: { bg: '#202B3D', text: '#5B96F0', dot: '#5B96F0' },
-    ready: DUNKEL_GRAU,
-    backlog: DUNKEL_GRAU,
-    neutral: DUNKEL_GRAU,
-    archived: DUNKEL_GRAU,
-  },
-}
+export const STATUS_FARBWERTE: Readonly<Record<'light' | 'dark', Readonly<Record<StatusSet, StatusColorSet>>>> = {}
 
 /** Verweise auf die Variablen eines Sets, wie `theme.ts` sie über `palette.status` anlegt. */
killedBy: statusColors setzt die Punkte hell auf die Melder des Entwurfs
statusReason: Cannot read properties of undefined (reading 'done')

[Killed] ObjectLiteral
src/lib/statusColors.ts:45:11
 
 export const STATUS_FARBWERTE: Readonly<Record<'light' | 'dark', Readonly<Record<StatusSet, StatusColorSet>>>> = {
   light: {
-    done: { bg: '#E2EFE7', text: '#277741', dot: '#2E8B4C' },
+    done: {},
     review: { bg: '#F3ECE0', text: '#8A6110', dot: '#A17113' },
     progress: { bg: '#E2EBF7', text: '#2C68BD', dot: '#2F6FC9' },
killedBy: statusColors setzt die Punkte hell auf die Melder des Entwurfs
statusReason: expected undefined to be '#2E8B4C' // Object.is equality

[Killed] StringLiteral
src/lib/statusColors.ts:47:54
   light: {
     done: { bg: '#E2EFE7', text: '#277741', dot: '#2E8B4C' },
     review: { bg: '#F3ECE0', text: '#8A6110', dot: '#A17113' },
-    progress: { bg: '#E2EBF7', text: '#2C68BD', dot: '#2F6FC9' },
+    progress: { bg: '#E2EBF7', text: '#2C68BD', dot: "" },
     ready: HELL_GRAU,
     backlog: HELL_GRAU,
killedBy: statusColors setzt die Punkte hell auf die Melder des Entwurfs
statusReason: expected '' to be '#2F6FC9' // Object.is equality

[Killed] StringLiteral
src/lib/statusColors.ts:47:38
   light: {
     done: { bg: '#E2EFE7', text: '#277741', dot: '#2E8B4C' },
     review: { bg: '#F3ECE0', text: '#8A6110', dot: '#A17113' },
-    progress: { bg: '#E2EBF7', text: '#2C68BD', dot: '#2F6FC9' },
+    progress: { bg: '#E2EBF7', text: "", dot: '#2F6FC9' },
     ready: HELL_GRAU,
     backlog: HELL_GRAU,
killedBy: statusColors führt in beiden Erscheinungsbildern dieselben Sets mit Hexwerten
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/statusColors.ts:54:50
     archived: HELL_GRAU,
   },
   dark: {
-    done: { bg: '#1D312C', text: '#46C46F', dot: '#46C46F' },
+    done: { bg: '#1D312C', text: '#46C46F', dot: "" },
     review: { bg: '#312E27', text: '#E0AE49', dot: '#E0AE49' },
     progress: { bg: '#202B3D', text: '#5B96F0', dot: '#5B96F0' },
killedBy: statusColors führt in beiden Erscheinungsbildern dieselben Sets mit Hexwerten
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/statusColors.ts:55:19
   },
   dark: {
     done: { bg: '#1D312C', text: '#46C46F', dot: '#46C46F' },
-    review: { bg: '#312E27', text: '#E0AE49', dot: '#E0AE49' },
+    review: { bg: "", text: '#E0AE49', dot: '#E0AE49' },
     progress: { bg: '#202B3D', text: '#5B96F0', dot: '#5B96F0' },
     ready: DUNKEL_GRAU,
killedBy: statusColors führt in beiden Erscheinungsbildern dieselben Sets mit Hexwerten
statusReason: expected false to be true // Object.is equality

[Survived] ObjectLiteral
src/lib/statusColors.ts:55:13
   },
   dark: {
     done: { bg: '#1D312C', text: '#46C46F', dot: '#46C46F' },
-    review: { bg: '#312E27', text: '#E0AE49', dot: '#E0AE49' },
+    review: {},
     progress: { bg: '#202B3D', text: '#5B96F0', dot: '#5B96F0' },
     ready: DUNKEL_GRAU,

[Killed] StringLiteral
src/lib/statusColors.ts:56:38
   dark: {
     done: { bg: '#1D312C', text: '#46C46F', dot: '#46C46F' },
     review: { bg: '#312E27', text: '#E0AE49', dot: '#E0AE49' },
-    progress: { bg: '#202B3D', text: '#5B96F0', dot: '#5B96F0' },
+    progress: { bg: '#202B3D', text: "", dot: '#5B96F0' },
     ready: DUNKEL_GRAU,
     backlog: DUNKEL_GRAU,
killedBy: statusColors führt in beiden Erscheinungsbildern dieselben Sets mit Hexwerten
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/statusColors.ts:56:54
   dark: {
     done: { bg: '#1D312C', text: '#46C46F', dot: '#46C46F' },
     review: { bg: '#312E27', text: '#E0AE49', dot: '#E0AE49' },
-    progress: { bg: '#202B3D', text: '#5B96F0', dot: '#5B96F0' },
+    progress: { bg: '#202B3D', text: '#5B96F0', dot: "" },
     ready: DUNKEL_GRAU,
     backlog: DUNKEL_GRAU,
killedBy: statusColors führt in beiden Erscheinungsbildern dieselben Sets mit Hexwerten
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/statusColors.ts:65:18
 }
 
 /** Verweise auf die Variablen eines Sets, wie `theme.ts` sie über `palette.status` anlegt. */
-const verweise = (set: StatusSet): StatusColorSet => ({
-  bg: `var(--mb-palette-status-${set}-bg)`,
-  text: `var(--mb-palette-status-${set}-text)`,
-  dot: `var(--mb-palette-status-${set}-dot)`,
-})
+const verweise = () => undefined
 
 // Reihenfolge nach Namensmuster; erster Treffer gewinnt (keine Überschneidungen).
killedBy: statusColors leitet je Spaltennamen den Verweis auf das passende Farbset ab
statusReason: Cannot read properties of undefined (reading 'dot')

[Killed] ObjectLiteral
src/lib/statusColors.ts:65:55
 }
 
 /** Verweise auf die Variablen eines Sets, wie `theme.ts` sie über `palette.status` anlegt. */
-const verweise = (set: StatusSet): StatusColorSet => ({
-  bg: `var(--mb-palette-status-${set}-bg)`,
-  text: `var(--mb-palette-status-${set}-text)`,
-  dot: `var(--mb-palette-status-${set}-dot)`,
-})
+const verweise = (set: StatusSet): StatusColorSet => ({})
 
 // Reihenfolge nach Namensmuster; erster Treffer gewinnt (keine Überschneidungen).
killedBy: statusColors leitet je Spaltennamen den Verweis auf das passende Farbset ab
statusReason: expected undefined to be 'var(--mb-palette-status-backlog-dot)' // Object.is equality

[Killed] StringLiteral
src/lib/statusColors.ts:66:7
 
 /** Verweise auf die Variablen eines Sets, wie `theme.ts` sie über `palette.status` anlegt. */
 const verweise = (set: StatusSet): StatusColorSet => ({
-  bg: `var(--mb-palette-status-${set}-bg)`,
+  bg: ``,
   text: `var(--mb-palette-status-${set}-text)`,
   dot: `var(--mb-palette-status-${set}-dot)`,
killedBy: statusColors liefert Fläche, Text und Punkt desselben Sets
statusReason: expected { bg: '', …(2) } to deeply equal { …(3) }

[Killed] BlockStatement
src/lib/statusColors.ts:75:60
 const MUSTER: ReadonlyArray<StatusSet> = ['done', 'review', 'progress', 'ready', 'backlog']
 
 /** Volles Farbset einer Spalte (Tint-Fläche, Text, Punkt). */
-export function statusColors(name: string): StatusColorSet {
-  const n = name.toLowerCase()
-  for (const set of MUSTER) {
-    if (n.includes(set)) {
-      return verweise(set)
-    }
-  }
-  return verweise('neutral')
-}
+export function statusColors(name: string): StatusColorSet {}
 
 /** Farbe für archivierte Karten (Badges/Listen). */
killedBy: statusColors leitet je Spaltennamen den Verweis auf das passende Farbset ab
statusReason: Cannot read properties of undefined (reading 'dot')

[Killed] BlockStatement
src/lib/statusColors.ts:77:29
 /** Volles Farbset einer Spalte (Tint-Fläche, Text, Punkt). */
 export function statusColors(name: string): StatusColorSet {
   const n = name.toLowerCase()
-  for (const set of MUSTER) {
-    if (n.includes(set)) {
-      return verweise(set)
-    }
-  }
+  for (const set of MUSTER) {}
   return verweise('neutral')
 }
killedBy: statusColors leitet je Spaltennamen den Verweis auf das passende Farbset ab
statusReason: expected 'var(--mb-palette-status-neutral-dot)' to be 'var(--mb-palette-status-backlog-dot)' // Object.is equality

[Killed] ConditionalExpression
src/lib/statusColors.ts:78:9
 export function statusColors(name: string): StatusColorSet {
   const n = name.toLowerCase()
   for (const set of MUSTER) {
-    if (n.includes(set)) {
+    if (true) {
       return verweise(set)
     }
killedBy: statusColors leitet je Spaltennamen den Verweis auf das passende Farbset ab
statusReason: expected 'var(--mb-palette-status-done-dot)' to be 'var(--mb-palette-status-backlog-dot)' // Object.is equality

[Killed] ConditionalExpression
src/lib/statusColors.ts:78:9
 export function statusColors(name: string): StatusColorSet {
   const n = name.toLowerCase()
   for (const set of MUSTER) {
-    if (n.includes(set)) {
+    if (false) {
       return verweise(set)
     }
killedBy: statusColors leitet je Spaltennamen den Verweis auf das passende Farbset ab
statusReason: expected 'var(--mb-palette-status-neutral-dot)' to be 'var(--mb-palette-status-backlog-dot)' // Object.is equality
