[Killed] BlockStatement
src/lib/useLeitstandDaten.ts:30:13
   schluessel: S | null,
   abruf: (schluessel: S) => Promise<T>,
   abhaengig: readonly unknown[],
-): Laden<T> {
-  const [zustand, setZustand] = useState<Laden<T>>(LAEDT)
-  useEffect(() => {
-    if (schluessel === null) {
-      return
-    }
-    let aktiv = true
-    setZustand(LAEDT)
-    abruf(schluessel).then(
-      (wert) => {
-        if (aktiv) setZustand({ art: 'da', wert })
-      },
-      (err: unknown) => {
-        if (aktiv) setZustand(err instanceof ApiError && err.status === 403 ? { art: 'ohneRecht' } : { art: 'fehler' })
-      },
-    )
-    return () => {
-      aktiv = false
-    }
-    // Der Abruf ist je Render eine neue Funktion; maßgeblich sind die Werte, von denen er abhängt.
-    // eslint-disable-next-line react-hooks/exhaustive-deps
-  }, abhaengig)
-  return zustand
-}
+): Laden<T> {}
 
 /** Alles, was der Leitstand (#979) für ein Board lädt und daraus ableitet. */
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: Cannot read properties of undefined (reading 'art')

[Killed] BlockStatement
src/lib/useLeitstandDaten.ts:32:19
   abhaengig: readonly unknown[],
 ): Laden<T> {
   const [zustand, setZustand] = useState<Laden<T>>(LAEDT)
-  useEffect(() => {
-    if (schluessel === null) {
-      return
-    }
-    let aktiv = true
-    setZustand(LAEDT)
-    abruf(schluessel).then(
-      (wert) => {
-        if (aktiv) setZustand({ art: 'da', wert })
-      },
-      (err: unknown) => {
-        if (aktiv) setZustand(err instanceof ApiError && err.status === 403 ? { art: 'ohneRecht' } : { art: 'fehler' })
-      },
-    )
-    return () => {
-      aktiv = false
-    }
-    // Der Abruf ist je Render eine neue Funktion; maßgeblich sind die Werte, von denen er abhängt.
-    // eslint-disable-next-line react-hooks/exhaustive-deps
-  }, abhaengig)
+  useEffect(() => {}, abhaengig)
   return zustand
 }
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: expected { art: 'laedt' } to deeply equal { art: 'da', wert: { id: 1, …(4) } }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/lib/useLeitstandDaten.ts:33:9
 ): Laden<T> {
   const [zustand, setZustand] = useState<Laden<T>>(LAEDT)
   useEffect(() => {
-    if (schluessel === null) {
+    if (true) {
       return
     }
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: expected { art: 'laedt' } to deeply equal { art: 'da', wert: { id: 1, …(4) } }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/lib/useLeitstandDaten.ts:33:9
 ): Laden<T> {
   const [zustand, setZustand] = useState<Laden<T>>(LAEDT)
   useEffect(() => {
-    if (schluessel === null) {
+    if (false) {
       return
     }
killedBy: useLeitstandDaten — Board-ID meldet keine ID als ungültig und ruft nichts ab
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      null,

[Killed] BooleanLiteral
src/lib/useLeitstandDaten.ts:36:17
     if (schluessel === null) {
       return
     }
-    let aktiv = true
+    let aktiv = false
     setZustand(LAEDT)
     abruf(schluessel).then(
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: expected { art: 'laedt' } to deeply equal { art: 'da', wert: { id: 1, …(4) } }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/lib/useLeitstandDaten.ts:39:17
     let aktiv = true
     setZustand(LAEDT)
     abruf(schluessel).then(
-      (wert) => {
-        if (aktiv) setZustand({ art: 'da', wert })
-      },
+      (wert) => {},
       (err: unknown) => {
         if (aktiv) setZustand(err instanceof ApiError && err.status === 403 ? { art: 'ohneRecht' } : { art: 'fehler' })
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: expected { art: 'laedt' } to deeply equal { art: 'da', wert: { id: 1, …(4) } }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/lib/useLeitstandDaten.ts:40:13
     setZustand(LAEDT)
     abruf(schluessel).then(
       (wert) => {
-        if (aktiv) setZustand({ art: 'da', wert })
+        if (true) setZustand({ art: 'da', wert })
       },
       (err: unknown) => {
killedBy: useLeitstandDaten — Board-ID verwirft eine Antwort, die erst nach dem Wechsel der Board-ID eintrifft
statusReason: expected { art: 'da', wert: { id: 7, …(4) } } to deeply equal { art: 'da', wert: { id: 8, …(4) } }

[Killed] ConditionalExpression
src/lib/useLeitstandDaten.ts:40:13
     setZustand(LAEDT)
     abruf(schluessel).then(
       (wert) => {
-        if (aktiv) setZustand({ art: 'da', wert })
+        if (false) setZustand({ art: 'da', wert })
       },
       (err: unknown) => {
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: expected { art: 'laedt' } to deeply equal { art: 'da', wert: { id: 1, …(4) } }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/lib/useLeitstandDaten.ts:42:25
       (wert) => {
         if (aktiv) setZustand({ art: 'da', wert })
       },
-      (err: unknown) => {
-        if (aktiv) setZustand(err instanceof ApiError && err.status === 403 ? { art: 'ohneRecht' } : { art: 'fehler' })
-      },
+      (err: unknown) => {},
     )
     return () => {
killedBy: useLeitstandDaten — Fehler deutet 403 als „ohne Recht"
statusReason: expected { art: 'laedt' } to deeply equal { art: 'ohneRecht' }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/lib/useLeitstandDaten.ts:43:31
         if (aktiv) setZustand({ art: 'da', wert })
       },
       (err: unknown) => {
-        if (aktiv) setZustand(err instanceof ApiError && err.status === 403 ? { art: 'ohneRecht' } : { art: 'fehler' })
+        if (aktiv) setZustand(true ? { art: 'ohneRecht' } : { art: 'fehler' })
       },
     )
killedBy: useLeitstandDaten — Fehler deutet jeden anderen Fehler als Fehler
statusReason: expected { art: 'ohneRecht' } to deeply equal { art: 'fehler' }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] EqualityOperator
src/lib/useLeitstandDaten.ts:43:58
         if (aktiv) setZustand({ art: 'da', wert })
       },
       (err: unknown) => {
-        if (aktiv) setZustand(err instanceof ApiError && err.status === 403 ? { art: 'ohneRecht' } : { art: 'fehler' })
+        if (aktiv) setZustand(err instanceof ApiError && err.status !== 403 ? { art: 'ohneRecht' } : { art: 'fehler' })
       },
     )
killedBy: useLeitstandDaten — Fehler deutet 403 als „ohne Recht"
statusReason: expected { art: 'fehler' } to deeply equal { art: 'ohneRecht' }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/lib/useLeitstandDaten.ts:46:18
         if (aktiv) setZustand(err instanceof ApiError && err.status === 403 ? { art: 'ohneRecht' } : { art: 'fehler' })
       },
     )
-    return () => {
-      aktiv = false
-    }
+    return () => {}
     // Der Abruf ist je Render eine neue Funktion; maßgeblich sind die Werte, von denen er abhängt.
     // eslint-disable-next-line react-hooks/exhaustive-deps
killedBy: useLeitstandDaten — Board-ID verwirft eine Antwort, die erst nach dem Wechsel der Board-ID eintrifft
statusReason: expected { art: 'da', wert: { id: 7, …(4) } } to deeply equal { art: 'da', wert: { id: 8, …(4) } }

[Killed] BooleanLiteral
src/lib/useLeitstandDaten.ts:47:15
       },
     )
     return () => {
-      aktiv = false
+      aktiv = true
     }
     // Der Abruf ist je Render eine neue Funktion; maßgeblich sind die Werte, von denen er abhängt.
killedBy: useLeitstandDaten — Board-ID verwirft eine Antwort, die erst nach dem Wechsel der Board-ID eintrifft
statusReason: expected { art: 'da', wert: { id: 7, …(4) } } to deeply equal { art: 'da', wert: { id: 8, …(4) } }

[Killed] BlockStatement
src/lib/useLeitstandDaten.ts:79:80
  * erst, wenn das Board da ist. Wer die Läufe nicht sehen darf, bekommt vom Server 403 — das bleibt
  * als `ohneRecht` still, und die Seite lässt die Lauf-Bereiche weg.
  */
-export function useLeitstandDaten(boardId: string | undefined): LeitstandDaten {
-  const id = Number.parseInt(boardId ?? '', 10)
-  const gueltigeId = Number.isInteger(id) && id > 0 ? id : null
-
-  const board = useLadenWenn(gueltigeId, (bid) => boardsApi.get(bid), [gueltigeId])
-  const kpis = useLadenWenn(gueltigeId, (bid) => dashboardApi.get(bid), [gueltigeId])
-  const epics = useLadenWenn(gueltigeId, (bid) => epicsApi.list(bid), [gueltigeId])
-  const projectId = board.art === 'da' ? board.wert.projectId : null
-  const laeufe = useLadenWenn(projectId, (pid) => nightRunsApi.list(pid), [projectId])
-  const klassen = useLadenWenn(projectId, (pid) => nightRunsApi.errorClassCounts(pid), [projectId])
-
-  const liste = laeufe.art === 'da' ? laeufe.wert : null
-  const juengster = liste === null ? null : juengsterLauf(liste)
-  const epicListe = epics.art === 'da' ? epics.wert : []
-
-  return { validId: gueltigeId !== null, board, kpis, epics, klassen, projectId, liste, juengster, epicListe }
-}
+export function useLeitstandDaten(boardId: string | undefined): LeitstandDaten {}
 
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: Cannot read properties of undefined (reading 'validId')

[Killed] LogicalOperator
src/lib/useLeitstandDaten.ts:80:30
  * als `ohneRecht` still, und die Seite lässt die Lauf-Bereiche weg.
  */
 export function useLeitstandDaten(boardId: string | undefined): LeitstandDaten {
-  const id = Number.parseInt(boardId ?? '', 10)
+  const id = Number.parseInt(boardId && '', 10)
   const gueltigeId = Number.isInteger(id) && id > 0 ? id : null
 
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/useLeitstandDaten.ts:81:46
  */
 export function useLeitstandDaten(boardId: string | undefined): LeitstandDaten {
   const id = Number.parseInt(boardId ?? '', 10)
-  const gueltigeId = Number.isInteger(id) && id > 0 ? id : null
+  const gueltigeId = Number.isInteger(id) && id >= 0 ? id : null
 
   const board = useLadenWenn(gueltigeId, (bid) => boardsApi.get(bid), [gueltigeId])
killedBy: useLeitstandDaten — Board-ID meldet die Null als ungültig und ruft nichts ab
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/useLeitstandDaten.ts:81:22
  */
 export function useLeitstandDaten(boardId: string | undefined): LeitstandDaten {
   const id = Number.parseInt(boardId ?? '', 10)
-  const gueltigeId = Number.isInteger(id) && id > 0 ? id : null
+  const gueltigeId = false ? id : null
 
   const board = useLadenWenn(gueltigeId, (bid) => boardsApi.get(bid), [gueltigeId])
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/useLeitstandDaten.ts:83:42
   const id = Number.parseInt(boardId ?? '', 10)
   const gueltigeId = Number.isInteger(id) && id > 0 ? id : null
 
-  const board = useLadenWenn(gueltigeId, (bid) => boardsApi.get(bid), [gueltigeId])
+  const board = useLadenWenn(gueltigeId, () => undefined, [gueltigeId])
   const kpis = useLadenWenn(gueltigeId, (bid) => dashboardApi.get(bid), [gueltigeId])
   const epics = useLadenWenn(gueltigeId, (bid) => epicsApi.list(bid), [gueltigeId])
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/lib/useLeitstandDaten.ts:84:41
   const gueltigeId = Number.isInteger(id) && id > 0 ? id : null
 
   const board = useLadenWenn(gueltigeId, (bid) => boardsApi.get(bid), [gueltigeId])
-  const kpis = useLadenWenn(gueltigeId, (bid) => dashboardApi.get(bid), [gueltigeId])
+  const kpis = useLadenWenn(gueltigeId, () => undefined, [gueltigeId])
   const epics = useLadenWenn(gueltigeId, (bid) => epicsApi.list(bid), [gueltigeId])
   const projectId = board.art === 'da' ? board.wert.projectId : null
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ArrowFunction
src/lib/useLeitstandDaten.ts:85:42
 
   const board = useLadenWenn(gueltigeId, (bid) => boardsApi.get(bid), [gueltigeId])
   const kpis = useLadenWenn(gueltigeId, (bid) => dashboardApi.get(bid), [gueltigeId])
-  const epics = useLadenWenn(gueltigeId, (bid) => epicsApi.list(bid), [gueltigeId])
+  const epics = useLadenWenn(gueltigeId, () => undefined, [gueltigeId])
   const projectId = board.art === 'da' ? board.wert.projectId : null
   const laeufe = useLadenWenn(projectId, (pid) => nightRunsApi.list(pid), [projectId])
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] ConditionalExpression
src/lib/useLeitstandDaten.ts:86:21
   const board = useLadenWenn(gueltigeId, (bid) => boardsApi.get(bid), [gueltigeId])
   const kpis = useLadenWenn(gueltigeId, (bid) => dashboardApi.get(bid), [gueltigeId])
   const epics = useLadenWenn(gueltigeId, (bid) => epicsApi.list(bid), [gueltigeId])
-  const projectId = board.art === 'da' ? board.wert.projectId : null
+  const projectId = true ? board.wert.projectId : null
   const laeufe = useLadenWenn(projectId, (pid) => nightRunsApi.list(pid), [projectId])
   const klassen = useLadenWenn(projectId, (pid) => nightRunsApi.errorClassCounts(pid), [projectId])
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: Cannot read properties of undefined (reading 'projectId')

[Killed] EqualityOperator
src/lib/useLeitstandDaten.ts:86:21
   const board = useLadenWenn(gueltigeId, (bid) => boardsApi.get(bid), [gueltigeId])
   const kpis = useLadenWenn(gueltigeId, (bid) => dashboardApi.get(bid), [gueltigeId])
   const epics = useLadenWenn(gueltigeId, (bid) => epicsApi.list(bid), [gueltigeId])
-  const projectId = board.art === 'da' ? board.wert.projectId : null
+  const projectId = board.art !== 'da' ? board.wert.projectId : null
   const laeufe = useLadenWenn(projectId, (pid) => nightRunsApi.list(pid), [projectId])
   const klassen = useLadenWenn(projectId, (pid) => nightRunsApi.errorClassCounts(pid), [projectId])
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: Cannot read properties of undefined (reading 'projectId')

[Killed] ArrowFunction
src/lib/useLeitstandDaten.ts:87:42
   const kpis = useLadenWenn(gueltigeId, (bid) => dashboardApi.get(bid), [gueltigeId])
   const epics = useLadenWenn(gueltigeId, (bid) => epicsApi.list(bid), [gueltigeId])
   const projectId = board.art === 'da' ? board.wert.projectId : null
-  const laeufe = useLadenWenn(projectId, (pid) => nightRunsApi.list(pid), [projectId])
+  const laeufe = useLadenWenn(projectId, () => undefined, [projectId])
   const klassen = useLadenWenn(projectId, (pid) => nightRunsApi.errorClassCounts(pid), [projectId])
 
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: expected { art: 'laedt' } to deeply equal { art: 'da', wert: { id: 1, …(4) } }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ArrayDeclaration
src/lib/useLeitstandDaten.ts:87:75
   const kpis = useLadenWenn(gueltigeId, (bid) => dashboardApi.get(bid), [gueltigeId])
   const epics = useLadenWenn(gueltigeId, (bid) => epicsApi.list(bid), [gueltigeId])
   const projectId = board.art === 'da' ? board.wert.projectId : null
-  const laeufe = useLadenWenn(projectId, (pid) => nightRunsApi.list(pid), [projectId])
+  const laeufe = useLadenWenn(projectId, (pid) => nightRunsApi.list(pid), [])
   const klassen = useLadenWenn(projectId, (pid) => nightRunsApi.errorClassCounts(pid), [projectId])
 
killedBy: useLeitstandDaten — Läufe am Projekt des Boards holt Läufe und Fehlerklassen erst, wenn das Projekt bekannt ist
statusReason: expected "spy" to be called with arguments: [ 42 ]

Received: 



Number of calls: 0

[Killed] ArrowFunction
src/lib/useLeitstandDaten.ts:88:43
   const epics = useLadenWenn(gueltigeId, (bid) => epicsApi.list(bid), [gueltigeId])
   const projectId = board.art === 'da' ? board.wert.projectId : null
   const laeufe = useLadenWenn(projectId, (pid) => nightRunsApi.list(pid), [projectId])
-  const klassen = useLadenWenn(projectId, (pid) => nightRunsApi.errorClassCounts(pid), [projectId])
+  const klassen = useLadenWenn(projectId, () => undefined, [projectId])
 
   const liste = laeufe.art === 'da' ? laeufe.wert : null
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: expected { art: 'laedt' } to deeply equal { art: 'da', wert: { id: 1, …(4) } }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/lib/useLeitstandDaten.ts:90:17
   const laeufe = useLadenWenn(projectId, (pid) => nightRunsApi.list(pid), [projectId])
   const klassen = useLadenWenn(projectId, (pid) => nightRunsApi.errorClassCounts(pid), [projectId])
 
-  const liste = laeufe.art === 'da' ? laeufe.wert : null
+  const liste = false ? laeufe.wert : null
   const juengster = liste === null ? null : juengsterLauf(liste)
   const epicListe = epics.art === 'da' ? epics.wert : []
killedBy: useLeitstandDaten — Läufe am Projekt des Boards leitet Liste, jüngsten Lauf und Vorhaben-Liste aus den geladenen Zuständen ab
statusReason: Target cannot be null or undefined.

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] EqualityOperator
src/lib/useLeitstandDaten.ts:90:17
   const laeufe = useLadenWenn(projectId, (pid) => nightRunsApi.list(pid), [projectId])
   const klassen = useLadenWenn(projectId, (pid) => nightRunsApi.errorClassCounts(pid), [projectId])
 
-  const liste = laeufe.art === 'da' ? laeufe.wert : null
+  const liste = laeufe.art !== 'da' ? laeufe.wert : null
   const juengster = liste === null ? null : juengsterLauf(liste)
   const epicListe = epics.art === 'da' ? epics.wert : []
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/lib/useLeitstandDaten.ts:91:21
   const klassen = useLadenWenn(projectId, (pid) => nightRunsApi.errorClassCounts(pid), [projectId])
 
   const liste = laeufe.art === 'da' ? laeufe.wert : null
-  const juengster = liste === null ? null : juengsterLauf(liste)
+  const juengster = false ? null : juengsterLauf(liste)
   const epicListe = epics.art === 'da' ? epics.wert : []
 
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: Cannot read properties of null (reading 'length')

[Killed] EqualityOperator
src/lib/useLeitstandDaten.ts:91:21
   const klassen = useLadenWenn(projectId, (pid) => nightRunsApi.errorClassCounts(pid), [projectId])
 
   const liste = laeufe.art === 'da' ? laeufe.wert : null
-  const juengster = liste === null ? null : juengsterLauf(liste)
+  const juengster = liste !== null ? null : juengsterLauf(liste)
   const epicListe = epics.art === 'da' ? epics.wert : []
 
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: Cannot read properties of null (reading 'length')

[Killed] ConditionalExpression
src/lib/useLeitstandDaten.ts:92:21
 
   const liste = laeufe.art === 'da' ? laeufe.wert : null
   const juengster = liste === null ? null : juengsterLauf(liste)
-  const epicListe = epics.art === 'da' ? epics.wert : []
+  const epicListe = false ? epics.wert : []
 
   return { validId: gueltigeId !== null, board, kpis, epics, klassen, projectId, liste, juengster, epicListe }
killedBy: useLeitstandDaten — Läufe am Projekt des Boards leitet Liste, jüngsten Lauf und Vorhaben-Liste aus den geladenen Zuständen ab
statusReason: expected [] to deeply equal [ { id: 1, number: 1, …(8) } ]

[Killed] ConditionalExpression
src/lib/useLeitstandDaten.ts:92:21
 
   const liste = laeufe.art === 'da' ? laeufe.wert : null
   const juengster = liste === null ? null : juengsterLauf(liste)
-  const epicListe = epics.art === 'da' ? epics.wert : []
+  const epicListe = true ? epics.wert : []
 
   return { validId: gueltigeId !== null, board, kpis, epics, klassen, projectId, liste, juengster, epicListe }
killedBy: useLeitstandDaten — Läufe am Projekt des Boards leitet Liste, jüngsten Lauf und Vorhaben-Liste aus den geladenen Zuständen ab
statusReason: expected undefined to deeply equal []

[Killed] EqualityOperator
src/lib/useLeitstandDaten.ts:94:21
   const juengster = liste === null ? null : juengsterLauf(liste)
   const epicListe = epics.art === 'da' ? epics.wert : []
 
-  return { validId: gueltigeId !== null, board, kpis, epics, klassen, projectId, liste, juengster, epicListe }
+  return { validId: gueltigeId === null, board, kpis, epics, klassen, projectId, liste, juengster, epicListe }
 }
 
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/useLeitstandDaten.ts:94:21
   const juengster = liste === null ? null : juengsterLauf(liste)
   const epicListe = epics.art === 'da' ? epics.wert : []
 
-  return { validId: gueltigeId !== null, board, kpis, epics, klassen, projectId, liste, juengster, epicListe }
+  return { validId: false, board, kpis, epics, klassen, projectId, liste, juengster, epicListe }
 }
 
killedBy: useLeitstandDaten — Board-ID lädt Board, Kennzahlen und Vorhaben zu einer gültigen ID
statusReason: expected false to be true // Object.is equality
